espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER1_MACFRAMEFILTER_REG register
 *  Contains the frame filtering controls
 */
#define GMAC_REGISTER1_MACFRAMEFILTER_REG (DR_REG_GMAC_BASE + 0x4)
/** GMAC_PROMISCUOUS_MODE : R/W; bitpos: [0]; default: 0;
 *  Promiscuous Mode When this bit is set, the Address Filter module passes all
 *  incoming frames irrespective of the destination or source address The SA or DA
 *  Filter Fails status bits of the Receive Status Word are always cleared when PR is
 *  set
 */
#define GMAC_PROMISCUOUS_MODE    (BIT(0))
#define GMAC_PROMISCUOUS_MODE_M  (GMAC_PROMISCUOUS_MODE_V << GMAC_PROMISCUOUS_MODE_S)
#define GMAC_PROMISCUOUS_MODE_V  0x00000001U
#define GMAC_PROMISCUOUS_MODE_S  0
/** GMAC_HUC : R/W; bitpos: [1]; default: 0;
 *  Hash Unicast When set, the MAC performs destination address filtering of unicast
 *  frames according to the hash table When reset, the MAC performs a perfect
 *  destination address filtering for unicast frames, that is, it compares the DA field
 *  with the values programmed in DA registers If Hash Filter is not selected during
 *  core configuration, this bit is reserved _and RO_
 */
#define GMAC_HUC    (BIT(1))
#define GMAC_HUC_M  (GMAC_HUC_V << GMAC_HUC_S)
#define GMAC_HUC_V  0x00000001U
#define GMAC_HUC_S  1
/** GMAC_HMC : R/W; bitpos: [2]; default: 0;
 *  Hash Multicast When set, the MAC performs destination address filtering of received
 *  multicast frames according to the hash table When reset, the MAC performs a perfect
 *  destination address filtering for multicast frames, that is, it compares the DA
 *  field with the values programmed in DA registers If Hash Filter is not selected
 *  during core configuration, this bit is reserved _and RO_
 */
#define GMAC_HMC    (BIT(2))
#define GMAC_HMC_M  (GMAC_HMC_V << GMAC_HMC_S)
#define GMAC_HMC_V  0x00000001U
#define GMAC_HMC_S  2
/** GMAC_DAIF : R/W; bitpos: [3]; default: 0;
 *  DA Inverse Filtering When this bit is set, the Address Check block operates in
 *  inverse filtering mode for the DA address comparison for both unicast and multicast
 *  frames When reset, normal filtering of frames is performed
 */
#define GMAC_DAIF    (BIT(3))
#define GMAC_DAIF_M  (GMAC_DAIF_V << GMAC_DAIF_S)
#define GMAC_DAIF_V  0x00000001U
#define GMAC_DAIF_S  3
/** GMAC_PM : R/W; bitpos: [4]; default: 0;
 *  Pass All Multicast When set, this bit indicates that all received frames with a
 *  multicast destination address _first bit in the destination address field is '1'_
 *  are passed When reset, filtering of multicast frame depends on HMC bit
 */
#define GMAC_PM    (BIT(4))
#define GMAC_PM_M  (GMAC_PM_V << GMAC_PM_S)
#define GMAC_PM_V  0x00000001U
#define GMAC_PM_S  4
/** GMAC_DBF : R/W; bitpos: [5]; default: 0;
 *  Disable Broadcast Frames When this bit is set, the AFM module blocks all incoming
 *  broadcast frames In addition, it overrides all other filter settings When this bit
 *  is reset, the AFM module passes all received broadcast frames
 */
#define GMAC_DBF    (BIT(5))
#define GMAC_DBF_M  (GMAC_DBF_V << GMAC_DBF_S)
#define GMAC_DBF_V  0x00000001U
#define GMAC_DBF_S  5
/** GMAC_PCF : R/W; bitpos: [7:6]; default: 0;
 *  Pass Control Frames These bits control the forwarding of all control frames
 *  _including unicast and multicast Pause frames_ 00: MAC filters all control frames
 *  from reaching the application 01: MAC forwards all control frames except Pause
 *  frames to application even if they fail the Address filter 10: MAC forwards all
 *  control frames to application even if they fail the Address Filter 11: MAC forwards
 *  control frames that pass the Address Filter The following conditions should be true
 *  for the Pause frames processing: Condition 1 : The MAC is in the fullduplex mode
 *  and flow control is enabled by setting Bit 2 _RFE_ of Register 6 _Flow Control
 *  Register_ to 1 Condition 2 : The destination address _DA_ of the received frame
 *  matches the special multicast address or the MAC Address 0 when Bit 3 _UP_ of the
 *  Register 6 _Flow Control Register_ is set Condition 3: The Type field of the
 *  received frame is 0x8808 and the OPCODE field is 0x0001 Note: This field should be
 *  set to 01 only when the Condition 1 is true, that is, the MAC is programmed to
 *  operate in the fullduplex mode and the RFE bit is enabled Otherwise, the Pause
 *  frame filtering may be inconsistent When Condition 1 is false, the Pause frames are
 *  considered as generic control frames Therefore, to pass all control frames
 *  _including Pause frames_ when the fullduplex mode and flow control is not enabled,
 *  you should set the PCF field to 10 or 11 _as required by the application_
 */
#define GMAC_PCF    0x00000003U
#define GMAC_PCF_M  (GMAC_PCF_V << GMAC_PCF_S)
#define GMAC_PCF_V  0x00000003U
#define GMAC_PCF_S  6
/** GMAC_SAIF : R/W; bitpos: [8]; default: 0;
 *  SA Inverse Filtering When this bit is set, the Address Check block operates in
 *  inverse filtering mode for the SA address comparison The frames whose SA matches
 *  the SA registers are marked as failing the SA Address filter When this bit is
 *  reset, frames whose SA does not match the SA registers are marked as failing the SA
 *  Address filter
 */
#define GMAC_SAIF    (BIT(8))
#define GMAC_SAIF_M  (GMAC_SAIF_V << GMAC_SAIF_S)
#define GMAC_SAIF_V  0x00000001U
#define GMAC_SAIF_S  8
/** GMAC_SAF : R/W; bitpos: [9]; default: 0;
 *  Source Address Filter Enable When this bit is set, the MAC compares the SA field of
 *  the received frames with the values programmed in the enabled SA registers If the
 *  comparison fails, the MAC drops the frame When this bit is reset, the MAC forwards
 *  the received frame to the application with updated SAF bit of the Rx Status
 *  depending on the SA address comparison Note: According to the IEEE specification,
 *  Bit 47 of the SA is reserved and set to 0 However, in DWC_gmac, the MAC compares
 *  all 48 bits The software driver should take this into consideration while
 *  programming the MAC address registers for SA
 */
#define GMAC_SAF    (BIT(9))
#define GMAC_SAF_M  (GMAC_SAF_V << GMAC_SAF_S)
#define GMAC_SAF_V  0x00000001U
#define GMAC_SAF_S  9
/** GMAC_HPF : R/W; bitpos: [10]; default: 0;
 *  Hash or Perfect Filter When this bit is set, it configures the address filter to
 *  pass a frame if it matches either the perfect filtering or the hash filtering as
 *  set by the HMC or HUC bits When this bit is low and the HUC or HMC bit is set, the
 *  frame is passed only if it matches the Hash filter This bit is reserved _and RO_ if
 *  the Hash filter is not selected during core configuration
 */
#define GMAC_HPF    (BIT(10))
#define GMAC_HPF_M  (GMAC_HPF_V << GMAC_HPF_S)
#define GMAC_HPF_V  0x00000001U
#define GMAC_HPF_S  10
/** GMAC_VTFE : R/W; bitpos: [16]; default: 0;
 *  VLAN Tag Filter Enable When set, this bit enables the MAC to drop VLAN tagged
 *  frames that do not match the VLAN Tag comparison When reset, the MAC forwards all
 *  frames irrespective of the match status of the VLAN Tag
 */
#define GMAC_VTFE    (BIT(16))
#define GMAC_VTFE_M  (GMAC_VTFE_V << GMAC_VTFE_S)
#define GMAC_VTFE_V  0x00000001U
#define GMAC_VTFE_S  16
/** GMAC_IPFE : R/W; bitpos: [20]; default: 0;
 *  Layer 3 and Layer 4 Filter Enable When set, this bit enables the MAC to drop frames
 *  that do not match the enabled Layer 3 and Layer 4 filters If Layer 3 or Layer 4
 *  filters are not enabled for matching, this bit does not have any effect When reset,
 *  the MAC forwards all frames irrespective of the match status of the Layer 3 and
 *  Layer 4 fields If the Layer 3 and Layer 4 Filtering feature is not selected during
 *  core configuration, this bit is reserved _RO with default value_
 */
#define GMAC_IPFE    (BIT(20))
#define GMAC_IPFE_M  (GMAC_IPFE_V << GMAC_IPFE_S)
#define GMAC_IPFE_V  0x00000001U
#define GMAC_IPFE_S  20
/** GMAC_DNTU : R/W; bitpos: [21]; default: 0;
 *  Drop nonTCP/UDP over IP Frames When set, this bit enables the MAC to drop the
 *  nonTCP or UDP over IP frames The MAC forward only those frames that are processed
 *  by the Layer 4 filter When reset, this bit enables the MAC to forward all nonTCP or
 *  UDP over IP frames If the Layer 3 and Layer 4 Filtering feature is not selected
 *  during core configuration, this bit is reserved _RO with default value_
 */
#define GMAC_DNTU    (BIT(21))
#define GMAC_DNTU_M  (GMAC_DNTU_V << GMAC_DNTU_S)
#define GMAC_DNTU_V  0x00000001U
#define GMAC_DNTU_S  21
/** GMAC_RA : R/W; bitpos: [31]; default: 0;
 *  Receive All When this bit is set, the MAC Receiver module passes all received
 *  frames, irrespective of whether they pass the address filter or not, to the
 *  Application The result of the SA or DA filtering is updated _pass or fail_ in the
 *  corresponding bits in the Receive Status Word When this bit is reset, the Receiver
 *  module passes only those frames to the Application that pass the SA or DA address
 *  filter
 */
#define GMAC_RA    (BIT(31))
#define GMAC_RA_M  (GMAC_RA_V << GMAC_RA_S)
#define GMAC_RA_V  0x00000001U
#define GMAC_RA_S  31

