espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER2_HASHTABLEHIGHREGISTER_REG register
 *  Contains the higher 32 bits of the Multicast Hash table This register is present
 *  only when you select the 64bit Hash filter function in coreConsultant _See Table 79_
 */
#define GMAC_REGISTER2_HASHTABLEHIGHREGISTER_REG (DR_REG_GMAC_BASE + 0x8)
/** GMAC_HTH : R/W; bitpos: [31:0]; default: 0;
 *  Hash Table High This field contains the upper 32 bits of the Hash table
 */
#define GMAC_HTH    0xFFFFFFFFU
#define GMAC_HTH_M  (GMAC_HTH_V << GMAC_HTH_S)
#define GMAC_HTH_V  0xFFFFFFFFU
#define GMAC_HTH_S  0

/** GMAC_REGISTER3_HASHTABLELOWREGISTER_REG register
 *  Contains the lower 32 bits of the Multicast Hash table This register is present
 *  only when you select the Hash filter function in coreConsultant _See Table 79_
 */
#define GMAC_REGISTER3_HASHTABLELOWREGISTER_REG (DR_REG_GMAC_BASE + 0xc)
/** GMAC_HTL : R/W; bitpos: [31:0]; default: 0;
 *  Hash Table Low This field contains the lower 32 bits of the Hash table
 */
#define GMAC_HTL    0xFFFFFFFFU
#define GMAC_HTL_M  (GMAC_HTL_V << GMAC_HTL_S)
#define GMAC_HTL_V  0xFFFFFFFFU
#define GMAC_HTL_S  0

/** GMAC_REGISTER4_GMIIADDRESSREGISTER_REG register
 *  Controls the management cycles to an external PHY This register is present only
 *  when you select the Station Management _MDIO_ feature in coreConsultant _See Table
 *  726_
 */
#define GMAC_REGISTER4_GMIIADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x10)
/** GMAC_GB : R/W1S; bitpos: [0]; default: 0;
 *  GMII Busy This bit should read logic 0 before writing to Register 4 and Register 5
 *  During a PHY or RevMII register access, the software sets this bit to 1’b1 to
 *  indicate that a Read or Write access is in progress Register 5 is invalid until
 *  this bit is cleared by the MAC Therefore, Register 5 _GMII Data_ should be kept
 *  valid until the MAC clears this bit during a PHY Write operation Similarly for a
 *  read operation, the contents of Register 5 are not valid until this bit is cleared
 *  The subsequent read or write operation should happen only after the previous
 *  operation is complete Because there is no acknowledgment from the PHY to MAC after
 *  a read or write operation is completed, there is no change in the functionality of
 *  this bit even when the PHY is not present
 */
#define GMAC_GB    (BIT(0))
#define GMAC_GB_M  (GMAC_GB_V << GMAC_GB_S)
#define GMAC_GB_V  0x00000001U
#define GMAC_GB_S  0
/** GMAC_GW : R/W; bitpos: [1]; default: 0;
 *  GMII Write When set, this bit indicates to the PHY or RevMII that this is a Write
 *  operation using the GMII Data register If this bit is not set, it indicates that
 *  this is a Read operation, that is, placing the data in the GMII Data register
 */
#define GMAC_GW    (BIT(1))
#define GMAC_GW_M  (GMAC_GW_V << GMAC_GW_S)
#define GMAC_GW_V  0x00000001U
#define GMAC_GW_S  1
/** GMAC_CR : R/W; bitpos: [5:2]; default: 0;
 *  CSR Clock Range The CSR Clock Range selection determines the frequency of the MDC
 *  clock according to the CSR clock frequency used in your design The CSR clock
 *  corresponding to different GMAC configurations is given in Table 92 on page 564 The
 *  suggested range of CSR clock frequency applicable for each value _when Bit[5] = 0_
 *  ensures that the MDC clock is approximately between the frequency range 10 MHz25
 *  MHz 0000: The CSR clock frequency is 60100 MHz and the MDC clock frequency is CSR
 *  clock/42 0001: The CSR clock frequency is 100150 MHz and the MDC clock frequency is
 *  CSR clock/62 0010: The CSR clock frequency is 2035 MHz and the MDC clock frequency
 *  is CSR clock/16 0011: The CSR clock frequency is 3560 MHz and the MDC clock
 *  frequency is CSR clock/26 0100: The CSR clock frequency is 150250 MHz and the MDC
 *  clock frequency is CSR clock/102 0101: The CSR clock frequency is 250300 MHz and
 *  the MDC clock is CSR clock/124 0110, 0111: Reserved When Bit 5 is set, you can
 *  achieve higher frequency of the MDC clock than the frequency limit of 25 MHz
 *  _specified in the IEEE Std 8023_ and program a clock divider of lower value For
 *  example, when CSR clock is of 100 MHz frequency and you program these bits as 1010,
 *  then the resultant MDC clock is of 125 MHz which is outside the limit of IEEE 8023
 *  specified range Program the following values only if the interfacing chips support
 *  faster MDC clocks 1000: CSR clock/4 1001: CSR clock/6 1010: CSR clock/8 1011: CSR
 *  clock/10 1100: CSR clock/12 1101: CSR clock/14 1110: CSR clock/16 1111: CSR
 *  clock/18 These bits are not used for accessing RevMII These bits are readonly if
 *  the RevMII interface is selected as single PHY interface
 */
#define GMAC_CR    0x0000000FU
#define GMAC_CR_M  (GMAC_CR_V << GMAC_CR_S)
#define GMAC_CR_V  0x0000000FU
#define GMAC_CR_S  2
/** GMAC_GR : R/W; bitpos: [10:6]; default: 0;
 *  GMII Register These bits select the desired GMII register in the selected PHY
 *  device For RevMII, these bits select the desired CSR register in the RevMII
 *  Registers set
 */
#define GMAC_GR    0x0000001FU
#define GMAC_GR_M  (GMAC_GR_V << GMAC_GR_S)
#define GMAC_GR_V  0x0000001FU
#define GMAC_GR_S  6
/** GMAC_PA : R/W; bitpos: [15:11]; default: 0;
 *  Physical Layer Address This field indicates which of the 32 possible PHY devices
 *  are being accessed For RevMII, this field gives the PHY Address of the RevMII module
 */
#define GMAC_PA    0x0000001FU
#define GMAC_PA_M  (GMAC_PA_V << GMAC_PA_S)
#define GMAC_PA_V  0x0000001FU
#define GMAC_PA_S  11

/** GMAC_REGISTER5_GMIIDATAREGISTER_REG register
 *  Contains the data to be written to or read from the PHY register This register is
 *  present only when you select the Station Management _MDIO_ feature in
 *  coreConsultant _See Table 726_
 */
#define GMAC_REGISTER5_GMIIDATAREGISTER_REG (DR_REG_GMAC_BASE + 0x14)
/** GMAC_GD : R/W; bitpos: [15:0]; default: 0;
 *  GMII Data This field contains the 16bit data value read from the PHY or RevMII
 *  after a Management Read operation or the 16bit data value to be written to the PHY
 *  or RevMII before a Management Write operation
 */
#define GMAC_GD    0x0000FFFFU
#define GMAC_GD_M  (GMAC_GD_V << GMAC_GD_S)
#define GMAC_GD_V  0x0000FFFFU
#define GMAC_GD_S  0

/** GMAC_REGISTER6_FLOWCONTROLREGISTER_REG register
 *  Controls the generation of control frames
 */
#define GMAC_REGISTER6_FLOWCONTROLREGISTER_REG (DR_REG_GMAC_BASE + 0x18)
/** GMAC_FCB_BPA : R/W1S; bitpos: [0]; default: 0;
 *  Flow Control Busy or Backpressure Activate This bit initiates a Pause frame in the
 *  fullduplex mode and activates the backpressure function in the halfduplex mode if
 *  the TFE bit is set In the fullduplex mode, this bit should be read as 1'b0 before
 *  writing to the Flow Control register To initiate a Pause frame, the Application
 *  must set this bit to 1'b1 During a transfer of the Control Frame, this bit
 *  continues to be set to signify that a frame transmission is in progress After the
 *  completion of Pause frame transmission, the MAC resets this bit to 1'b0 The Flow
 *  Control register should not be written to until this bit is cleared In the
 *  halfduplex mode, when this bit is set _and TFE is set_, then backpressure is
 *  asserted by the MAC During backpressure, when the MAC receives a new frame, the
 *  transmitter starts sending a JAM pattern resulting in a collision This control
 *  register bit is logically ORed with the mti_flowctrl_i input signal for the
 *  backpressure function When the MAC is configured for the fullduplex mode, the BPA
 *  is automatically disabled
 */
#define GMAC_FCB_BPA    (BIT(0))
#define GMAC_FCB_BPA_M  (GMAC_FCB_BPA_V << GMAC_FCB_BPA_S)
#define GMAC_FCB_BPA_V  0x00000001U
#define GMAC_FCB_BPA_S  0
/** GMAC_TFE : R/W; bitpos: [1]; default: 0;
 *  Transmit Flow Control Enable In the fullduplex mode, when this bit is set, the MAC
 *  enables the flow control operation to transmit Pause frames When this bit is reset,
 *  the flow control operation in the MAC is disabled, and the MAC does not transmit
 *  any Pause frames In the halfduplex mode, when this bit is set, the MAC enables the
 *  backpressure operation When this bit is reset, the backpressure feature is disabled
 */
#define GMAC_TFE    (BIT(1))
#define GMAC_TFE_M  (GMAC_TFE_V << GMAC_TFE_S)
#define GMAC_TFE_V  0x00000001U
#define GMAC_TFE_S  1
/** GMAC_RECEIVE_FLOW_CTRL_E : R/W; bitpos: [2]; default: 0;
 *  Receive Flow Control Enable When this bit is set, the MAC decodes the received
 *  Pause frame and disables its transmitter for a specified _Pause_ time When this bit
 *  is reset, the decode function of the Pause frame is disabled
 */
#define GMAC_RECEIVE_FLOW_CTRL_E    (BIT(2))
#define GMAC_RECEIVE_FLOW_CTRL_E_M  (GMAC_RECEIVE_FLOW_CTRL_E_V << GMAC_RECEIVE_FLOW_CTRL_E_S)
#define GMAC_RECEIVE_FLOW_CTRL_E_V  0x00000001U
#define GMAC_RECEIVE_FLOW_CTRL_E_S  2
/** GMAC_UP : R/W; bitpos: [3]; default: 0;
 *  Unicast Pause Frame Detect A pause frame is processed when it has the unique
 *  multicast address specified in the IEEE Std 8023 When this bit is set, the MAC can
 *  also detect Pause frames with unicast address of the station This unicast address
 *  should be as specified in the MAC Address0 High Register and MAC Address0 Low
 *  Register When this bit is reset, the MAC only detects Pause frames with unique
 *  multicast address Note: The MAC does not process a Pause frame if the multicast
 *  address of received frame is different from the unique multicast address
 */
#define GMAC_UP    (BIT(3))
#define GMAC_UP_M  (GMAC_UP_V << GMAC_UP_S)
#define GMAC_UP_V  0x00000001U
#define GMAC_UP_S  3
/** GMAC_PLT : R/W; bitpos: [5:4]; default: 0;
 *  Pause Low Threshold This field configures the threshold of the Pause timer at which
 *  the input flow control signal mti_flowctrl_i _or sbd_flowctrl_i_ is checked for
 *  automatic retransmission of the Pause frame The threshold values should be always
 *  less than the Pause Time configured in Bits[31:16] For example, if PT = 100H _256
 *  slottimes_, and PLT = 01, then a second Pause frame is automatically transmitted if
 *  the mti_flowctrl_i signal is asserted at 228 _256  28_ slot times after the first
 *  Pause frame is transmitted The following list provides the threshold values for
 *  different values: 00: The threshold is Pause time minus 4 slot times _PT  4 slot
 *  times_ 01: The threshold is Pause time minus 28 slot times _PT  28 slot times_ 10:
 *  The threshold is Pause time minus 144 slot times _PT  144 slot times_ 11: The
 *  threshold is Pause time minus 256 slot times _PT  256 slot times_ The slot time is
 *  defined as the time taken to transmit 512 bits _64 bytes_ on the GMII or MII
 *  interface
 */
#define GMAC_PLT    0x00000003U
#define GMAC_PLT_M  (GMAC_PLT_V << GMAC_PLT_S)
#define GMAC_PLT_V  0x00000003U
#define GMAC_PLT_S  4
/** GMAC_DZPQ : R/W; bitpos: [7]; default: 0;
 *  Disable ZeroQuanta Pause When this bit is set, it disables the automatic generation
 *  of the ZeroQuanta Pause frames on the deassertion of the flowcontrol signal from
 *  the FIFO layer _MTL or external sideband flow control signal
 *  sbd_flowctrl_i/mti_flowctrl_i_ When this bit is reset, normal operation with
 *  automatic ZeroQuanta Pause frame generation is enabled
 */
#define GMAC_DZPQ    (BIT(7))
#define GMAC_DZPQ_M  (GMAC_DZPQ_V << GMAC_DZPQ_S)
#define GMAC_DZPQ_V  0x00000001U
#define GMAC_DZPQ_S  7
/** GMAC_PT : R/W; bitpos: [31:16]; default: 0;
 *  Pause Time This field holds the value to be used in the Pause Time field in the
 *  transmit control frame If the Pause Time bits is configured to be
 *  doublesynchronized to the _G_MII clock domain, then consecutive writes to this
 *  register should be performed only after at least four clock cycles in the
 *  destination clock domain
 */
#define GMAC_PT    0x0000FFFFU
#define GMAC_PT_M  (GMAC_PT_V << GMAC_PT_S)
#define GMAC_PT_V  0x0000FFFFU
#define GMAC_PT_S  16

/** GMAC_REGISTER7_VLANTAGREGISTER_REG register
 *  Identifies IEEE 8021Q VLAN type frames
 */
#define GMAC_REGISTER7_VLANTAGREGISTER_REG (DR_REG_GMAC_BASE + 0x1c)
/** GMAC_VL : R/W; bitpos: [15:0]; default: 0;
 *  VLAN Tag Identifier for Receive Frames This field contains the 8021Q VLAN tag to
 *  identify the VLAN frames and is compared to the 15th and 16th bytes of the frames
 *  being received for VLAN frames The following list describes the bits of this field:
 *  Bits [15:13]: User Priority Bit 12: Canonical Format Indicator _CFI_ or Drop
 *  Eligible Indicator _DEI_ Bits[11:0]: VLAN tag’s VLAN Identifier _VID_ field When
 *  the ETV bit is set, only the VID _Bits[11:0]_ is used for comparison If VL
 *  _VL[11:0] if ETV is set_ is all zeros, the MAC does not check the fifteenth and
 *  16th bytes for VLAN tag comparison, and declares all frames with a Type field value
 *  of 0x8100 or 0x88a8 as VLAN frames
 */
#define GMAC_VL    0x0000FFFFU
#define GMAC_VL_M  (GMAC_VL_V << GMAC_VL_S)
#define GMAC_VL_V  0x0000FFFFU
#define GMAC_VL_S  0
/** GMAC_ETV : R/W; bitpos: [16]; default: 0;
 *  Enable 12-Bit VLAN Tag Comparison
 */
#define GMAC_ETV    (BIT(16))
#define GMAC_ETV_M  (GMAC_ETV_V << GMAC_ETV_S)
#define GMAC_ETV_V  0x00000001U
#define GMAC_ETV_S  16
/** GMAC_VTIM : R/W; bitpos: [17]; default: 0;
 *  VLAN Tag Inverse Match Enable When set, this bit enables the VLAN Tag inverse
 *  matching The frames that do not have matching VLAN Tag are marked as matched When
 *  reset, this bit enables the VLAN Tag perfect matching The frames with matched VLAN
 *  Tag are marked as matched
 */
#define GMAC_VTIM    (BIT(17))
#define GMAC_VTIM_M  (GMAC_VTIM_V << GMAC_VTIM_S)
#define GMAC_VTIM_V  0x00000001U
#define GMAC_VTIM_S  17
/** GMAC_ESVL : R/W; bitpos: [18]; default: 0;
 *  Enable SVLAN When this bit is set, the MAC transmitter and receiver also consider
 *  the SVLAN _Type = 0x88A8_ frames as valid VLAN tagged frames
 */
#define GMAC_ESVL    (BIT(18))
#define GMAC_ESVL_M  (GMAC_ESVL_V << GMAC_ESVL_S)
#define GMAC_ESVL_V  0x00000001U
#define GMAC_ESVL_S  18
/** GMAC_VTHM : R/W; bitpos: [19]; default: 0;
 *  VLAN Tag Hash Table Match Enable When set, the most significant four bits of the
 *  VLAN tag’s CRC are used to index the content of Register 354 _VLAN Hash Table
 *  Register_ A value of 1 in the VLAN Hash Table register, corresponding to the index,
 *  indicates that the frame matched the VLAN hash table When Bit 16 _ETV_ is set, the
 *  CRC of the 12bit VLAN Identifier _VID_ is used for comparison whereas when ETV is
 *  reset, the CRC of the 16bit VLAN tag is used for comparison When reset, the VLAN
 *  Hash Match operation is not performed If the VLAN Hash feature is not enabled
 *  during core configuration, this bit is reserved _RO with default value_
 */
#define GMAC_VTHM    (BIT(19))
#define GMAC_VTHM_M  (GMAC_VTHM_V << GMAC_VTHM_S)
#define GMAC_VTHM_V  0x00000001U
#define GMAC_VTHM_S  19

/** GMAC_REGISTER8_VERSIONREGISTER_REG register
 *  Identifies the version of the Core
 */
#define GMAC_REGISTER8_VERSIONREGISTER_REG (DR_REG_GMAC_BASE + 0x20)
/** GMAC_SNPSVER : RO; bitpos: [7:0]; default: 55;
 *  Synopsysdefined Version _37_
 */
#define GMAC_SNPSVER    0x000000FFU
#define GMAC_SNPSVER_M  (GMAC_SNPSVER_V << GMAC_SNPSVER_S)
#define GMAC_SNPSVER_V  0x000000FFU
#define GMAC_SNPSVER_S  0
/** GMAC_USERVER : RO; bitpos: [15:8]; default: 0;
 *  Userdefined Version _configured with coreConsultant_
 */
#define GMAC_USERVER    0x000000FFU
#define GMAC_USERVER_M  (GMAC_USERVER_V << GMAC_USERVER_S)
#define GMAC_USERVER_V  0x000000FFU
#define GMAC_USERVER_S  8

