espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER9_DEBUGREGISTER_REG register
 *  Gives the status of various internal blocks for debugging
 */
#define GMAC_REGISTER9_DEBUGREGISTER_REG (DR_REG_GMAC_BASE + 0x24)
/** GMAC_RPESTS : RO; bitpos: [0]; default: 0;
 *  MAC GMII or MII Receive Protocol Engine Status When high, this bit indicates that
 *  the MAC GMII or MII receive protocol engine is actively receiving data and not in
 *  IDLE state
 */
#define GMAC_RPESTS    (BIT(0))
#define GMAC_RPESTS_M  (GMAC_RPESTS_V << GMAC_RPESTS_S)
#define GMAC_RPESTS_V  0x00000001U
#define GMAC_RPESTS_S  0
/** GMAC_RFCFCSTS : RO; bitpos: [2:1]; default: 0;
 *  MAC Receive Frame FIFO Controller Status When high, this field indicates the active
 *  state of the small FIFO Read and Write controllers of the MAC Receive Frame
 *  Controller Module RFCFCSTS[1] represents the status of small FIFO Read controller
 *  RFCFCSTS[0] represents the status of small FIFO Write controller
 */
#define GMAC_RFCFCSTS    0x00000003U
#define GMAC_RFCFCSTS_M  (GMAC_RFCFCSTS_V << GMAC_RFCFCSTS_S)
#define GMAC_RFCFCSTS_V  0x00000003U
#define GMAC_RFCFCSTS_S  1
/** GMAC_RWCSTS : RO; bitpos: [4]; default: 0;
 *  MTL Rx FIFO Write Controller Active Status When high, this bit indicates that the
 *  MTL Rx FIFO Write Controller is active and is transferring a received frame to the
 *  FIFO
 */
#define GMAC_RWCSTS    (BIT(4))
#define GMAC_RWCSTS_M  (GMAC_RWCSTS_V << GMAC_RWCSTS_S)
#define GMAC_RWCSTS_V  0x00000001U
#define GMAC_RWCSTS_S  4
/** GMAC_RRCSTS : RO; bitpos: [6:5]; default: 0;
 *  MTL RxFIFO Read Controller State This field gives the state of the Rx FIFO read
 *  Controller: 00: IDLE state 01: Reading frame data 10: Reading frame status _or
 *  timestamp_ 11: Flushing the frame data and status
 */
#define GMAC_RRCSTS    0x00000003U
#define GMAC_RRCSTS_M  (GMAC_RRCSTS_V << GMAC_RRCSTS_S)
#define GMAC_RRCSTS_V  0x00000003U
#define GMAC_RRCSTS_S  5
/** GMAC_RXFSTS : RO; bitpos: [9:8]; default: 0;
 *  MTL RxFIFO FillLevel Status This field gives the status of the filllevel of the Rx
 *  FIFO: 00: Rx FIFO Empty 01: Rx FIFO filllevel below flowcontrol deactivate
 *  threshold 10: Rx FIFO filllevel above flowcontrol activate threshold 11: Rx FIFO
 *  Full
 */
#define GMAC_RXFSTS    0x00000003U
#define GMAC_RXFSTS_M  (GMAC_RXFSTS_V << GMAC_RXFSTS_S)
#define GMAC_RXFSTS_V  0x00000003U
#define GMAC_RXFSTS_S  8
/** GMAC_TPESTS : RO; bitpos: [16]; default: 0;
 *  MAC GMII or MII Transmit Protocol Engine Status When high, this bit indicates that
 *  the MAC GMII or MII transmit protocol engine is actively transmitting data and is
 *  not in the IDLE state
 */
#define GMAC_TPESTS    (BIT(16))
#define GMAC_TPESTS_M  (GMAC_TPESTS_V << GMAC_TPESTS_S)
#define GMAC_TPESTS_V  0x00000001U
#define GMAC_TPESTS_S  16
/** GMAC_TFCSTS : RO; bitpos: [18:17]; default: 0;
 *  MAC Transmit Frame Controller Status This field indicates the state of the MAC
 *  Transmit Frame Controller module: 00: IDLE state 01: Waiting for status of previous
 *  frame or IFG or backoff period to be over 10: Generating and transmitting a Pause
 *  frame _in the fullduplex mode_ 11: Transferring input frame for transmission
 */
#define GMAC_TFCSTS    0x00000003U
#define GMAC_TFCSTS_M  (GMAC_TFCSTS_V << GMAC_TFCSTS_S)
#define GMAC_TFCSTS_V  0x00000003U
#define GMAC_TFCSTS_S  17
/** GMAC_TXPAUSED : RO; bitpos: [19]; default: 0;
 *  MAC Transmitter in Pause When high, this bit indicates that the MAC transmitter is
 *  in the Pause condition _in the fullduplexonly mode_ and hence does not schedule any
 *  frame for transmission
 */
#define GMAC_TXPAUSED    (BIT(19))
#define GMAC_TXPAUSED_M  (GMAC_TXPAUSED_V << GMAC_TXPAUSED_S)
#define GMAC_TXPAUSED_V  0x00000001U
#define GMAC_TXPAUSED_S  19
/** GMAC_TRCSTS : RO; bitpos: [21:20]; default: 0;
 *  MTL Tx FIFO Read Controller Status This field indicates the state of the Tx FIFO
 *  Read Controller: 00: IDLE state 01: READ state _transferring data to the MAC
 *  transmitter_ 10: Waiting for TxStatus from the MAC transmitter 11: Writing the
 *  received TxStatus or flushing the Tx FIFO
 */
#define GMAC_TRCSTS    0x00000003U
#define GMAC_TRCSTS_M  (GMAC_TRCSTS_V << GMAC_TRCSTS_S)
#define GMAC_TRCSTS_V  0x00000003U
#define GMAC_TRCSTS_S  20
/** GMAC_TWCSTS : RO; bitpos: [22]; default: 0;
 *  MTL Tx FIFO Write Controller Status When high, this bit indicates that the MTL Tx
 *  FIFO Write Controller is active and is transferring data to the Tx FIFO
 */
#define GMAC_TWCSTS    (BIT(22))
#define GMAC_TWCSTS_M  (GMAC_TWCSTS_V << GMAC_TWCSTS_S)
#define GMAC_TWCSTS_V  0x00000001U
#define GMAC_TWCSTS_S  22
/** GMAC_TXFSTS : RO; bitpos: [24]; default: 0;
 *  MTL Tx FIFO Not Empty Status When high, this bit indicates that the MTL Tx FIFO is
 *  not empty and some data is left for transmission
 */
#define GMAC_TXFSTS    (BIT(24))
#define GMAC_TXFSTS_M  (GMAC_TXFSTS_V << GMAC_TXFSTS_S)
#define GMAC_TXFSTS_V  0x00000001U
#define GMAC_TXFSTS_S  24
/** GMAC_TXSTSFSTS : RO; bitpos: [25]; default: 0;
 *  MTL TxStatus FIFO Full Status When high, this bit indicates that the MTL TxStatus
 *  FIFO is full Therefore, the MTL cannot accept any more frames for transmission This
 *  bit is reserved in the GMACAHB and GMACDMA configurations
 */
#define GMAC_TXSTSFSTS    (BIT(25))
#define GMAC_TXSTSFSTS_M  (GMAC_TXSTSFSTS_V << GMAC_TXSTSFSTS_S)
#define GMAC_TXSTSFSTS_V  0x00000001U
#define GMAC_TXSTSFSTS_S  25

/** GMAC_REGISTER10_REMOTEWAKEUPFRAMEFILTERREGISTER_REG register
 *  Remote Wake-Up Frame Filter Register
 */
#define GMAC_REGISTER10_REMOTEWAKEUPFRAMEFILTERREGISTER_REG (DR_REG_GMAC_BASE + 0x28)
/** GMAC_WKUPFRM_FILTER : R/W; bitpos: [31:0]; default: 0;
 *  This is the address through which the application writes or reads the remote
 *  wake-up frame filter registers.The reg_wkupfrm_filter register is a pointer to
 *  eight reg_wkupfrm_filter registers.The reg_wkupfrm_filter register is loaded by
 *  sequentially loading the eight register values.Eight sequential writes to this
 *  address(0x0028)write all reg_wkupfrm_filter registers.Similarly, eight sequential
 *  reads from this address(0x0028) read all reg_wkupfrm_filter registers.
 *  This register is present only when you select the PMT module Remote Wake-Up feature
 *  in coreConsultant.
 */
#define GMAC_WKUPFRM_FILTER    0xFFFFFFFFU
#define GMAC_WKUPFRM_FILTER_M  (GMAC_WKUPFRM_FILTER_V << GMAC_WKUPFRM_FILTER_S)
#define GMAC_WKUPFRM_FILTER_V  0xFFFFFFFFU
#define GMAC_WKUPFRM_FILTER_S  0

