espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER11_PMTCONTROLANDSTATUSREGISTER_REG register
 *  PMT Control and Status Register. This register is present only when you select the
 *  PMT module in coreConsultant.
 */
#define GMAC_REGISTER11_PMTCONTROLANDSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x2c)
/** GMAC_PWRDWN : R/W1S; bitpos: [0]; default: 0;
 *  Power Down
 *  When set, the MAC receiver drops all received frames until it receives the expected
 *  magic packet or remote wake-up frame. This bit is then self-cleared and the
 *  power-down mode is disabled. The Software can also clear this bit before the
 *  expected magic packet or remote wake-up frame is received. The frames, received by
 *  MAC after this bit is cleared, are forwarded to the application. This bit must only
 *  be set when the Magic Packet Enable, Global Unicast, or Remote Wake-Up Frame Enable
 *  bit is set high.
 */
#define GMAC_PWRDWN    (BIT(0))
#define GMAC_PWRDWN_M  (GMAC_PWRDWN_V << GMAC_PWRDWN_S)
#define GMAC_PWRDWN_V  0x00000001U
#define GMAC_PWRDWN_S  0
/** GMAC_MGKPKTEN : R/W; bitpos: [1]; default: 0;
 *  Magic Packet Enable
 *  When set, enables generation of a power management event because of magic packet
 *  reception.
 */
#define GMAC_MGKPKTEN    (BIT(1))
#define GMAC_MGKPKTEN_M  (GMAC_MGKPKTEN_V << GMAC_MGKPKTEN_S)
#define GMAC_MGKPKTEN_V  0x00000001U
#define GMAC_MGKPKTEN_S  1
/** GMAC_RWKPKTEN : R/W; bitpos: [2]; default: 0;
 *  Remote Wake-Up Frame Enable
 *  When set, enables generation of a power management event because of remote wake-up
 *  frame reception.
 */
#define GMAC_RWKPKTEN    (BIT(2))
#define GMAC_RWKPKTEN_M  (GMAC_RWKPKTEN_V << GMAC_RWKPKTEN_S)
#define GMAC_RWKPKTEN_V  0x00000001U
#define GMAC_RWKPKTEN_S  2
/** GMAC_MGKPRCVD : R/W; bitpos: [5]; default: 0;
 *  Magic Packet Received
 *  When set,this bit indicates that the power management event is generated because of
 *  the reception of a magic packet. This bit is cleared by Read into this register.
 */
#define GMAC_MGKPRCVD    (BIT(5))
#define GMAC_MGKPRCVD_M  (GMAC_MGKPRCVD_V << GMAC_MGKPRCVD_S)
#define GMAC_MGKPRCVD_V  0x00000001U
#define GMAC_MGKPRCVD_S  5
/** GMAC_RWKPRCVD : R/W; bitpos: [6]; default: 0;
 *  Remote Wake-Up Frame Received
 *  When set, this bit indicates the power management event is generated because of the
 *  reception of a remote wake-up frame. This bit is cleared by a Read into this
 *  register.
 */
#define GMAC_RWKPRCVD    (BIT(6))
#define GMAC_RWKPRCVD_M  (GMAC_RWKPRCVD_V << GMAC_RWKPRCVD_S)
#define GMAC_RWKPRCVD_V  0x00000001U
#define GMAC_RWKPRCVD_S  6
/** GMAC_GLBLUCAST : R/W; bitpos: [9]; default: 0;
 *  Global Unicast.
 *  When set, enables any unicast packet filtered by the MAX(DAF) address recognition
 *  to be a remote wake-up frame.
 */
#define GMAC_GLBLUCAST    (BIT(9))
#define GMAC_GLBLUCAST_M  (GMAC_GLBLUCAST_V << GMAC_GLBLUCAST_S)
#define GMAC_GLBLUCAST_V  0x00000001U
#define GMAC_GLBLUCAST_S  9
/** GMAC_RWKPTR : RO; bitpos: [28:24]; default: 0;
 *  Remote Wake-up FIFO Pointer.
 *  This field gives the current value(0 to 31) of the Remote Wake-up Frame filter
 *  register pointer. When the value of this pointer is erual to 7, 15, 23 or 31, the
 *  contents of the Remote Wake-up Frame Filter Register are transferred to the
 *  clk_rx_i domain when a write occurs to that register.
 *  The maximum value of the pointer is 7, 15, 23 and 31 respectively depending on the
 *  number of Remote Wakeup Filters selected during configuration.
 */
#define GMAC_RWKPTR    0x0000001FU
#define GMAC_RWKPTR_M  (GMAC_RWKPTR_V << GMAC_RWKPTR_S)
#define GMAC_RWKPTR_V  0x0000001FU
#define GMAC_RWKPTR_S  24
/** GMAC_RWKFILTRST : R/W1S; bitpos: [31]; default: 0;
 *  Remote Wake-Up Frame Filter Register Pointer Reset.
 *  When this bit is set, it resets the remote wake-up frame filter register pointer to
 *  3'b000. It is automatically cleared after 1 clock cycle.
 */
#define GMAC_RWKFILTRST    (BIT(31))
#define GMAC_RWKFILTRST_M  (GMAC_RWKFILTRST_V << GMAC_RWKFILTRST_S)
#define GMAC_RWKFILTRST_V  0x00000001U
#define GMAC_RWKFILTRST_S  31

/** GMAC_REGISTER12_LPICONTROLANDSTATUSREGISTER_REG register
 *  Controls the Low Power Idle _LPI_ operations and provides the LPI status of the
 *  core This register is present only when you select the Energy Efficient Ethernet
 *  feature in coreConsultant
 */
#define GMAC_REGISTER12_LPICONTROLANDSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x30)
/** GMAC_TLPIEN : R/W; bitpos: [0]; default: 0;
 *  Transmit LPI Entry When set, this bit indicates that the MAC Transmitter has
 *  entered the LPI state because of the setting of the LPIEN bit This bit is cleared
 *  by a read into this register
 */
#define GMAC_TLPIEN    (BIT(0))
#define GMAC_TLPIEN_M  (GMAC_TLPIEN_V << GMAC_TLPIEN_S)
#define GMAC_TLPIEN_V  0x00000001U
#define GMAC_TLPIEN_S  0
/** GMAC_TLPIEX : R/W; bitpos: [1]; default: 0;
 *  Transmit LPI Exit When set, this bit indicates that the MAC transmitter has exited
 *  the LPI state after the user has cleared the LPIEN bit and the LPI TW Timer has
 *  expired This bit is cleared by a read into this register
 */
#define GMAC_TLPIEX    (BIT(1))
#define GMAC_TLPIEX_M  (GMAC_TLPIEX_V << GMAC_TLPIEX_S)
#define GMAC_TLPIEX_V  0x00000001U
#define GMAC_TLPIEX_S  1
/** GMAC_RLPIEN : R/W; bitpos: [2]; default: 0;
 *  Receive LPI Entry When set, this bit indicates that the MAC Receiver has received
 *  an LPI pattern and entered the LPI state This bit is cleared by a read into this
 *  register Note: This bit may not get set if the MAC stops receiving the LPI pattern
 *  for a very short duration, such as, less than 3 clock cycles of CSR clock
 */
#define GMAC_RLPIEN    (BIT(2))
#define GMAC_RLPIEN_M  (GMAC_RLPIEN_V << GMAC_RLPIEN_S)
#define GMAC_RLPIEN_V  0x00000001U
#define GMAC_RLPIEN_S  2
/** GMAC_RLPIEX : R/W; bitpos: [3]; default: 0;
 *  Receive LPI Exit When set, this bit indicates that the MAC Receiver has stopped
 *  receiving the LPI pattern on the GMII or MII interface, exited the LPI state, and
 *  resumed the normal reception This bit is cleared by a read into this register Note:
 *  This bit may not get set if the MAC stops receiving the LPI pattern for a very
 *  short duration, such as, less than 3 clock cycles of CSR clock
 */
#define GMAC_RLPIEX    (BIT(3))
#define GMAC_RLPIEX_M  (GMAC_RLPIEX_V << GMAC_RLPIEX_S)
#define GMAC_RLPIEX_V  0x00000001U
#define GMAC_RLPIEX_S  3
/** GMAC_TLPIST : RO; bitpos: [8]; default: 0;
 *  Transmit LPI State When set, this bit indicates that the MAC is transmitting the
 *  LPI pattern on the GMII or MII interface
 */
#define GMAC_TLPIST    (BIT(8))
#define GMAC_TLPIST_M  (GMAC_TLPIST_V << GMAC_TLPIST_S)
#define GMAC_TLPIST_V  0x00000001U
#define GMAC_TLPIST_S  8
/** GMAC_RLPIST : RO; bitpos: [9]; default: 0;
 *  Receive LPI State When set, this bit indicates that the MAC is receiving the LPI
 *  pattern on the GMII or MII interface
 */
#define GMAC_RLPIST    (BIT(9))
#define GMAC_RLPIST_M  (GMAC_RLPIST_V << GMAC_RLPIST_S)
#define GMAC_RLPIST_V  0x00000001U
#define GMAC_RLPIST_S  9
/** GMAC_LPIEN : R/W; bitpos: [16]; default: 0;
 *  LPI Enable When set, this bit instructs the MAC Transmitter to enter the LPI state
 *  When reset, this bit instructs the MAC to exit the LPI state and resume normal
 *  transmission This bit is cleared when the LPITXA bit is set and the MAC exits the
 *  LPI state because of the arrival of a new packet for transmission
 */
#define GMAC_LPIEN    (BIT(16))
#define GMAC_LPIEN_M  (GMAC_LPIEN_V << GMAC_LPIEN_S)
#define GMAC_LPIEN_V  0x00000001U
#define GMAC_LPIEN_S  16
/** GMAC_PLS : R/W; bitpos: [17]; default: 0;
 *  PHY Link Status This bit indicates the link status of the PHY The MAC Transmitter
 *  asserts the LPI pattern only when the link status is up _okay_ at least for the
 *  time indicated by the LPI LS TIMER When set, the link is considered to be okay _up_
 *  and when reset, the link is considered to be down
 */
#define GMAC_PLS    (BIT(17))
#define GMAC_PLS_M  (GMAC_PLS_V << GMAC_PLS_S)
#define GMAC_PLS_V  0x00000001U
#define GMAC_PLS_S  17
/** GMAC_PLSEN : R/W; bitpos: [18]; default: 0;
 *  PHY Link Status Enable This bit enables the link status received on the RGMII,
 *  SGMII, or SMII receive paths to be used for activating the LPI LS TIMER When set,
 *  the MAC uses the linkstatus bits of Register 54 _SGMII/RGMII/SMII Control and
 *  Status Register_ and Bit 17 _PLS_ for the LPI LS Timer trigger When cleared, the
 *  MAC ignores the linkstatus bits of Register 54 and takes only the PLS bit This bit
 *  is RO and reserved if you have not selected the RGMII, SGMII, or SMII PHY interface
 */
#define GMAC_PLSEN    (BIT(18))
#define GMAC_PLSEN_M  (GMAC_PLSEN_V << GMAC_PLSEN_S)
#define GMAC_PLSEN_V  0x00000001U
#define GMAC_PLSEN_S  18
/** GMAC_LPITXA : R/W; bitpos: [19]; default: 0;
 *  LPI TX Automate This bit controls the behavior of the MAC when it is entering or
 *  coming out of the LPI mode on the transmit side This bit is not functional in the
 *  GMAC CORE configuration in which the Tx clock gating is done during the LPI mode If
 *  the LPITXA and LPIEN bits are set to 1, the MAC enters the LPI mode only after all
 *  outstanding frames _in the core_ and pending frames _in the application interface_
 *  have been transmitted The MAC comes out of the LPI mode when the application sends
 *  any frame for transmission or the application issues a TX FIFO Flush command In
 *  addition, the MAC automatically clears the LPIEN bit when it exits the LPI state If
 *  TX FIFO Flush is set in Bit 20 of Register 6 _Operation Mode Register_, when the
 *  MAC is in the LPI mode, the MAC exits the LPI mode When this bit is 0, the LPIEN
 *  bit directly controls behavior of the MAC when it is entering or coming out of the
 *  LPI mode
 */
#define GMAC_LPITXA    (BIT(19))
#define GMAC_LPITXA_M  (GMAC_LPITXA_V << GMAC_LPITXA_S)
#define GMAC_LPITXA_V  0x00000001U
#define GMAC_LPITXA_S  19

/** GMAC_REGISTER13_LPITIMERSCONTROLREGISTER_REG register
 *  Controls the timeout values in LPI states This register is present only when you
 *  select the Energy Efficient Ethernet feature in coreConsultant
 */
#define GMAC_REGISTER13_LPITIMERSCONTROLREGISTER_REG (DR_REG_GMAC_BASE + 0x34)
/** GMAC_TWT : R/W; bitpos: [15:0]; default: 0;
 *  LPI TW TIMER This field specifies the minimum time _in microseconds_ for which the
 *  MAC waits after it stops transmitting the LPI pattern to the PHY and before it
 *  resumes the normal transmission The TLPIEX status bit is set after the expiry of
 *  this timer
 */
#define GMAC_TWT    0x0000FFFFU
#define GMAC_TWT_M  (GMAC_TWT_V << GMAC_TWT_S)
#define GMAC_TWT_V  0x0000FFFFU
#define GMAC_TWT_S  0
/** GMAC_LST : R/W; bitpos: [25:16]; default: 1000;
 *  LPI LS TIMER This field specifies the minimum time _in milliseconds_ for which the
 *  link status from the PHY should be up _OKAY_ before the LPI pattern can be
 *  transmitted to the PHY The MAC does not transmit the LPI pattern even when the
 *  LPIEN bit is set unless the LPI LS Timer reaches the programmed terminal count The
 *  default value of the LPI LS Timer is 1000 _1 sec_ as defined in the IEEE standard
 */
#define GMAC_LST    0x000003FFU
#define GMAC_LST_M  (GMAC_LST_V << GMAC_LST_S)
#define GMAC_LST_V  0x000003FFU
#define GMAC_LST_S  16

