espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER14_INTERRUPTSTATUSREGISTER_REG register
 *  Contains the interrupt status
 */
#define GMAC_REGISTER14_INTERRUPTSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x38)
/** GMAC_RGSMIIIS : RO; bitpos: [0]; default: 0;
 *  RGMII or SMII Interrupt Status This bit is set because of any change in value of
 *  the Link Status of RGMII or SMII interface _Bit 3 in Register 54 _SGMII/RGMII/SMII
 *  Control and Status Register__ This bit is cleared when you perform a read operation
 *  on the SGMII/RGMII/SMII Control and Status Register This bit is valid only when you
 *  select the optional RGMII or SMII PHY interface during core configuration and
 *  operation
 */
#define GMAC_RGSMIIIS    (BIT(0))
#define GMAC_RGSMIIIS_M  (GMAC_RGSMIIIS_V << GMAC_RGSMIIIS_S)
#define GMAC_RGSMIIIS_V  0x00000001U
#define GMAC_RGSMIIIS_S  0
/** GMAC_PCSLCHGIS : RO; bitpos: [1]; default: 0;
 *  PCS Link Status Changed This bit is set because of any change in Link Status in the
 *  TBI, RTBI, or SGMII PHY interface _Bit 2 in Register 49 _AN Status Register__ This
 *  bit is cleared when you perform a read operation on the AN Status register This bit
 *  is valid only when you select the optional TBI, RTBI, or SGMII PHY interface during
 *  core configuration and operation
 */
#define GMAC_PCSLCHGIS    (BIT(1))
#define GMAC_PCSLCHGIS_M  (GMAC_PCSLCHGIS_V << GMAC_PCSLCHGIS_S)
#define GMAC_PCSLCHGIS_V  0x00000001U
#define GMAC_PCSLCHGIS_S  1
/** GMAC_PCSANCIS : RO; bitpos: [2]; default: 0;
 *  PCS AutoNegotiation Complete This bit is set when the Autonegotiation is completed
 *  in the TBI, RTBI, or SGMII PHY interface _Bit 5 in Register 49 _AN Status
 *  Register__ This bit is cleared when you perform a read operation to the AN Status
 *  register This bit is valid only when you select the optional TBI, RTBI, or SGMII
 *  PHY interface during core configuration and operation
 */
#define GMAC_PCSANCIS    (BIT(2))
#define GMAC_PCSANCIS_M  (GMAC_PCSANCIS_V << GMAC_PCSANCIS_S)
#define GMAC_PCSANCIS_V  0x00000001U
#define GMAC_PCSANCIS_S  2
/** GMAC_PMTIS : RO; bitpos: [3]; default: 0;
 *  PMT Interrupt Status This bit is set when a magic packet or remote wakeup frame is
 *  received in the powerdown mode _see Bits 5 and 6 in the PMT Control and Status
 *  Register_ This bit is cleared when both Bits[6:5] are cleared because of a read
 *  operation to the PMT Control and Status register This bit is valid only when you
 *  select the optional PMT module during core configuration
 */
#define GMAC_PMTIS    (BIT(3))
#define GMAC_PMTIS_M  (GMAC_PMTIS_V << GMAC_PMTIS_S)
#define GMAC_PMTIS_V  0x00000001U
#define GMAC_PMTIS_S  3
/** GMAC_MMCIS : RO; bitpos: [4]; default: 0;
 *  MMC Interrupt Status This bit is set high when any of the Bits [7:5] is set high
 *  and cleared only when all of these bits are low This bit is valid only when you
 *  select the optional MMC module during core configuration
 */
#define GMAC_MMCIS    (BIT(4))
#define GMAC_MMCIS_M  (GMAC_MMCIS_V << GMAC_MMCIS_S)
#define GMAC_MMCIS_V  0x00000001U
#define GMAC_MMCIS_S  4
/** GMAC_MMCRXIS : RO; bitpos: [5]; default: 0;
 *  MMC Receive Interrupt Status This bit is set high when an interrupt is generated in
 *  the MMC Receive Interrupt Register This bit is cleared when all the bits in this
 *  interrupt register are cleared This bit is valid only when you select the optional
 *  MMC module during core configuration
 */
#define GMAC_MMCRXIS    (BIT(5))
#define GMAC_MMCRXIS_M  (GMAC_MMCRXIS_V << GMAC_MMCRXIS_S)
#define GMAC_MMCRXIS_V  0x00000001U
#define GMAC_MMCRXIS_S  5
/** GMAC_MMCTXIS : RO; bitpos: [6]; default: 0;
 *  MMC Transmit Interrupt Status This bit is set high when an interrupt is generated
 *  in the MMC Transmit Interrupt Register This bit is cleared when all the bits in
 *  this interrupt register are cleared This bit is valid only when you select the
 *  optional MMC module during core configuration
 */
#define GMAC_MMCTXIS    (BIT(6))
#define GMAC_MMCTXIS_M  (GMAC_MMCTXIS_V << GMAC_MMCTXIS_S)
#define GMAC_MMCTXIS_V  0x00000001U
#define GMAC_MMCTXIS_S  6
/** GMAC_MMCRXIPIS : RO; bitpos: [7]; default: 0;
 *  MMC Receive Checksum Offload Interrupt Status This bit is set high when an
 *  interrupt is generated in the MMC Receive Checksum Offload Interrupt Register This
 *  bit is cleared when all the bits in this interrupt register are cleared This bit is
 *  valid only when you select the optional MMC module and Checksum Offload Engine
 *  _Type 2_ during core configuration
 */
#define GMAC_MMCRXIPIS    (BIT(7))
#define GMAC_MMCRXIPIS_M  (GMAC_MMCRXIPIS_V << GMAC_MMCRXIPIS_S)
#define GMAC_MMCRXIPIS_V  0x00000001U
#define GMAC_MMCRXIPIS_S  7
/** GMAC_TSIS : RO; bitpos: [9]; default: 0;
 *  Timestamp Interrupt Status When the Advanced Timestamp feature is enabled, this bit
 *  is set when R_SS_RC any of the following conditions is true: The system time value
 *  equals or exceeds the value specified in the Target Time High and Low registers
 *  There is an overflow in the seconds register The Auxiliary snapshot trigger is
 *  asserted This bit is cleared on reading Bit 0 of Register 458 _Timestamp Status
 *  Register_ If default Timestamping is enabled, when set, this bit indicates that the
 *  system time value is equal to or exceeds the value specified in the Target Time
 *  registers In this mode, this bit is cleared after the completion of the read of
 *  this bit In all other modes, this bit is reserved
 */
#define GMAC_TSIS    (BIT(9))
#define GMAC_TSIS_M  (GMAC_TSIS_V << GMAC_TSIS_S)
#define GMAC_TSIS_V  0x00000001U
#define GMAC_TSIS_S  9
/** GMAC_LPIIS : RO; bitpos: [10]; default: 0;
 *  LPI Interrupt Status When the Energy Efficient Ethernet feature is enabled, this
 *  bit is set for any LPI state entry or exit in the MAC Transmitter or Receiver This
 *  bit is cleared on reading Bit 0 of Register 12 _LPI Control and Status Register_ In
 *  all other modes, this bit is reserved
 */
#define GMAC_LPIIS    (BIT(10))
#define GMAC_LPIIS_M  (GMAC_LPIIS_V << GMAC_LPIIS_S)
#define GMAC_LPIIS_V  0x00000001U
#define GMAC_LPIIS_S  10
/** GMAC_GPIIS : RO; bitpos: [11]; default: 0;
 *  GPI Interrupt Status When the GPIO feature is enabled, this bit is set when any
 *  active event _LL or LH_ occurs on the GPIS field _Bits [3:0]_ of Register 56
 *  _General Purpose IO Register_ and the corresponding GPIE bit is enabled This bit is
 *  cleared on reading lane 0 _GPIS_ of Register 56 _General Purpose IO Register_ When
 *  the GPIO feature is not enabled, this bit is reserved
 */
#define GMAC_GPIIS    (BIT(11))
#define GMAC_GPIIS_M  (GMAC_GPIIS_V << GMAC_GPIIS_S)
#define GMAC_GPIIS_V  0x00000001U
#define GMAC_GPIIS_S  11

/** GMAC_REGISTER15_INTERRUPTMASKREGISTER_REG register
 *  Contains the masks for generating the interrupts
 */
#define GMAC_REGISTER15_INTERRUPTMASKREGISTER_REG (DR_REG_GMAC_BASE + 0x3c)
/** GMAC_RGSMIIIM : R/W; bitpos: [0]; default: 0;
 *  RGMII or SMII Interrupt Mask When set, this bit disables the assertion of the
 *  interrupt signal because of the setting of the RGMII or SMII Interrupt Status bit
 *  in Register 14 _Interrupt Status Register_
 */
#define GMAC_RGSMIIIM    (BIT(0))
#define GMAC_RGSMIIIM_M  (GMAC_RGSMIIIM_V << GMAC_RGSMIIIM_S)
#define GMAC_RGSMIIIM_V  0x00000001U
#define GMAC_RGSMIIIM_S  0
/** GMAC_PCSLCHGIM : R/W; bitpos: [1]; default: 0;
 *  PCS Link Status Interrupt Mask When set, this bit disables the assertion of the
 *  interrupt signal because of the setting of the PCS Linkstatus changed bit in
 *  Register 14 _Interrupt Status Register_
 */
#define GMAC_PCSLCHGIM    (BIT(1))
#define GMAC_PCSLCHGIM_M  (GMAC_PCSLCHGIM_V << GMAC_PCSLCHGIM_S)
#define GMAC_PCSLCHGIM_V  0x00000001U
#define GMAC_PCSLCHGIM_S  1
/** GMAC_PCSANCIM : R/W; bitpos: [2]; default: 0;
 *  PCS AN Completion Interrupt Mask When set, this bit disables the assertion of the
 *  interrupt signal because of the setting of PCS Autonegotiation complete bit in
 *  Register 14 _Interrupt Status Register_
 */
#define GMAC_PCSANCIM    (BIT(2))
#define GMAC_PCSANCIM_M  (GMAC_PCSANCIM_V << GMAC_PCSANCIM_S)
#define GMAC_PCSANCIM_V  0x00000001U
#define GMAC_PCSANCIM_S  2
/** GMAC_PMTIM : R/W; bitpos: [3]; default: 0;
 *  PMT Interrupt Mask When set, this bit disables the assertion of the interrupt
 *  signal because of the setting of PMT Interrupt Status bit in Register 14 _Interrupt
 *  Status Register_
 */
#define GMAC_PMTIM    (BIT(3))
#define GMAC_PMTIM_M  (GMAC_PMTIM_V << GMAC_PMTIM_S)
#define GMAC_PMTIM_V  0x00000001U
#define GMAC_PMTIM_S  3
/** GMAC_TSIM : R/W; bitpos: [9]; default: 0;
 *  Timestamp Interrupt Mask When set, this bit disables the assertion of the interrupt
 *  signal because of the setting of Timestamp Interrupt Status bit in Register 14
 *  _Interrupt Status Register_ This bit is valid only when IEEE1588 timestamping is
 *  enabled In all other modes, this bit is reserved
 */
#define GMAC_TSIM    (BIT(9))
#define GMAC_TSIM_M  (GMAC_TSIM_V << GMAC_TSIM_S)
#define GMAC_TSIM_V  0x00000001U
#define GMAC_TSIM_S  9
/** GMAC_LPIIM : R/W; bitpos: [10]; default: 0;
 *  LPI Interrupt Mask When set, this bit disables the assertion of the interrupt
 *  signal because of the setting of the LPI Interrupt Status bit in Register 14
 *  _Interrupt Status Register_ This bit is valid only when you select the Energy
 *  Efficient Ethernet feature during core configuration In all other modes, this bit
 *  is reserved
 */
#define GMAC_LPIIM    (BIT(10))
#define GMAC_LPIIM_M  (GMAC_LPIIM_V << GMAC_LPIIM_S)
#define GMAC_LPIIM_V  0x00000001U
#define GMAC_LPIIM_S  10

