espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER16_MACADDRESS0HIGHREGISTER_REG register
 *  Contains the higher 16 bits of the first MAC address
 */
#define GMAC_REGISTER16_MACADDRESS0HIGHREGISTER_REG (DR_REG_GMAC_BASE + 0x40)
/** GMAC_ADDRHI_0 : R/W; bitpos: [15:0]; default: 65535;
 *  MAC Address0 [47:32] This field contains the upper 16 bits _47:32_ of the first
 *  6byte MAC address The MAC uses this field for filtering the received frames and
 *  inserting the MAC address in the Transmit Flow Control _Pause_ Frames
 */
#define GMAC_ADDRHI_0    0x0000FFFFU
#define GMAC_ADDRHI_0_M  (GMAC_ADDRHI_0_V << GMAC_ADDRHI_0_S)
#define GMAC_ADDRHI_0_V  0x0000FFFFU
#define GMAC_ADDRHI_0_S  0
/** GMAC_AE_0 : RO; bitpos: [31]; default: 1;
 *  Address Enable This bit is always set to 1
 */
#define GMAC_AE_0    (BIT(31))
#define GMAC_AE_0_M  (GMAC_AE_0_V << GMAC_AE_0_S)
#define GMAC_AE_0_V  0x00000001U
#define GMAC_AE_0_S  31

/** GMAC_REGISTER17_MACADDRESS0LOWREGISTER_REG register
 *  Contains the lower 32 bits of the first MAC address
 */
#define GMAC_REGISTER17_MACADDRESS0LOWREGISTER_REG (DR_REG_GMAC_BASE + 0x44)
/** GMAC_ADDRLO_0 : R/W; bitpos: [31:0]; default: 4294967295;
 *  MAC Address0 [31:0] This field contains the lower 32 bits of the first 6byte MAC
 *  address This is used by the MAC for filtering the received frames and inserting the
 *  MAC address in the Transmit Flow Control _Pause_ Frames
 */
#define GMAC_ADDRLO_0    0xFFFFFFFFU
#define GMAC_ADDRLO_0_M  (GMAC_ADDRLO_0_V << GMAC_ADDRLO_0_S)
#define GMAC_ADDRLO_0_V  0xFFFFFFFFU
#define GMAC_ADDRLO_0_S  0

/** GMAC_REGISTER18_MACADDRESS1HIGHREGISTER_REG register
 *  Contains the higher 16 bits of the second MAC address This register is present only
 *  when Enable MAC Address1 is selected in coreConsultant _See Table 78_
 */
#define GMAC_REGISTER18_MACADDRESS1HIGHREGISTER_REG (DR_REG_GMAC_BASE + 0x48)
/** GMAC_ADDRHI_1 : R/W; bitpos: [15:0]; default: 65535;
 *  MAC Address1 [47:32] This field contains the upper 16 bits _47:32_ of the second
 *  6byte MAC address
 */
#define GMAC_ADDRHI_1    0x0000FFFFU
#define GMAC_ADDRHI_1_M  (GMAC_ADDRHI_1_V << GMAC_ADDRHI_1_S)
#define GMAC_ADDRHI_1_V  0x0000FFFFU
#define GMAC_ADDRHI_1_S  0
/** GMAC_MBC_1 : R/W; bitpos: [29:24]; default: 0;
 *  Mask Byte Control These bits are mask control bits for comparison of each of the
 *  MAC Address bytes When set high, the MAC does not compare the corresponding byte of
 *  received DA or SA with the contents of MAC Address1 registers Each bit controls the
 *  masking of the bytes as follows: Bit 29: Register 18[15:8] Bit 28: Register 18[7:0]
 *  Bit 27: Register 19[31:24]  Bit 24: Register 19[7:0] You can filter a group of
 *  addresses _known as group address filtering_ by masking one or more bytes of the
 *  address
 */
#define GMAC_MBC_1    0x0000003FU
#define GMAC_MBC_1_M  (GMAC_MBC_1_V << GMAC_MBC_1_S)
#define GMAC_MBC_1_V  0x0000003FU
#define GMAC_MBC_1_S  24
/** GMAC_SA_1 : R/W; bitpos: [30]; default: 0;
 *  Source Address When this bit is set, the MAC Address1[47:0] is used to compare with
 *  the SA fields of the received frame When this bit is reset, the MAC Address1[47:0]
 *  is used to compare with the DA fields of the received frame
 */
#define GMAC_SA_1    (BIT(30))
#define GMAC_SA_1_M  (GMAC_SA_1_V << GMAC_SA_1_S)
#define GMAC_SA_1_V  0x00000001U
#define GMAC_SA_1_S  30
/** GMAC_AE_1 : R/W; bitpos: [31]; default: 0;
 *  Address Enable
 */
#define GMAC_AE_1    (BIT(31))
#define GMAC_AE_1_M  (GMAC_AE_1_V << GMAC_AE_1_S)
#define GMAC_AE_1_V  0x00000001U
#define GMAC_AE_1_S  31

/** GMAC_REGISTER19_MACADDRESS1LOWREGISTER_REG register
 *  Contains the lower 32 bits of the second MAC address This register is present only
 *  when Enable MAC Address1 is selected in coreConsultant _See Table 78_
 */
#define GMAC_REGISTER19_MACADDRESS1LOWREGISTER_REG (DR_REG_GMAC_BASE + 0x4c)
/** GMAC_ADDRLO_1 : R/W; bitpos: [31:0]; default: 4294967295;
 *  MAC Address1 [31:0] This field contains the lower 32 bits of the second 6byte MAC
 *  address The content of this field is undefined until loaded by the Application
 *  after the initialization process
 */
#define GMAC_ADDRLO_1    0xFFFFFFFFU
#define GMAC_ADDRLO_1_M  (GMAC_ADDRLO_1_V << GMAC_ADDRLO_1_S)
#define GMAC_ADDRLO_1_V  0xFFFFFFFFU
#define GMAC_ADDRLO_1_S  0

/** GMAC_MACADDRESS2HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHETHIRDMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS2HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHETHIRDMACADDRESS_REG (DR_REG_GMAC_BASE + 0x50)
/** GMAC_ADDRHI_2 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRHI_2    0x0000FFFFU
#define GMAC_ADDRHI_2_M  (GMAC_ADDRHI_2_V << GMAC_ADDRHI_2_S)
#define GMAC_ADDRHI_2_V  0x0000FFFFU
#define GMAC_ADDRHI_2_S  0
/** GMAC_MBC_2 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_MBC_2    0x0000003FU
#define GMAC_MBC_2_M  (GMAC_MBC_2_V << GMAC_MBC_2_S)
#define GMAC_MBC_2_V  0x0000003FU
#define GMAC_MBC_2_S  24
/** GMAC_SA_2 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_SA_2    (BIT(30))
#define GMAC_SA_2_M  (GMAC_SA_2_V << GMAC_SA_2_S)
#define GMAC_SA_2_V  0x00000001U
#define GMAC_SA_2_S  30
/** GMAC_AE_2 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_AE_2    (BIT(31))
#define GMAC_AE_2_M  (GMAC_AE_2_V << GMAC_AE_2_S)
#define GMAC_AE_2_V  0x00000001U
#define GMAC_AE_2_S  31

/** GMAC_MACADDRESS2LOWREGISTERCONTAINSTHELOWER32BITSOFTHETHIRDMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS2LOWREGISTERCONTAINSTHELOWER32BITSOFTHETHIRDMACADDRESS_REG (DR_REG_GMAC_BASE + 0x54)
/** GMAC_ADDRLO_2 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address2 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRLO_2    0xFFFFFFFFU
#define GMAC_ADDRLO_2_M  (GMAC_ADDRLO_2_V << GMAC_ADDRLO_2_S)
#define GMAC_ADDRLO_2_V  0xFFFFFFFFU
#define GMAC_ADDRLO_2_S  0

/** GMAC_MACADDRESS3HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEFOURTHMACADDRESS_REG
 *  register
 *  Reserved
 */
#define GMAC_MACADDRESS3HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEFOURTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x58)
/** GMAC_ADDRHI_3 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRHI_3    0x0000FFFFU
#define GMAC_ADDRHI_3_M  (GMAC_ADDRHI_3_V << GMAC_ADDRHI_3_S)
#define GMAC_ADDRHI_3_V  0x0000FFFFU
#define GMAC_ADDRHI_3_S  0
/** GMAC_MBC_3 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_MBC_3    0x0000003FU
#define GMAC_MBC_3_M  (GMAC_MBC_3_V << GMAC_MBC_3_S)
#define GMAC_MBC_3_V  0x0000003FU
#define GMAC_MBC_3_S  24
/** GMAC_SA_3 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_SA_3    (BIT(30))
#define GMAC_SA_3_M  (GMAC_SA_3_V << GMAC_SA_3_S)
#define GMAC_SA_3_V  0x00000001U
#define GMAC_SA_3_S  30
/** GMAC_AE_3 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_AE_3    (BIT(31))
#define GMAC_AE_3_M  (GMAC_AE_3_V << GMAC_AE_3_S)
#define GMAC_AE_3_V  0x00000001U
#define GMAC_AE_3_S  31

/** GMAC_MACADDRESS3LOWREGISTERCONTAINSTHELOWER32BITSOFTHEFOURTHMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS3LOWREGISTERCONTAINSTHELOWER32BITSOFTHEFOURTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x5c)
/** GMAC_ADDRLO_3 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address3 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRLO_3    0xFFFFFFFFU
#define GMAC_ADDRLO_3_M  (GMAC_ADDRLO_3_V << GMAC_ADDRLO_3_S)
#define GMAC_ADDRLO_3_V  0xFFFFFFFFU
#define GMAC_ADDRLO_3_S  0

/** GMAC_MACADDRESS4HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEFIFTHMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS4HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEFIFTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x60)
/** GMAC_ADDRHI_4 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRHI_4    0x0000FFFFU
#define GMAC_ADDRHI_4_M  (GMAC_ADDRHI_4_V << GMAC_ADDRHI_4_S)
#define GMAC_ADDRHI_4_V  0x0000FFFFU
#define GMAC_ADDRHI_4_S  0
/** GMAC_MBC_4 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_MBC_4    0x0000003FU
#define GMAC_MBC_4_M  (GMAC_MBC_4_V << GMAC_MBC_4_S)
#define GMAC_MBC_4_V  0x0000003FU
#define GMAC_MBC_4_S  24
/** GMAC_SA_4 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_SA_4    (BIT(30))
#define GMAC_SA_4_M  (GMAC_SA_4_V << GMAC_SA_4_S)
#define GMAC_SA_4_V  0x00000001U
#define GMAC_SA_4_S  30
/** GMAC_AE_4 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_AE_4    (BIT(31))
#define GMAC_AE_4_M  (GMAC_AE_4_V << GMAC_AE_4_S)
#define GMAC_AE_4_V  0x00000001U
#define GMAC_AE_4_S  31

/** GMAC_MACADDRESS4LOWREGISTERCONTAINSTHELOWER32BITSOFTHEFIFTHMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS4LOWREGISTERCONTAINSTHELOWER32BITSOFTHEFIFTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x64)
/** GMAC_ADDRLO_4 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address4 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRLO_4    0xFFFFFFFFU
#define GMAC_ADDRLO_4_M  (GMAC_ADDRLO_4_V << GMAC_ADDRLO_4_S)
#define GMAC_ADDRLO_4_V  0xFFFFFFFFU
#define GMAC_ADDRLO_4_S  0

/** GMAC_MACADDRESS5HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHESIXTHMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS5HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHESIXTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x68)
/** GMAC_ADDRHI_5 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRHI_5    0x0000FFFFU
#define GMAC_ADDRHI_5_M  (GMAC_ADDRHI_5_V << GMAC_ADDRHI_5_S)
#define GMAC_ADDRHI_5_V  0x0000FFFFU
#define GMAC_ADDRHI_5_S  0
/** GMAC_MBC_5 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_MBC_5    0x0000003FU
#define GMAC_MBC_5_M  (GMAC_MBC_5_V << GMAC_MBC_5_S)
#define GMAC_MBC_5_V  0x0000003FU
#define GMAC_MBC_5_S  24
/** GMAC_SA_5 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_SA_5    (BIT(30))
#define GMAC_SA_5_M  (GMAC_SA_5_V << GMAC_SA_5_S)
#define GMAC_SA_5_V  0x00000001U
#define GMAC_SA_5_S  30
/** GMAC_AE_5 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_AE_5    (BIT(31))
#define GMAC_AE_5_M  (GMAC_AE_5_V << GMAC_AE_5_S)
#define GMAC_AE_5_V  0x00000001U
#define GMAC_AE_5_S  31

/** GMAC_MACADDRESS5LOWREGISTERCONTAINSTHELOWER32BITSOFTHESIXTHMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS5LOWREGISTERCONTAINSTHELOWER32BITSOFTHESIXTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x6c)
/** GMAC_ADDRLO_5 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address5 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRLO_5    0xFFFFFFFFU
#define GMAC_ADDRLO_5_M  (GMAC_ADDRLO_5_V << GMAC_ADDRLO_5_S)
#define GMAC_ADDRLO_5_V  0xFFFFFFFFU
#define GMAC_ADDRLO_5_S  0

