espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_MACADDRESS6HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHESEVENTHMACADDRESS_REG
 *  register
 *  Reserved
 */
#define GMAC_MACADDRESS6HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHESEVENTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x70)
/** GMAC_ADDRHI_6 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRHI_6    0x0000FFFFU
#define GMAC_ADDRHI_6_M  (GMAC_ADDRHI_6_V << GMAC_ADDRHI_6_S)
#define GMAC_ADDRHI_6_V  0x0000FFFFU
#define GMAC_ADDRHI_6_S  0
/** GMAC_MBC_6 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_MBC_6    0x0000003FU
#define GMAC_MBC_6_M  (GMAC_MBC_6_V << GMAC_MBC_6_S)
#define GMAC_MBC_6_V  0x0000003FU
#define GMAC_MBC_6_S  24
/** GMAC_SA_6 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_SA_6    (BIT(30))
#define GMAC_SA_6_M  (GMAC_SA_6_V << GMAC_SA_6_S)
#define GMAC_SA_6_V  0x00000001U
#define GMAC_SA_6_S  30
/** GMAC_AE_6 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_AE_6    (BIT(31))
#define GMAC_AE_6_M  (GMAC_AE_6_V << GMAC_AE_6_S)
#define GMAC_AE_6_V  0x00000001U
#define GMAC_AE_6_S  31

/** GMAC_MACADDRESS6LOWREGISTERCONTAINSTHELOWER32BITSOFTHESEVENTHMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS6LOWREGISTERCONTAINSTHELOWER32BITSOFTHESEVENTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x74)
/** GMAC_ADDRLO_6 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address6 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRLO_6    0xFFFFFFFFU
#define GMAC_ADDRLO_6_M  (GMAC_ADDRLO_6_V << GMAC_ADDRLO_6_S)
#define GMAC_ADDRLO_6_V  0xFFFFFFFFU
#define GMAC_ADDRLO_6_S  0

/** GMAC_MACADDRESS7HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEEIGHTHMACADDRESS_REG
 *  register
 *  Reserved
 */
#define GMAC_MACADDRESS7HIGHREGISTERCONTAINSTHEHIGHER16BITSOFTHEEIGHTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x78)
/** GMAC_ADDRHI_7 : R/W; bitpos: [15:0]; default: 65535;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRHI_7    0x0000FFFFU
#define GMAC_ADDRHI_7_M  (GMAC_ADDRHI_7_V << GMAC_ADDRHI_7_S)
#define GMAC_ADDRHI_7_V  0x0000FFFFU
#define GMAC_ADDRHI_7_S  0
/** GMAC_MBC_7 : R/W; bitpos: [29:24]; default: 0;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_MBC_7    0x0000003FU
#define GMAC_MBC_7_M  (GMAC_MBC_7_V << GMAC_MBC_7_S)
#define GMAC_MBC_7_V  0x0000003FU
#define GMAC_MBC_7_S  24
/** GMAC_SA_7 : R/W; bitpos: [30]; default: 0;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_SA_7    (BIT(30))
#define GMAC_SA_7_M  (GMAC_SA_7_V << GMAC_SA_7_S)
#define GMAC_SA_7_V  0x00000001U
#define GMAC_SA_7_S  30
/** GMAC_AE_7 : R/W; bitpos: [31]; default: 0;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_AE_7    (BIT(31))
#define GMAC_AE_7_M  (GMAC_AE_7_V << GMAC_AE_7_S)
#define GMAC_AE_7_V  0x00000001U
#define GMAC_AE_7_S  31

/** GMAC_MACADDRESS7LOWREGISTERCONTAINSTHELOWER32BITSOFTHEEIGHTHMACADDRESS_REG register
 *  Reserved
 */
#define GMAC_MACADDRESS7LOWREGISTERCONTAINSTHELOWER32BITSOFTHEEIGHTHMACADDRESS_REG (DR_REG_GMAC_BASE + 0x7c)
/** GMAC_ADDRLO_7 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is present only when Enable MAC Address7 is selected in
 *  coreConsultant _See Table 78_
 */
#define GMAC_ADDRLO_7    0xFFFFFFFFU
#define GMAC_ADDRLO_7_M  (GMAC_ADDRLO_7_V << GMAC_ADDRLO_7_S)
#define GMAC_ADDRLO_7_V  0xFFFFFFFFU
#define GMAC_ADDRLO_7_S  0

/** GMAC_REGISTER48_ANCONTROLREGISTER_REG register
 *  Enables and/or restarts autonegotiation This register also enables the Physical
 *  Coding Sublayer _PCS_ loopback This register is present only when you select the
 *  TBI, RTBI, or SGMII interface in coreConsultant
 */
#define GMAC_REGISTER48_ANCONTROLREGISTER_REG (DR_REG_GMAC_BASE + 0xc0)
/** GMAC_RAN : R/W1S; bitpos: [9]; default: 0;
 *  Restart AutoNegotiation When set, this bit causes autonegotiation to restart if Bit
 *  12 _ANE_ is set This bit is selfclearing after autonegotiation starts This bit
 *  should be cleared for normal operation
 */
#define GMAC_RAN    (BIT(9))
#define GMAC_RAN_M  (GMAC_RAN_V << GMAC_RAN_S)
#define GMAC_RAN_V  0x00000001U
#define GMAC_RAN_S  9
/** GMAC_ANE : R/W; bitpos: [12]; default: 0;
 *  AutoNegotiation Enable When set, this bit enables the MAC to perform
 *  autonegotiation with the link partner Clearing this bit disables the autonegotiation
 */
#define GMAC_ANE    (BIT(12))
#define GMAC_ANE_M  (GMAC_ANE_V << GMAC_ANE_S)
#define GMAC_ANE_V  0x00000001U
#define GMAC_ANE_S  12
/** GMAC_ELE : R/W; bitpos: [14]; default: 0;
 *  External Loopback Enable When set, this bit causes the PHY to loopback the transmit
 *  data into the receive path The pcs_ewrap_o signal is asserted high when this bit is
 *  set
 */
#define GMAC_ELE    (BIT(14))
#define GMAC_ELE_M  (GMAC_ELE_V << GMAC_ELE_S)
#define GMAC_ELE_V  0x00000001U
#define GMAC_ELE_S  14
/** GMAC_ECD : R/W; bitpos: [16]; default: 0;
 *  Enable Comma Detect When set, this bit enables the PHY for comma detection and word
 *  resynchronization This bit controls the pcs_en_cdet_o signal on the TBI, RTBI, or
 *  SGMII interface
 */
#define GMAC_ECD    (BIT(16))
#define GMAC_ECD_M  (GMAC_ECD_V << GMAC_ECD_S)
#define GMAC_ECD_V  0x00000001U
#define GMAC_ECD_S  16
/** GMAC_LR : R/W; bitpos: [17]; default: 0;
 *  Lock to Reference When set, this bit enables the PHY to lock its PLL to the 125 MHz
 *  reference clock This bit controls the pcs_lck_ref_o signal on the TBI, RTBI, or
 *  SGMII interface
 */
#define GMAC_LR    (BIT(17))
#define GMAC_LR_M  (GMAC_LR_V << GMAC_LR_S)
#define GMAC_LR_V  0x00000001U
#define GMAC_LR_S  17
/** GMAC_SGMRAL : R/W; bitpos: [18]; default: 0;
 *  SGMII RAL Control When set, this bit forces the SGMII RAL block to operate in the
 *  speed configured in the Speed and Port Select bits of the MAC Configuration
 *  register This is useful when the SGMII interface is used in a direct MAC to MAC
 *  connection _without a PHY_ and any MAC must reconfigure the speed When reset, the
 *  SGMII RAL block operates according to the link speed status received on SGMII _from
 *  the PHY_ This bit is reserved _and RO_ if the SGMII PHY interface is not selected
 *  during core configuration
 */
#define GMAC_SGMRAL    (BIT(18))
#define GMAC_SGMRAL_M  (GMAC_SGMRAL_V << GMAC_SGMRAL_S)
#define GMAC_SGMRAL_V  0x00000001U
#define GMAC_SGMRAL_S  18

/** GMAC_REGISTER49_ANSTATUSREGISTER_REG register
 *  Indicates the link and autonegotiation status This register is present only when
 *  you select the TBI, RTBI, or SGMII interface in coreConsultant
 */
#define GMAC_REGISTER49_ANSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0xc4)
/** GMAC_LS : RO; bitpos: [2]; default: 0;
 *  Link Status This bit indicates whether the data channel _link_ is up or down For
 *  the TBI, RTBI or SGMII interfaces, if ANEG is going on, data cannot be transferred
 *  across the link and hence the link is given as down
 */
#define GMAC_LS    (BIT(2))
#define GMAC_LS_M  (GMAC_LS_V << GMAC_LS_S)
#define GMAC_LS_V  0x00000001U
#define GMAC_LS_S  2
/** GMAC_ANA : RO; bitpos: [3]; default: 1;
 *  AutoNegotiation Ability This bit is always high because the MAC supports auto
 *  negotiation
 */
#define GMAC_ANA    (BIT(3))
#define GMAC_ANA_M  (GMAC_ANA_V << GMAC_ANA_S)
#define GMAC_ANA_V  0x00000001U
#define GMAC_ANA_S  3
/** GMAC_ANC : RO; bitpos: [5]; default: 0;
 *  AutoNegotiation Complete When set, this bit indicates that the autonegotiation
 *  process is complete This bit is cleared when autonegotiation is reinitiated
 */
#define GMAC_ANC    (BIT(5))
#define GMAC_ANC_M  (GMAC_ANC_V << GMAC_ANC_S)
#define GMAC_ANC_V  0x00000001U
#define GMAC_ANC_S  5
/** GMAC_ES : RO; bitpos: [8]; default: 1;
 *  Extended Status This bit is tied to high if the TBI or RTBI interface is selected
 *  during core configuration indicating that the MAC supports extended status
 *  information in Register 53 _TBI Extended  Status Register_ This bit is tied to low
 *  if the SGMII interface is selected and the TBI or RTBI interface is not selected
 *  during core configuration indicating that Register 53 is not present
 */
#define GMAC_ES    (BIT(8))
#define GMAC_ES_M  (GMAC_ES_V << GMAC_ES_S)
#define GMAC_ES_V  0x00000001U
#define GMAC_ES_S  8

/** GMAC_REGISTER50_AUTONEGOTIATIONADVERTISEMENTREGISTER_REG register
 *  This register is configured before autonegotiation begins It contains the
 *  advertised ability of the MAC This register is present only when you select the TBI
 *  or RTBI interface in coreConsultant
 */
#define GMAC_REGISTER50_AUTONEGOTIATIONADVERTISEMENTREGISTER_REG (DR_REG_GMAC_BASE + 0xc8)
/** GMAC_FD : R/W; bitpos: [5]; default: 1;
 *  FullDuplex When set high, this bit indicates that the MAC supports the fullduplex
 *  mode
 */
#define GMAC_FD    (BIT(5))
#define GMAC_FD_M  (GMAC_FD_V << GMAC_FD_S)
#define GMAC_FD_V  0x00000001U
#define GMAC_FD_S  5
/** GMAC_HD : R/W; bitpos: [6]; default: 1;
 *  HalfDuplex When set high, this bit indicates that the MAC supports the halfduplex
 *  mode This bit is always low _and RO_ when the MAC is configured for the
 *  fullduplexonly mode
 */
#define GMAC_HD    (BIT(6))
#define GMAC_HD_M  (GMAC_HD_V << GMAC_HD_S)
#define GMAC_HD_V  0x00000001U
#define GMAC_HD_S  6
/** GMAC_PSE : R/W; bitpos: [8:7]; default: 3;
 *  Pause Encoding These bits provide an encoding for the Pause bits, indicating that
 *  the MAC is capable of configuring the Pause function as defined in IEEE 8023x The
 *  encoding of these bits is defined in IEEE 8023z, Section 37214
 */
#define GMAC_PSE    0x00000003U
#define GMAC_PSE_M  (GMAC_PSE_V << GMAC_PSE_S)
#define GMAC_PSE_V  0x00000003U
#define GMAC_PSE_S  7
/** GMAC_RFE : R/W; bitpos: [13:12]; default: 0;
 *  Remote Fault Encoding These bits provide a remote fault encoding, indicating to a
 *  link partner that a fault or error condition has occurred The encoding of these
 *  bits is defined in IEEE 8023z, Section 37215
 */
#define GMAC_RFE    0x00000003U
#define GMAC_RFE_M  (GMAC_RFE_V << GMAC_RFE_S)
#define GMAC_RFE_V  0x00000003U
#define GMAC_RFE_S  12
/** GMAC_NP : RO; bitpos: [15]; default: 0;
 *  Next Page Support This bit is always low because the MAC does not support the next
 *  page
 */
#define GMAC_NP    (BIT(15))
#define GMAC_NP_M  (GMAC_NP_V << GMAC_NP_S)
#define GMAC_NP_V  0x00000001U
#define GMAC_NP_S  15

