espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER51_AUTONEGOTIATIONLINKPARTNERABILITYREGISTER_REG register
 *  Contains the advertised ability of the link partner Its value is valid after
 *  successful completion of autonegotiation or when a new base page has been received
 *  _indicated in the AutoNegotiation Expansion Register_ This register is present only
 *  when you select the TBI or RTBI interface in coreConsultant
 */
#define GMAC_REGISTER51_AUTONEGOTIATIONLINKPARTNERABILITYREGISTER_REG (DR_REG_GMAC_BASE + 0xcc)
/** GMAC_FD_ABILITY : RO; bitpos: [5]; default: 0;
 *  FullDuplex When set, this bit indicates that the link partner has the ability to
 *  operate in the full duplex mode When cleared, this bit indicates that the link
 *  partner does not have the ability to operate in the fullduplex mode
 */
#define GMAC_FD_ABILITY    (BIT(5))
#define GMAC_FD_ABILITY_M  (GMAC_FD_ABILITY_V << GMAC_FD_ABILITY_S)
#define GMAC_FD_ABILITY_V  0x00000001U
#define GMAC_FD_ABILITY_S  5
/** GMAC_HD_ABILITY : RO; bitpos: [6]; default: 0;
 *  HalfDuplex When set, this bit indicates that the link partner has the ability to
 *  operate in the halfduplex mode When cleared, this bit indicates that the link
 *  partner does not have the ability to operate in the halfduplex mode
 */
#define GMAC_HD_ABILITY    (BIT(6))
#define GMAC_HD_ABILITY_M  (GMAC_HD_ABILITY_V << GMAC_HD_ABILITY_S)
#define GMAC_HD_ABILITY_V  0x00000001U
#define GMAC_HD_ABILITY_S  6
/** GMAC_PSE_ABILITY : RO; bitpos: [8:7]; default: 0;
 *  Pause Encoding These bits provide an encoding for the Pause bits, indicating that
 *  the link partner's capability of configuring the Pause function as defined in the
 *  IEEE 8023x specification The encoding of these bits is defined in IEEE 8023z,
 *  Section 37214
 */
#define GMAC_PSE_ABILITY    0x00000003U
#define GMAC_PSE_ABILITY_M  (GMAC_PSE_ABILITY_V << GMAC_PSE_ABILITY_S)
#define GMAC_PSE_ABILITY_V  0x00000003U
#define GMAC_PSE_ABILITY_S  7
/** GMAC_RFE_ABILITY : RO; bitpos: [13:12]; default: 0;
 *  Remote Fault Encoding These bits provide a remote fault encoding, indicating a
 *  fault or error condition of the link partner The encoding of these bits is defined
 *  in IEEE 8023z, Section 37215
 */
#define GMAC_RFE_ABILITY    0x00000003U
#define GMAC_RFE_ABILITY_M  (GMAC_RFE_ABILITY_V << GMAC_RFE_ABILITY_S)
#define GMAC_RFE_ABILITY_V  0x00000003U
#define GMAC_RFE_ABILITY_S  12
/** GMAC_ACK : RO; bitpos: [14]; default: 0;
 *  Acknowledge When set, the autonegotiation function uses this bit to indicate that
 *  the link partner has successfully received the base page of the MAC When cleared,
 *  it indicates that the link partner did not successfully receive the base page of
 *  the MAC
 */
#define GMAC_ACK    (BIT(14))
#define GMAC_ACK_M  (GMAC_ACK_V << GMAC_ACK_S)
#define GMAC_ACK_V  0x00000001U
#define GMAC_ACK_S  14
/** GMAC_NO : RO; bitpos: [15]; default: 0;
 *  Next Page Support When set, this bit indicates that more next page information is
 *  available When cleared, this bit indicates that next page exchange is not desired
 */
#define GMAC_NO    (BIT(15))
#define GMAC_NO_M  (GMAC_NO_V << GMAC_NO_S)
#define GMAC_NO_V  0x00000001U
#define GMAC_NO_S  15

/** GMAC_REGISTER52_AUTONEGOTIATIONEXPANSIONREGISTER_REG register
 *  Indicates whether a new base page has been received from the link partner This
 *  register is present only when you select the TBI or RTBI interface in coreConsultant
 */
#define GMAC_REGISTER52_AUTONEGOTIATIONEXPANSIONREGISTER_REG (DR_REG_GMAC_BASE + 0xd0)
/** GMAC_NPR : RO; bitpos: [1]; default: 0;
 *  New Page Received When set, this bit indicates that the MAC has received a new page
 *  This bit is cleared when read
 */
#define GMAC_NPR    (BIT(1))
#define GMAC_NPR_M  (GMAC_NPR_V << GMAC_NPR_S)
#define GMAC_NPR_V  0x00000001U
#define GMAC_NPR_S  1
/** GMAC_NPA : RO; bitpos: [2]; default: 0;
 *  Next Page Ability This bit is always low because the MAC does not support the next
 *  page function
 */
#define GMAC_NPA    (BIT(2))
#define GMAC_NPA_M  (GMAC_NPA_V << GMAC_NPA_S)
#define GMAC_NPA_V  0x00000001U
#define GMAC_NPA_S  2

/** GMAC_REGISTER53_TBIEXTENDEDSTATUSREGISTER_REG register
 *  Indicates all modes of operation of the MAC This register is present only when you
 *  select the TBI or RTBI interface in coreConsultant
 */
#define GMAC_REGISTER53_TBIEXTENDEDSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0xd4)
/** GMAC_GHD : RO; bitpos: [14]; default: 1;
 *  1000BASEX HalfDuplex Capable This bit indicates that the MAC is able to perform the
 *  halfduplex and 1000BASEX operations This bit is always low when the MAC is
 *  configured for the fullduplexonly operation during core configuration
 */
#define GMAC_GHD    (BIT(14))
#define GMAC_GHD_M  (GMAC_GHD_V << GMAC_GHD_S)
#define GMAC_GHD_V  0x00000001U
#define GMAC_GHD_S  14
/** GMAC_GFD : RO; bitpos: [15]; default: 1;
 *  1000BASEX FullDuplex Capable This bit indicates that the MAC is able to perform the
 *  fullduplex and 1000BASEX operations
 */
#define GMAC_GFD    (BIT(15))
#define GMAC_GFD_M  (GMAC_GFD_V << GMAC_GFD_S)
#define GMAC_GFD_V  0x00000001U
#define GMAC_GFD_S  15

/** GMAC_REGISTER54_SGMII_RGMII_SMIICONTROLANDSTATUSREGISTER_REG register
 *  Indicates the status signals received from the PHY through the SGMII, RGMII, or
 *  SMII interface This register is present only when you select the SGMII, RGMII, or
 *  SMII interface in coreConsultant
 */
#define GMAC_REGISTER54_SGMII_RGMII_SMIICONTROLANDSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0xd8)
/** GMAC_LNKMOD : RO; bitpos: [0]; default: 0;
 *  Link Mode This bit indicates the current mode of operation of the link: 1’b0:
 *  Halfduplex mode 1’b1: Fullduplex mode
 */
#define GMAC_LNKMOD    (BIT(0))
#define GMAC_LNKMOD_M  (GMAC_LNKMOD_V << GMAC_LNKMOD_S)
#define GMAC_LNKMOD_V  0x00000001U
#define GMAC_LNKMOD_S  0
/** GMAC_LNKSPEED : RO; bitpos: [2:1]; default: 2;
 *  Link Speed
 */
#define GMAC_LNKSPEED    0x00000003U
#define GMAC_LNKSPEED_M  (GMAC_LNKSPEED_V << GMAC_LNKSPEED_S)
#define GMAC_LNKSPEED_V  0x00000003U
#define GMAC_LNKSPEED_S  1
/** GMAC_LNKSTS : RO; bitpos: [3]; default: 0;
 *  Link Status This bit indicates whether the link between the local PHY and the
 *  remote PHY is up or down It gives the status of the link between the SGMII of MAC
 *  and the SGMII of the local PHY The status bits are received from the local PHY
 *  during ANEG between he MAC and PHY on the SGMII link
 */
#define GMAC_LNKSTS    (BIT(3))
#define GMAC_LNKSTS_M  (GMAC_LNKSTS_V << GMAC_LNKSTS_S)
#define GMAC_LNKSTS_V  0x00000001U
#define GMAC_LNKSTS_S  3
/** GMAC_JABTO : RO; bitpos: [4]; default: 0;
 *  Jabber Timeout This bit indicates whether there is jabber timeout error _1'b1_ in
 *  the received frame This bit is reserved when the MAC is configured for the SGMII or
 *  RGMII PHY interface
 */
#define GMAC_JABTO    (BIT(4))
#define GMAC_JABTO_M  (GMAC_JABTO_V << GMAC_JABTO_S)
#define GMAC_JABTO_V  0x00000001U
#define GMAC_JABTO_S  4
/** GMAC_FALSCARDET : RO; bitpos: [5]; default: 0;
 *  False Carrier Detected This bit indicates whether the SMII PHY detected false
 *  carrier _1'b1_ This bit is reserved when the MAC is configured for the SGMII or
 *  RGMII PHY interface
 */
#define GMAC_FALSCARDET    (BIT(5))
#define GMAC_FALSCARDET_M  (GMAC_FALSCARDET_V << GMAC_FALSCARDET_S)
#define GMAC_FALSCARDET_V  0x00000001U
#define GMAC_FALSCARDET_S  5
/** GMAC_SMIDRXS : R/W; bitpos: [16]; default: 0;
 *  Delay SMII RX Data Sampling with respect to the SMII SYNC Signal When set, the
 *  first bit of the SMII RX data is sampled one cycle after the SMII SYNC signal When
 *  reset, the first bit of the SMII RX data is sampled along with the SMII SYNC signal
 *  If the SMII PHY Interface with source synchronous mode is selected during core
 *  configuration, this bit is reserved _RO with default value_
 */
#define GMAC_SMIDRXS    (BIT(16))
#define GMAC_SMIDRXS_M  (GMAC_SMIDRXS_V << GMAC_SMIDRXS_S)
#define GMAC_SMIDRXS_V  0x00000001U
#define GMAC_SMIDRXS_S  16

/** GMAC_REGISTER55_WATCHDOGTIMEOUTREGISTER_REG register
 *  Controls the watchdog timeout for received frames
 */
#define GMAC_REGISTER55_WATCHDOGTIMEOUTREGISTER_REG (DR_REG_GMAC_BASE + 0xdc)
/** GMAC_WTO : R/W; bitpos: [13:0]; default: 0;
 *  Watchdog Timeout When Bit 16 _PWE_ is set and Bit 23 _WD_ of Register 0 _MAC
 *  Configuration Register_ is reset, this field is used as watchdog timeout for a
 *  received frame If the length of a received frame exceeds the value of this field,
 *  such frame is terminated and declared as an error frame Note: When Bit 16 _PWE_ is
 *  set, the value in this field should be more than 1,522 _0x05F2_ Otherwise, the IEEE
 *  Std 8023specified valid tagged frames are declared as error frames and are dropped
 */
#define GMAC_WTO    0x00003FFFU
#define GMAC_WTO_M  (GMAC_WTO_V << GMAC_WTO_S)
#define GMAC_WTO_V  0x00003FFFU
#define GMAC_WTO_S  0
/** GMAC_PWE : R/W; bitpos: [16]; default: 0;
 *  Programmable Watchdog Enable When this bit is set and Bit 23 _WD_ of Register 0
 *  _MAC Configuration Register_ is reset, the WTO field _Bits[13:0]_ is used as
 *  watchdog timeout for a received frame When this bit is cleared, the watchdog
 *  timeout for a received frame is controlled by the setting of Bit 23 _WD_ and Bit 20
 *  _JE_ in Register 0 _MAC Configuration Register_
 */
#define GMAC_PWE    (BIT(16))
#define GMAC_PWE_M  (GMAC_PWE_V << GMAC_PWE_S)
#define GMAC_PWE_V  0x00000001U
#define GMAC_PWE_S  16

/** GMAC_REGISTER56_GENERALPURPOSEIOREGISTER_REG register
 *  Provides the control to drive up to 4 bits of output ports _GPO_ and also provides
 *  the status of up to 4 input ports _GPIS_
 */
#define GMAC_REGISTER56_GENERALPURPOSEIOREGISTER_REG (DR_REG_GMAC_BASE + 0xe0)
/** GMAC_GPIS : R/W; bitpos: [3:0]; default: 0;
 *  General Purpose Input Status This field gives the status of the signals connected
 *  to the gpi_i input ports This field is of the following types based on the setting
 *  of the corresponding GPIT field of this register: Latchedlow _LL_: This field is
 *  cleared when the corresponding gpi_i input becomes low This field remains low until
 *  the host reads this field After this, this field reflects the current value of the
 *  gpi_i input Latchedhigh _LH_: This field is set when the corresponding gpi_i input
 *  becomes high This field remains high until the host reads this field After this,
 *  this field reflects the current value of the gpi_i input The number of bits
 *  available in this field depend on the GP Input Signal Width option Other bits are
 *  not used _reserved and always reset_
 */
#define GMAC_GPIS    0x0000000FU
#define GMAC_GPIS_M  (GMAC_GPIS_V << GMAC_GPIS_S)
#define GMAC_GPIS_V  0x0000000FU
#define GMAC_GPIS_S  0
/** GMAC_GPO : R/W; bitpos: [11:8]; default: 0;
 *  General Purpose Output When this bit is set, it directly drives the gpo_o output
 *  ports When this bit is reset, it does not directly drive the gpo_o output ports The
 *  number of bits available in this field depend on the GP Output Signal Width option
 *  Other bits are not used _reserved and always reset_
 */
#define GMAC_GPO    0x0000000FU
#define GMAC_GPO_M  (GMAC_GPO_V << GMAC_GPO_S)
#define GMAC_GPO_V  0x0000000FU
#define GMAC_GPO_S  8
/** GMAC_GPIE : R/W; bitpos: [19:16]; default: 0;
 *  GPI Interrupt Enable When this bit is set and the programmed event _LL or LH_
 *  occurs on the corresponding GPIS bit, Bit 11 _GPIIS_ of Register 14 _Interrupt
 *  Status Register_ is set Accordingly, the interrupt is generated on the mci_intr_o
 *  or sbd_intr_o The GPIIS bit is cleared when the host reads the Bits[7:0] of this
 *  register When reset, Bit 11 _GPIIS_ of Register 14 _Interrupt Status Register_ is
 *  not set when any event occurs on the corresponding GPIS bits The number of bits
 *  available in this field depend on the GP Input Signal Width option Other bits are
 *  not used _reserved and always reset_
 */
#define GMAC_GPIE    0x0000000FU
#define GMAC_GPIE_M  (GMAC_GPIE_V << GMAC_GPIE_S)
#define GMAC_GPIE_V  0x0000000FU
#define GMAC_GPIE_S  16
/** GMAC_GPIT : R/W; bitpos: [27:24]; default: 0;
 *  GPI Type When set, this bit indicates that the corresponding GPIS is of latchedlow
 *  _LL_ type When reset, this bit indicates that the corresponding GPIS is of
 *  latchedhigh _LH_ type The number of bits available in this field depend on the GP
 *  Input Signal Width option Other bits are not used _reserved and always reset_
 */
#define GMAC_GPIT    0x0000000FU
#define GMAC_GPIT_M  (GMAC_GPIT_V << GMAC_GPIT_S)
#define GMAC_GPIT_V  0x0000000FU
#define GMAC_GPIT_S  24

