espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER256_LAYER3ANDLAYER4CONTROLREGISTER0_REG register
 *  Controls the operations of the Layer 3 and Layer 4 frame filtering
 */
#define GMAC_REGISTER256_LAYER3ANDLAYER4CONTROLREGISTER0_REG (DR_REG_GMAC_BASE + 0x400)
/** GMAC_L3PEN0 : R/W; bitpos: [0]; default: 0;
 *  Layer 3 Protocol Enable When set, this bit indicates that the Layer 3 IP Source or
 *  Destination Address matching is enabled for the IPv6 frames When reset, this bit
 *  indicates that the Layer 3 IP Source or Destination Address matching is enabled for
 *  the IPv4 frames The Layer 3 matching is done only when either L3SAM0 or L3DAM0 bit
 *  is set high
 */
#define GMAC_L3PEN0    (BIT(0))
#define GMAC_L3PEN0_M  (GMAC_L3PEN0_V << GMAC_L3PEN0_S)
#define GMAC_L3PEN0_V  0x00000001U
#define GMAC_L3PEN0_S  0
/** GMAC_L3SAM0 : R/W; bitpos: [2]; default: 0;
 *  Layer 3 IP SA Match Enable When set, this bit indicates that the Layer 3 IP Source
 *  Address field is enabled for matching When reset, the MAC ignores the Layer 3 IP
 *  Source Address field for matching Note: When Bit 0 _L3PEN0_ is set, you should set
 *  either this bit or Bit 4 _L3DAM0_ because either IPv6 SA or DA can be checked for
 *  filtering
 */
#define GMAC_L3SAM0    (BIT(2))
#define GMAC_L3SAM0_M  (GMAC_L3SAM0_V << GMAC_L3SAM0_S)
#define GMAC_L3SAM0_V  0x00000001U
#define GMAC_L3SAM0_S  2
/** GMAC_L3SAIM0 : R/W; bitpos: [3]; default: 0;
 *  Layer 3 IP SA Inverse Match Enable When set, this bit indicates that the Layer 3 IP
 *  Source Address field is enabled for inverse matching When reset, this bit indicates
 *  that the Layer 3 IP Source Address field is enabled for perfect matching This bit
 *  is valid and applicable only when Bit 2 _L3SAM0_ is set high
 */
#define GMAC_L3SAIM0    (BIT(3))
#define GMAC_L3SAIM0_M  (GMAC_L3SAIM0_V << GMAC_L3SAIM0_S)
#define GMAC_L3SAIM0_V  0x00000001U
#define GMAC_L3SAIM0_S  3
/** GMAC_L3DAM0 : R/W; bitpos: [4]; default: 0;
 *  Layer 3 IP DA Match Enable When set, this bit indicates that Layer 3 IP Destination
 *  Address field is enabled for matching When reset, the MAC ignores the Layer 3 IP
 *  Destination Address field for matching Note: When Bit 0 _L3PEN0_ is set, you should
 *  set either this bit or Bit 2 _L3SAM0_ because either IPv6 DA or SA can be checked
 *  for filtering
 */
#define GMAC_L3DAM0    (BIT(4))
#define GMAC_L3DAM0_M  (GMAC_L3DAM0_V << GMAC_L3DAM0_S)
#define GMAC_L3DAM0_V  0x00000001U
#define GMAC_L3DAM0_S  4
/** GMAC_L3DAIM0 : R/W; bitpos: [5]; default: 0;
 *  Layer 3 IP DA Inverse Match Enable When set, this bit indicates that the Layer 3 IP
 *  Destination Address field is enabled for inverse matching When reset, this bit
 *  indicates that the Layer 3 IP Destination Address field is enabled for perfect
 *  matching This bit is valid and applicable only when Bit 4 _L3DAM0_ is set high
 */
#define GMAC_L3DAIM0    (BIT(5))
#define GMAC_L3DAIM0_M  (GMAC_L3DAIM0_V << GMAC_L3DAIM0_S)
#define GMAC_L3DAIM0_V  0x00000001U
#define GMAC_L3DAIM0_S  5
/** GMAC_L3HSBM0 : R/W; bitpos: [10:6]; default: 0;
 *  Layer 3 IP SA Higher Bits Match IPv4 Frames: This field contains the number of
 *  lower bits of IP Source Address that are masked for matching in the IPv4 frames The
 *  following list describes the values of this field: 0: No bits are masked 1: LSb[0]
 *  is masked 2: Two LSbs [1:0] are masked  31: All bits except MSb are masked IPv6
 *  Frames: This field contains Bits [4:0] of the field that indicates the number of
 *  higher bits of IP Source or Destination Address matched in the IPv6 frames This
 *  field is valid and applicable only if L3DAM0 or L3SAM0 is set high
 */
#define GMAC_L3HSBM0    0x0000001FU
#define GMAC_L3HSBM0_M  (GMAC_L3HSBM0_V << GMAC_L3HSBM0_S)
#define GMAC_L3HSBM0_V  0x0000001FU
#define GMAC_L3HSBM0_S  6
/** GMAC_L3HDBM0 : R/W; bitpos: [15:11]; default: 0;
 *  Layer 3 IP DA Higher Bits Match IPv4 Frames: This field contains the number of
 *  higher bits of IP Destination Address that are matched in the IPv4 frames The
 *  following list describes the values of this field: 0: No bits are masked 1: LSb[0]
 *  is masked 2: Two LSbs [1:0] are masked  31: All bits except MSb are masked IPv6
 *  Frames: Bits [12:11] of this field correspond to Bits [6:5] of L3HSBM0, which
 *  indicate the number of lower bits of IP Source or Destination Address that are
 *  masked in the IPv6 frames The following list describes the concatenated values of
 *  the L3HDBM0[1:0] and L3HSBM0 bits: 0: No bits are masked 1: LSb[0] is masked 2: Two
 *  LSbs [1:0] are masked … 127: All bits except MSb are masked This field is valid and
 *  applicable only if L3DAM0 or L3SAM0 is set high
 */
#define GMAC_L3HDBM0    0x0000001FU
#define GMAC_L3HDBM0_M  (GMAC_L3HDBM0_V << GMAC_L3HDBM0_S)
#define GMAC_L3HDBM0_V  0x0000001FU
#define GMAC_L3HDBM0_S  11
/** GMAC_L4PEN0 : R/W; bitpos: [16]; default: 0;
 *  Layer 4 Protocol Enable When set, this bit indicates that the Source and
 *  Destination Port number fields for UDP frames are used for matching When reset,
 *  this bit indicates that the Source and Destination Port number fields for TCP
 *  frames are used for matching The Layer 4 matching is done only when either L4SPM0
 *  or L4DPM0 bit is set high
 */
#define GMAC_L4PEN0    (BIT(16))
#define GMAC_L4PEN0_M  (GMAC_L4PEN0_V << GMAC_L4PEN0_S)
#define GMAC_L4PEN0_V  0x00000001U
#define GMAC_L4PEN0_S  16
/** GMAC_L4SPM0 : R/W; bitpos: [18]; default: 0;
 *  Layer 4 Source Port Match Enable When set, this bit indicates that the Layer 4
 *  Source Port number field is enabled for matching When reset, the MAC ignores the
 *  Layer 4 Source Port number field for matching
 */
#define GMAC_L4SPM0    (BIT(18))
#define GMAC_L4SPM0_M  (GMAC_L4SPM0_V << GMAC_L4SPM0_S)
#define GMAC_L4SPM0_V  0x00000001U
#define GMAC_L4SPM0_S  18
/** GMAC_L4SPIM0 : R/W; bitpos: [19]; default: 0;
 *  Layer 4 Source Port Inverse Match Enable When set, this bit indicates that the
 *  Layer 4 Source Port number field is enabled for inverse matching When reset, this
 *  bit indicates that the Layer 4 Source Port number field is enabled for perfect
 *  matching This bit is valid and applicable only when Bit 18 _L4SPM0_ is set high
 */
#define GMAC_L4SPIM0    (BIT(19))
#define GMAC_L4SPIM0_M  (GMAC_L4SPIM0_V << GMAC_L4SPIM0_S)
#define GMAC_L4SPIM0_V  0x00000001U
#define GMAC_L4SPIM0_S  19
/** GMAC_L4DPM0 : R/W; bitpos: [20]; default: 0;
 *  Layer 4 Destination Port Match Enable When set, this bit indicates that the Layer 4
 *  Destination Port number field is enabled for matching When reset, the MAC ignores
 *  the Layer 4 Destination Port number field for matching
 */
#define GMAC_L4DPM0    (BIT(20))
#define GMAC_L4DPM0_M  (GMAC_L4DPM0_V << GMAC_L4DPM0_S)
#define GMAC_L4DPM0_V  0x00000001U
#define GMAC_L4DPM0_S  20
/** GMAC_L4DPIM0 : R/W; bitpos: [21]; default: 0;
 *  Layer 4 Destination Port Inverse Match Enable When set, this bit indicates that the
 *  Layer 4 Destination Port number field is enabled for inverse matching When reset,
 *  this bit indicates that the Layer 4 Destination Port number field is enabled for
 *  perfect matching This bit is valid and applicable only when Bit 20 _L4DPM0_ is set
 *  high
 */
#define GMAC_L4DPIM0    (BIT(21))
#define GMAC_L4DPIM0_M  (GMAC_L4DPIM0_V << GMAC_L4DPIM0_S)
#define GMAC_L4DPIM0_V  0x00000001U
#define GMAC_L4DPIM0_S  21

/** GMAC_REGISTER257_LAYER4ADDRESSREGISTER0_REG register
 *  Layer 4 Port number field It contains the 16bit Source and Destination Port numbers
 *  of the TCP or UDP frame
 */
#define GMAC_REGISTER257_LAYER4ADDRESSREGISTER0_REG (DR_REG_GMAC_BASE + 0x404)
/** GMAC_L4SP0 : R/W; bitpos: [15:0]; default: 0;
 *  Layer 4 Source Port Number Field When Bit 16 _L4PEN0_ is reset and Bit 20 _L4DPM0_
 *  is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this field
 *  contains the value to be matched with the TCP Source Port Number field in the IPv4
 *  or IPv6 frames When Bit 16 _L4PEN0_ and Bit 20 _L4DPM0_ are set in Register 256
 *  _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with the UDP Source Port Number field in the IPv4 or IPv6 frames
 */
#define GMAC_L4SP0    0x0000FFFFU
#define GMAC_L4SP0_M  (GMAC_L4SP0_V << GMAC_L4SP0_S)
#define GMAC_L4SP0_V  0x0000FFFFU
#define GMAC_L4SP0_S  0
/** GMAC_L4DP0 : R/W; bitpos: [31:16]; default: 0;
 *  Layer 4 Destination Port Number Field When Bit 16 _L4PEN0_ is reset and Bit 20
 *  _L4DPM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this
 *  field contains the value to be matched with the TCP Destination Port Number field
 *  in the IPv4 or IPv6 frames When Bit 16 _L4PEN0_ and Bit 20 _L4DPM0_ are set in
 *  Register 256 _Layer 3 and Layer 4 Control Register 0_, this field contains the
 *  value to be matched with the UDP Destination Port Number field in the IPv4 or IPv6
 *  frames
 */
#define GMAC_L4DP0    0x0000FFFFU
#define GMAC_L4DP0_M  (GMAC_L4DP0_V << GMAC_L4DP0_S)
#define GMAC_L4DP0_V  0x0000FFFFU
#define GMAC_L4DP0_S  16

/** GMAC_REGISTER260_LAYER3ADDRESS0REGISTER0_REG register
 *  Layer 3 Address field For IPv4 frames, it contains the 32bit IP Source Address
 *  field For IPv6 frames, it contains Bits [31:0] of the 128bit IP Source Address or
 *  Destination Address field
 */
#define GMAC_REGISTER260_LAYER3ADDRESS0REGISTER0_REG (DR_REG_GMAC_BASE + 0x410)
/** GMAC_L3A00 : R/W; bitpos: [31:0]; default: 0;
 *  Layer 3 Address 0 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register
 *  256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with Bits [31:0] of the IP Source Address field in the IPv6 frames When Bit
 *  0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4 Control
 *  Register 0_, this field contains the value to be matched with Bits [31:0] of the IP
 *  Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset and Bit 2
 *  _L3SAM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_, this
 *  field contains the value to be matched with the IP Source Address field in the IPv4
 *  frames
 */
#define GMAC_L3A00    0xFFFFFFFFU
#define GMAC_L3A00_M  (GMAC_L3A00_V << GMAC_L3A00_S)
#define GMAC_L3A00_V  0xFFFFFFFFU
#define GMAC_L3A00_S  0

/** GMAC_REGISTER261_LAYER3ADDRESS1REGISTER0_REG register
 *  Layer 3 Address 1 field For IPv4 frames, it contains the 32bit IP Destination
 *  Address field For IPv6 frames, it contains Bits [63:32] of the 128bit IP Source
 *  Address or Destination Address field
 */
#define GMAC_REGISTER261_LAYER3ADDRESS1REGISTER0_REG (DR_REG_GMAC_BASE + 0x414)
/** GMAC_L3A10 : R/W; bitpos: [31:0]; default: 0;
 *  Layer 3 Address 1 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register
 *  256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with Bits [63:32] of the IP Source Address field in the IPv6 frames When
 *  Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4
 *  Control Register 0_, this field contains the value to be matched with Bits [63:32]
 *  of the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset
 *  and Bit 4 _L3DAM0_ is set in Register 256 _Layer 3 and Layer 4 Control Register 0_,
 *  this field contains the value to be matched with the IP Destination Address field
 *  in the IPv4 frames
 */
#define GMAC_L3A10    0xFFFFFFFFU
#define GMAC_L3A10_M  (GMAC_L3A10_V << GMAC_L3A10_S)
#define GMAC_L3A10_V  0xFFFFFFFFU
#define GMAC_L3A10_S  0

/** GMAC_REGISTER262_LAYER3ADDRESS2REGISTER0_REG register
 *  Layer 3 Address 2 field This register is reserved for IPv4 frames For IPv6 frames,
 *  it contains Bits [95:64] of the 128bit IP Source Address or Destination Address
 *  field
 */
#define GMAC_REGISTER262_LAYER3ADDRESS2REGISTER0_REG (DR_REG_GMAC_BASE + 0x418)
/** GMAC_L3A20 : R/W; bitpos: [31:0]; default: 0;
 *  Layer 3 Address 2 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register
 *  256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with Bits [95:64] of the IP Source Address field in the IPv6 frames When
 *  Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4
 *  Control Register 0_, this field contains value to be matched with Bits [95:64] of
 *  the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset in
 *  Register 256 _Layer 3 and Layer 4 Control Register 0_, this register is not used
 */
#define GMAC_L3A20    0xFFFFFFFFU
#define GMAC_L3A20_M  (GMAC_L3A20_V << GMAC_L3A20_S)
#define GMAC_L3A20_V  0xFFFFFFFFU
#define GMAC_L3A20_S  0

/** GMAC_REGISTER263_LAYER3ADDRESS3REGISTER0_REG register
 *  Layer 3 Address 3 field This register is reserved for IPv4 frames For IPv6 frames,
 *  it contains Bits [127:96] of the 128bit IP Source Address or Destination Address
 *  field
 */
#define GMAC_REGISTER263_LAYER3ADDRESS3REGISTER0_REG (DR_REG_GMAC_BASE + 0x41c)
/** GMAC_L3A30 : R/W; bitpos: [31:0]; default: 0;
 *  Layer 3 Address 3 Field When Bit 0 _L3PEN0_ and Bit 2 _L3SAM0_ are set in Register
 *  256 _Layer 3 and Layer 4 Control Register 0_, this field contains the value to be
 *  matched with Bits [127:96] of the IP Source Address field in the IPv6 frames When
 *  Bit 0 _L3PEN0_ and Bit 4 _L3DAM0_ are set in Register 256 _Layer 3 and Layer 4
 *  Control Register 0_, this field contains the value to be matched with Bits [127:96]
 *  of the IP Destination Address field in the IPv6 frames When Bit 0 _L3PEN0_ is reset
 *  in Register 256 _Layer 3 and Layer 4 Control Register 0_, this register is not used
 */
#define GMAC_L3A30    0xFFFFFFFFU
#define GMAC_L3A30_M  (GMAC_L3A30_V << GMAC_L3A30_S)
#define GMAC_L3A30_V  0xFFFFFFFFU
#define GMAC_L3A30_S  0

/** GMAC_REGISTER320_HASHTABLEREGISTER0_REG register
 *  This register contains the first 32 bits of the hash table when the width of the
 *  Hash table is 128 bits or 256 bits
 */
#define GMAC_REGISTER320_HASHTABLEREGISTER0_REG (DR_REG_GMAC_BASE + 0x500)
/** GMAC_HT31T0 : R/W; bitpos: [31:0]; default: 0;
 *  First 32 bits of Hash Table This field contains the first 32 Bits _31:0_ of the
 *  Hash table Note Registers 321 through 327 are similar to Register 320 _Hash Table
 *  Register 0_ Registers 324 through 327 are present only when you select the 256bit
 *  Hash table during core configuration
 */
#define GMAC_HT31T0    0xFFFFFFFFU
#define GMAC_HT31T0_M  (GMAC_HT31T0_V << GMAC_HT31T0_S)
#define GMAC_HT31T0_V  0xFFFFFFFFU
#define GMAC_HT31T0_S  0

/** GMAC_REGISTER353_VLANTAGINCLUSIONORREPLACEMENTREGISTER_REG register
 *  This register contains the VLAN tag for insertion into or replacement in the
 *  transmit frames
 */
#define GMAC_REGISTER353_VLANTAGINCLUSIONORREPLACEMENTREGISTER_REG (DR_REG_GMAC_BASE + 0x584)
/** GMAC_VLT : R/W; bitpos: [15:0]; default: 0;
 *  VLAN Tag for Transmit Frames This field contains the value of the VLAN tag to be
 *  inserted or replaced The value must only be changed when the transmit lines are
 *  inactive or during the initialization phase Bits[15:13] are the User Priority, Bit
 *  12 is the CFI/DEI, and Bits[11:0] are the VLAN tag’s VID field
 */
#define GMAC_VLT    0x0000FFFFU
#define GMAC_VLT_M  (GMAC_VLT_V << GMAC_VLT_S)
#define GMAC_VLT_V  0x0000FFFFU
#define GMAC_VLT_S  0
/** GMAC_VLC : R/W; bitpos: [17:16]; default: 0;
 *  VLAN Tag Control in Transmit Frames 2’b00: No VLAN tag deletion, insertion, or
 *  replacement 2’b01: VLAN tag deletion The MAC removes the VLAN type _bytes 13 and
 *  14_ and VLAN tag _bytes 15 and 16_ of all transmitted frames with VLAN tags 2’b10:
 *  VLAN tag insertion The MAC inserts VLT in bytes 15 and 16 of the frame after
 *  inserting the Type value _0x8100/0x88a8_ in bytes 13 and 14 This operation is
 *  performed on all transmitted frames, irrespective of whether they already have a
 *  VLAN tag 2’b11: VLAN tag replacement The MAC replaces VLT in bytes 15 and 16 of all
 *  VLANtype transmitted frames _Bytes 13 and 14 are 0x8100/0x88a8_ Note: Changes to
 *  this field take effect only on the start of a frame If you write this register
 *  field when a frame is being transmitted, only the subsequent frame can use the
 *  updated value, that is, the current frame does not use the updated value
 */
#define GMAC_VLC    0x00000003U
#define GMAC_VLC_M  (GMAC_VLC_V << GMAC_VLC_S)
#define GMAC_VLC_V  0x00000003U
#define GMAC_VLC_S  16
/** GMAC_VLP : R/W; bitpos: [18]; default: 0;
 *  VLAN Priority Control When this bit is set, the control Bits [17:16] are used for
 *  VLAN deletion, insertion, or replacement When this bit is reset, the
 *  mti_vlan_ctrl_i control input is used, and Bits [17:16] are ignored
 */
#define GMAC_VLP    (BIT(18))
#define GMAC_VLP_M  (GMAC_VLP_V << GMAC_VLP_S)
#define GMAC_VLP_V  0x00000001U
#define GMAC_VLP_S  18
/** GMAC_CSVL : R/W; bitpos: [19]; default: 0;
 *  CVLAN or SVLAN When this bit is set, SVLAN type _0x88A8_ is inserted or replaced in
 *  the 13th and 14th bytes of transmitted frames When this bit is reset, CVLAN type
 *  _0x8100_ is inserted or replaced in the transmitted frames
 */
#define GMAC_CSVL    (BIT(19))
#define GMAC_CSVL_M  (GMAC_CSVL_V << GMAC_CSVL_S)
#define GMAC_CSVL_V  0x00000001U
#define GMAC_CSVL_S  19

/** GMAC_REGISTER354_VLANHASHTABLEREGISTER_REG register
 *  This register contains the VLAN hash table
 */
#define GMAC_REGISTER354_VLANHASHTABLEREGISTER_REG (DR_REG_GMAC_BASE + 0x588)
/** GMAC_VLHT : R/W; bitpos: [15:0]; default: 0;
 *  VLAN Hash Table This field contains the 16bit VLAN Hash Table
 */
#define GMAC_VLHT    0x0000FFFFU
#define GMAC_VLHT_M  (GMAC_VLHT_V << GMAC_VLHT_S)
#define GMAC_VLHT_V  0x0000FFFFU
#define GMAC_VLHT_S  0

