espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER448_TIMESTAMPCONTROLREGISTER_REG register
 *  Controls the timestamp generation and update logic This register is present only
 *  when IEEE1588 timestamping is enabled during coreConsultant configuration
 */
#define GMAC_REGISTER448_TIMESTAMPCONTROLREGISTER_REG (DR_REG_GMAC_BASE + 0x700)
/** GMAC_TSENA : R/W; bitpos: [0]; default: 0;
 *  Timestamp Enable When set, the timestamp is added for the transmit and receive
 *  frames When disabled, timestamp is not added for the transmit and receive frames
 *  and the Timestamp Generator is also suspended You need to initialize the Timestamp
 *  _system time_ after enabling this mode On the receive side, the MAC processes the
 *  1588 frames only if this bit is set
 */
#define GMAC_TSENA    (BIT(0))
#define GMAC_TSENA_M  (GMAC_TSENA_V << GMAC_TSENA_S)
#define GMAC_TSENA_V  0x00000001U
#define GMAC_TSENA_S  0
/** GMAC_TSCFUPDT : R/W; bitpos: [1]; default: 0;
 *  Timestamp Fine or Coarse Update When set, this bit indicates that the system times
 *  update should be done using the fine update method When reset, it indicates the
 *  system timestamp update should be done using the Coarse method
 */
#define GMAC_TSCFUPDT    (BIT(1))
#define GMAC_TSCFUPDT_M  (GMAC_TSCFUPDT_V << GMAC_TSCFUPDT_S)
#define GMAC_TSCFUPDT_V  0x00000001U
#define GMAC_TSCFUPDT_S  1
/** GMAC_TSINIT : R/W1S; bitpos: [2]; default: 0;
 *  Timestamp Initialize When set, the system time is initialized _overwritten_ with
 *  the value specified in the Register 452 _System Time  Seconds Update Register_ and
 *  Register 453 _System Time  Nanoseconds Update Register_ This bit should be read
 *  zero before updating it This bit is reset when the initialization is complete The
 *  “Timestamp Higher Word” register _if enabled during core configuration_ can only be
 *  initialized
 */
#define GMAC_TSINIT    (BIT(2))
#define GMAC_TSINIT_M  (GMAC_TSINIT_V << GMAC_TSINIT_S)
#define GMAC_TSINIT_V  0x00000001U
#define GMAC_TSINIT_S  2
/** GMAC_TSUPDT : R/W1S; bitpos: [3]; default: 0;
 *  Timestamp Update When set, the system time is updated _added or subtracted_ with
 *  the value specified in Register 452 _System Time  Seconds Update Register_ and
 *  Register 453 _System Time  Nanoseconds Update Register_ This bit should be read
 *  zero before updating it This bit is reset when the update is completed in hardware
 *  The “Timestamp Higher Word” register _if enabled during core configuration_ is not
 *  updated
 */
#define GMAC_TSUPDT    (BIT(3))
#define GMAC_TSUPDT_M  (GMAC_TSUPDT_V << GMAC_TSUPDT_S)
#define GMAC_TSUPDT_V  0x00000001U
#define GMAC_TSUPDT_S  3
/** GMAC_TSTRIG : R/W1S; bitpos: [4]; default: 0;
 *  Timestamp Interrupt Trigger Enable When set, the timestamp interrupt is generated
 *  when the System Time becomes greater than the value written in the Target Time
 *  register This bit is reset after the generation of the Timestamp Trigger Interrupt
 */
#define GMAC_TSTRIG    (BIT(4))
#define GMAC_TSTRIG_M  (GMAC_TSTRIG_V << GMAC_TSTRIG_S)
#define GMAC_TSTRIG_V  0x00000001U
#define GMAC_TSTRIG_S  4
/** GMAC_TSADDREG : R/W1S; bitpos: [5]; default: 0;
 *  Addend Reg Update When set, the content of the Timestamp Addend register is updated
 *  in the PTP block for fine correction This is cleared when the update is completed
 *  This register bit should be zero before setting it
 */
#define GMAC_TSADDREG    (BIT(5))
#define GMAC_TSADDREG_M  (GMAC_TSADDREG_V << GMAC_TSADDREG_S)
#define GMAC_TSADDREG_V  0x00000001U
#define GMAC_TSADDREG_S  5
/** GMAC_TSENALL : R/W; bitpos: [8]; default: 0;
 *  Enable Timestamp for All Frames When set, the timestamp snapshot is enabled for all
 *  frames received by the MAC
 */
#define GMAC_TSENALL    (BIT(8))
#define GMAC_TSENALL_M  (GMAC_TSENALL_V << GMAC_TSENALL_S)
#define GMAC_TSENALL_V  0x00000001U
#define GMAC_TSENALL_S  8
/** GMAC_TSCTRLSSR : R/W; bitpos: [9]; default: 0;
 *  Timestamp Digital or Binary Rollover Control When set, the Timestamp Low register
 *  rolls over after 0x3B9A_C9FF value _that is, 1 nanosecond accuracy_ and increments
 *  the timestamp _High_ seconds When reset, the rollover value of subsecond register
 *  is 0x7FFF_FFFF The subsecond increment has to be programmed correctly depending on
 *  the PTP reference clock frequency and the value of this bit
 */
#define GMAC_TSCTRLSSR    (BIT(9))
#define GMAC_TSCTRLSSR_M  (GMAC_TSCTRLSSR_V << GMAC_TSCTRLSSR_S)
#define GMAC_TSCTRLSSR_V  0x00000001U
#define GMAC_TSCTRLSSR_S  9
/** GMAC_TSVER2ENA : R/W; bitpos: [10]; default: 0;
 *  Enable PTP packet Processing for Version 2 Format When set, the PTP packets are
 *  processed using the 1588 version 2 format Otherwise, the PTP packets are processed
 *  using the version 1 format The IEEE 1588 Version 1 and Version 2 format are
 *  described in “PTP Processing and Control” on page 155
 */
#define GMAC_TSVER2ENA    (BIT(10))
#define GMAC_TSVER2ENA_M  (GMAC_TSVER2ENA_V << GMAC_TSVER2ENA_S)
#define GMAC_TSVER2ENA_V  0x00000001U
#define GMAC_TSVER2ENA_S  10
/** GMAC_TSIPENA : R/W; bitpos: [11]; default: 0;
 *  Enable Processing of PTP over Ethernet Frames When set, the MAC receiver processes
 *  the PTP packets encapsulated directly in the Ethernet frames When this bit is
 *  clear, the MAC ignores the PTP over Ethernet packets
 */
#define GMAC_TSIPENA    (BIT(11))
#define GMAC_TSIPENA_M  (GMAC_TSIPENA_V << GMAC_TSIPENA_S)
#define GMAC_TSIPENA_V  0x00000001U
#define GMAC_TSIPENA_S  11
/** GMAC_TSIPV6ENA : R/W; bitpos: [12]; default: 0;
 *  Enable Processing of PTP Frames Sent over IPv6UDP When set, the MAC receiver
 *  processes PTP packets encapsulated in UDP over IPv6 packets When this bit is clear,
 *  the MAC ignores the PTP transported over UDPIPv6 packets
 */
#define GMAC_TSIPV6ENA    (BIT(12))
#define GMAC_TSIPV6ENA_M  (GMAC_TSIPV6ENA_V << GMAC_TSIPV6ENA_S)
#define GMAC_TSIPV6ENA_V  0x00000001U
#define GMAC_TSIPV6ENA_S  12
/** GMAC_TSIPV4ENA : R/W; bitpos: [13]; default: 1;
 *  Enable Processing of PTP Frames Sent over IPv4UDP When set, the MAC receiver
 *  processes the PTP packets encapsulated in UDP over IPv4 packets When this bit is
 *  clear, the MAC ignores the PTP transported over UDPIPv4 packets This bit is set by
 *  default
 */
#define GMAC_TSIPV4ENA    (BIT(13))
#define GMAC_TSIPV4ENA_M  (GMAC_TSIPV4ENA_V << GMAC_TSIPV4ENA_S)
#define GMAC_TSIPV4ENA_V  0x00000001U
#define GMAC_TSIPV4ENA_S  13
/** GMAC_TSEVNTENA : R/W; bitpos: [14]; default: 0;
 *  Enable Timestamp Snapshot for Event Messages When set, the timestamp snapshot is
 *  taken only for event messages _SYNC, Delay_Req, Pdelay_Req, or Pdelay_Resp_ When
 *  reset, the snapshot is taken for all messages except Announce, Management, and
 *  Signaling For more information about the timestamp snapshots, see Table 670 on page
 *  462
 */
#define GMAC_TSEVNTENA    (BIT(14))
#define GMAC_TSEVNTENA_M  (GMAC_TSEVNTENA_V << GMAC_TSEVNTENA_S)
#define GMAC_TSEVNTENA_V  0x00000001U
#define GMAC_TSEVNTENA_S  14
/** GMAC_TSMSTRENA : R/W; bitpos: [15]; default: 0;
 *  Enable Snapshot for Messages Relevant to Master When set, the snapshot is taken
 *  only for the messages relevant to the master node Otherwise, the snapshot is taken
 *  for the messages relevant to the slave node
 */
#define GMAC_TSMSTRENA    (BIT(15))
#define GMAC_TSMSTRENA_M  (GMAC_TSMSTRENA_V << GMAC_TSMSTRENA_S)
#define GMAC_TSMSTRENA_V  0x00000001U
#define GMAC_TSMSTRENA_S  15
/** GMAC_SNAPTYPSEL : R/W; bitpos: [17:16]; default: 0;
 *  Select PTP packets for Taking Snapshots These bits along with Bits 15 and 14 decide
 *  the set of PTP packet types for which snapshot needs to be taken The encoding is
 *  given in Table 670 on page 462
 */
#define GMAC_SNAPTYPSEL    0x00000003U
#define GMAC_SNAPTYPSEL_M  (GMAC_SNAPTYPSEL_V << GMAC_SNAPTYPSEL_S)
#define GMAC_SNAPTYPSEL_V  0x00000003U
#define GMAC_SNAPTYPSEL_S  16
/** GMAC_TSENMACADDR : R/W; bitpos: [18]; default: 0;
 *  Enable MAC address for PTP Frame Filtering When set, the DA MAC address _that
 *  matches any MAC Address register_ is used to filter the PTP frames when PTP is
 *  directly sent over Ethernet
 */
#define GMAC_TSENMACADDR    (BIT(18))
#define GMAC_TSENMACADDR_M  (GMAC_TSENMACADDR_V << GMAC_TSENMACADDR_S)
#define GMAC_TSENMACADDR_V  0x00000001U
#define GMAC_TSENMACADDR_S  18
/** GMAC_ATSFC : R/W1S; bitpos: [24]; default: 0;
 *  Auxiliary Snapshot FIFO Clear When set, it resets the pointers of the Auxiliary
 *  Snapshot FIFO This bit is cleared when the pointers are reset and the FIFO is empty
 *  When this bit is high, auxiliary snapshots get stored in the FIFO This bit is
 *  reserved when the Add IEEE 1588 Auxiliary Snapshot option is not selected during
 *  core configuration
 */
#define GMAC_ATSFC    (BIT(24))
#define GMAC_ATSFC_M  (GMAC_ATSFC_V << GMAC_ATSFC_S)
#define GMAC_ATSFC_V  0x00000001U
#define GMAC_ATSFC_S  24
/** GMAC_ATSEN0 : R/W; bitpos: [25]; default: 0;
 *  Auxiliary Snapshot 0 Enable This field controls capturing the Auxiliary Snapshot
 *  Trigger 0 When this bit is set, the Auxiliary snapshot of event on
 *  ptp_aux_trig_i[0] input is enabled When this bit is reset, the events on this input
 *  are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option
 *  is not selected during core configuration
 */
#define GMAC_ATSEN0    (BIT(25))
#define GMAC_ATSEN0_M  (GMAC_ATSEN0_V << GMAC_ATSEN0_S)
#define GMAC_ATSEN0_V  0x00000001U
#define GMAC_ATSEN0_S  25
/** GMAC_ATSEN1 : R/W; bitpos: [26]; default: 0;
 *  Auxiliary Snapshot 1 Enable This field controls capturing the Auxiliary Snapshot
 *  Trigger 1 When this bit is set, the Auxiliary snapshot of event on
 *  ptp_aux_trig_i[1] input is enabled When this bit is reset, the events on this input
 *  are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option
 *  is not selected during core configuration or the selected number in the Number of
 *  IEEE 1588 Auxiliary Snapshot Inputs option is less than two
 */
#define GMAC_ATSEN1    (BIT(26))
#define GMAC_ATSEN1_M  (GMAC_ATSEN1_V << GMAC_ATSEN1_S)
#define GMAC_ATSEN1_V  0x00000001U
#define GMAC_ATSEN1_S  26
/** GMAC_ATSEN2 : R/W; bitpos: [27]; default: 0;
 *  Auxiliary Snapshot 2 Enable This field controls capturing the Auxiliary Snapshot
 *  Trigger 2 When this bit is set, the Auxiliary snapshot of event on
 *  ptp_aux_trig_i[2] input is enabled When this bit is reset, the events on this input
 *  are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option
 *  is not selected during core configuration or the selected number in the Number of
 *  IEEE 1588 Auxiliary Snapshot Inputs option is less than three
 */
#define GMAC_ATSEN2    (BIT(27))
#define GMAC_ATSEN2_M  (GMAC_ATSEN2_V << GMAC_ATSEN2_S)
#define GMAC_ATSEN2_V  0x00000001U
#define GMAC_ATSEN2_S  27
/** GMAC_ATSEN3 : R/W; bitpos: [28]; default: 0;
 *  Auxiliary Snapshot 3 Enable This field controls capturing the Auxiliary Snapshot
 *  Trigger 3 When this bit is set, the Auxiliary snapshot of event on
 *  ptp_aux_trig_i[3] input is enabled When this bit is reset, the events on this input
 *  are ignored This bit is reserved when the Add IEEE 1588 Auxiliary Snapshot option
 *  is not selected during core configuration or the selected number in the Number of
 *  IEEE 1588 Auxiliary Snapshot Inputs option is less than four
 */
#define GMAC_ATSEN3    (BIT(28))
#define GMAC_ATSEN3_M  (GMAC_ATSEN3_V << GMAC_ATSEN3_S)
#define GMAC_ATSEN3_V  0x00000001U
#define GMAC_ATSEN3_S  28

/** GMAC_REGISTER449_SUBSECONDINCREMENTREGISTER_REG register
 *  Contains the 8bit value by which the SubSecond register is incremented This
 *  register is present only when IEEE1588 timestamping is enabled without an external
 *  timestamp input
 */
#define GMAC_REGISTER449_SUBSECONDINCREMENTREGISTER_REG (DR_REG_GMAC_BASE + 0x704)
/** GMAC_SSINC : R/W; bitpos: [7:0]; default: 0;
 *  Subsecond Increment Value The value programmed in this field is accumulated every
 *  clock cycle _of clk_ptp_i_ with the contents of the subsecond register For example,
 *  when PTP clock is 50 MHz _period is 20 ns_, you should program 20 _0x14_ when the
 *  System Time Nanoseconds register has an accuracy of 1 ns [Bit 9 _TSCTRLSSR_ is set
 *  in Register 448 _Timestamp Control Register_] When TSCTRLSSR is clear, the
 *  Nanoseconds register has a resolution of ~0465ns In this case, you should program a
 *  value of 43 _0x2B_ that is derived by 20ns/0465
 */
#define GMAC_SSINC    0x000000FFU
#define GMAC_SSINC_M  (GMAC_SSINC_V << GMAC_SSINC_S)
#define GMAC_SSINC_V  0x000000FFU
#define GMAC_SSINC_S  0

/** GMAC_REGISTER450_SYSTEMTIMESECONDSREGISTER_REG register
 *  Contains the lower 32 bits of the seconds field of the system time This register is
 *  present only when IEEE1588 timestamping is enabled without an external timestamp
 *  input
 */
#define GMAC_REGISTER450_SYSTEMTIMESECONDSREGISTER_REG (DR_REG_GMAC_BASE + 0x708)
/** GMAC_TSS_RO : RO; bitpos: [31:0]; default: 0;
 *  Timestamp Second The value in this field indicates the current value in seconds of
 *  the System Time maintained by the MAC
 */
#define GMAC_TSS_RO    0xFFFFFFFFU
#define GMAC_TSS_RO_M  (GMAC_TSS_RO_V << GMAC_TSS_RO_S)
#define GMAC_TSS_RO_V  0xFFFFFFFFU
#define GMAC_TSS_RO_S  0

/** GMAC_REGISTER451_SYSTEMTIMENANOSECONDSREGISTER_REG register
 *  Contains 32 bits of the nanoseconds field of the system time This register is only
 *  present when IEEE1588 timestamping is enabled without an external timestamp input
 */
#define GMAC_REGISTER451_SYSTEMTIMENANOSECONDSREGISTER_REG (DR_REG_GMAC_BASE + 0x70c)
/** GMAC_TSSS_RO : RO; bitpos: [30:0]; default: 0;
 *  Timestamp Sub Seconds The value in this field has the sub second representation of
 *  time, with an accuracy of 046 ns When Bit 9 _TSCTRLSSR_ is set in Register 448
 *  _Timestamp Control Register_, each bit represents 1 ns and the maximum value is
 *  0x3B9A_C9FF, after which it rollsover to zero
 */
#define GMAC_TSSS_RO    0x7FFFFFFFU
#define GMAC_TSSS_RO_M  (GMAC_TSSS_RO_V << GMAC_TSSS_RO_S)
#define GMAC_TSSS_RO_V  0x7FFFFFFFU
#define GMAC_TSSS_RO_S  0

/** GMAC_REGISTER452_SYSTEMTIMESECONDSUPDATEREGISTER_REG register
 *  Contains the lower 32 bits of the seconds field to be written to, added to, or
 *  subtracted from the System Time value This register is only present when IEEE1588
 *  timestamping is enabled without an external timestamp input
 */
#define GMAC_REGISTER452_SYSTEMTIMESECONDSUPDATEREGISTER_REG (DR_REG_GMAC_BASE + 0x710)
/** GMAC_TSS : R/W; bitpos: [31:0]; default: 0;
 *  TIMESTAMP SECOND THE VALUE IN THIS FIELD INDICATES THE TIME IN SECONDS TO BE
 *  INITIALIZED OR ADDED TO THE SYSTEM TIME
 */
#define GMAC_TSS    0xFFFFFFFFU
#define GMAC_TSS_M  (GMAC_TSS_V << GMAC_TSS_S)
#define GMAC_TSS_V  0xFFFFFFFFU
#define GMAC_TSS_S  0

/** GMAC_REGISTER453_SYSTEMTIMENANOSECONDSUPDATEREGISTER_REG register
 *  Contains 32 bits of the nanoseconds field to be written to, added to, or subtracted
 *  from the System Time value This register is only present when IEEE1588 timestamping
 *  is enabled without an external timestamp input
 */
#define GMAC_REGISTER453_SYSTEMTIMENANOSECONDSUPDATEREGISTER_REG (DR_REG_GMAC_BASE + 0x714)
/** GMAC_TSSS : R/W; bitpos: [30:0]; default: 0;
 *  Timestamp Sub Seconds The value in this field has the sub second representation of
 *  time, with an accuracy of 046 ns When Bit 9 _TSCTRLSSR_ is set in Register 448
 *  _Timestamp Control Register_, each bit represents 1 ns and the programmed value
 *  should not exceed 0x3B9A_C9FF
 */
#define GMAC_TSSS    0x7FFFFFFFU
#define GMAC_TSSS_M  (GMAC_TSSS_V << GMAC_TSSS_S)
#define GMAC_TSSS_V  0x7FFFFFFFU
#define GMAC_TSSS_S  0
/** GMAC_ADDSUB : R/W; bitpos: [31]; default: 0;
 *  Add or Subtract Time When this bit is set, the time value is subtracted with the
 *  contents of the update register When this bit is reset, the time value is added
 *  with the contents of the update register
 */
#define GMAC_ADDSUB    (BIT(31))
#define GMAC_ADDSUB_M  (GMAC_ADDSUB_V << GMAC_ADDSUB_S)
#define GMAC_ADDSUB_V  0x00000001U
#define GMAC_ADDSUB_S  31

