espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER454_TIMESTAMPADDENDREGISTER_REG register
 *  This register is used by the software to readjust the clock frequency linearly to
 *  match the master clock frequency This register is only present when IEEE1588
 *  timestamping is enabled without an external timestamp input
 */
#define GMAC_REGISTER454_TIMESTAMPADDENDREGISTER_REG (DR_REG_GMAC_BASE + 0x718)
/** GMAC_TSAR : R/W; bitpos: [31:0]; default: 0;
 *  Timestamp Addend Register This field indicates the 32bit time value to be added to
 *  the Accumulator register to achieve time synchronization
 */
#define GMAC_TSAR    0xFFFFFFFFU
#define GMAC_TSAR_M  (GMAC_TSAR_V << GMAC_TSAR_S)
#define GMAC_TSAR_V  0xFFFFFFFFU
#define GMAC_TSAR_S  0

/** GMAC_REGISTER455_TARGETTIMESECONDSREGISTER_REG register
 *  Contains the higher 32 bits of time to be compared with the system time for
 *  interrupt event generation or to start the PPS signal output generation This
 *  register is present only when IEEE1588 timestamping is enabled without an external
 *  timestamp input
 */
#define GMAC_REGISTER455_TARGETTIMESECONDSREGISTER_REG (DR_REG_GMAC_BASE + 0x71c)
/** GMAC_TSTR : R/W; bitpos: [31:0]; default: 0;
 *  Target Time Seconds Register This register stores the time in seconds When the
 *  timestamp value matches or exceeds both Target Timestamp registers, then based on
 *  Bits [6:5] of Register 459 _PPS Control Register_, the MAC starts or stops the PPS
 *  signal output and generates an interrupt _if enabled_
 */
#define GMAC_TSTR    0xFFFFFFFFU
#define GMAC_TSTR_M  (GMAC_TSTR_V << GMAC_TSTR_S)
#define GMAC_TSTR_V  0xFFFFFFFFU
#define GMAC_TSTR_S  0

/** GMAC_REGISTER456_TARGETTIMENANOSECONDSREGISTER_REG register
 *  Contains the lower 32 bits of time to be compared with the system time for
 *  interrupt event generation or to start the PPS signal output generation This
 *  register is present only when IEEE1588 timestamping is enabled without an external
 *  timestamp input
 */
#define GMAC_REGISTER456_TARGETTIMENANOSECONDSREGISTER_REG (DR_REG_GMAC_BASE + 0x720)
/** GMAC_TTSLO : R/W; bitpos: [30:0]; default: 0;
 *  Target Timestamp Low Register This register stores the time in _signed_ nanoseconds
 *  When the value of the timestamp matches the both Target Timestamp registers, then
 *  based on the TRGTMODSEL0 field _Bits [6:5]_ in Register 459 _PPS Control Register_,
 *  the MAC starts or stops the PPS signal output and generates an interrupt _if
 *  enabled_ This value should not exceed 0x3B9A_C9FF when Bit 9 _TSCTRLSSR_ is set in
 *  Register 448 _Timestamp Control Register_ The actual start or stop time of the PPS
 *  signal output may have an error margin up to one unit of subsecond increment value
 */
#define GMAC_TTSLO    0x7FFFFFFFU
#define GMAC_TTSLO_M  (GMAC_TTSLO_V << GMAC_TTSLO_S)
#define GMAC_TTSLO_V  0x7FFFFFFFU
#define GMAC_TTSLO_S  0
/** GMAC_TRGTBUSY : R/W1S; bitpos: [31]; default: 0;
 *  Target Time Register Busy The MAC sets this bit when the PPSCMD field _Bit [3:0]_
 *  in Register 459 _PPS Control Register_ is programmed to 010 or 011 Programming the
 *  PPSCMD field to 010 or 011, instructs the MAC to synchronize the Target Time
 *  Registers to the PTP clock domain The MAC clears this bit after synchronizing the
 *  Target Time Registers to the PTP clock domain The application must not update the
 *  Target Time Registers when this bit is read as 1 Otherwise, the synchronization of
 *  the previous programmed time gets corrupted This bit is reserved when the Enable
 *  Flexible PulsePerSecond Output feature is not selected
 */
#define GMAC_TRGTBUSY    (BIT(31))
#define GMAC_TRGTBUSY_M  (GMAC_TRGTBUSY_V << GMAC_TRGTBUSY_S)
#define GMAC_TRGTBUSY_V  0x00000001U
#define GMAC_TRGTBUSY_S  31

/** GMAC_REGISTER457_SYSTEMTIMEHIGHERWORDSECONDSREGISTER_REG register
 *  Contains the most significant 16bits of the timestamp seconds value This register
 *  is optional and can be selected using the parameter mentioned in “IEEE 1588
 *  Timestamp Block” on page 492
 */
#define GMAC_REGISTER457_SYSTEMTIMEHIGHERWORDSECONDSREGISTER_REG (DR_REG_GMAC_BASE + 0x724)
/** GMAC_TSHWR : R/W; bitpos: [15:0]; default: 0;
 *  Timestamp Higher Word Register This field contains the most significant 16bits of
 *  the timestamp seconds value This register is optional and can be selected using the
 *  Enable IEEE 1588 Higher Word Register option during core configuration The register
 *  is directly written to initialize the value This register is incremented when there
 *  is an overflow from the 32bits of the System Time  Seconds register
 */
#define GMAC_TSHWR    0x0000FFFFU
#define GMAC_TSHWR_M  (GMAC_TSHWR_V << GMAC_TSHWR_S)
#define GMAC_TSHWR_V  0x0000FFFFU
#define GMAC_TSHWR_S  0

/** GMAC_REGISTER458_TIMESTAMPSTATUSREGISTER_REG register
 *  Contains the PTP status This register is available only when the advanced IEEE 1588
 *  timestamp feature is selected
 */
#define GMAC_REGISTER458_TIMESTAMPSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x728)
/** GMAC_TSSOVF : R/W; bitpos: [0]; default: 0;
 *  Timestamp Seconds Overflow When set, this bit indicates that the seconds value of
 *  the timestamp _when supporting version 2 format_ has overflowed beyond 32’hFFFF_FFFF
 */
#define GMAC_TSSOVF    (BIT(0))
#define GMAC_TSSOVF_M  (GMAC_TSSOVF_V << GMAC_TSSOVF_S)
#define GMAC_TSSOVF_V  0x00000001U
#define GMAC_TSSOVF_S  0
/** GMAC_TSTARGT : R/W; bitpos: [1]; default: 0;
 *  Timestamp Target Time Reached When set, this bit indicates that the value of system
 *  time is greater than or equal to the value specified in the Register 455 _Target
 *  Time Seconds Register_ and Register 456 _Target Time Nanoseconds Register_
 */
#define GMAC_TSTARGT    (BIT(1))
#define GMAC_TSTARGT_M  (GMAC_TSTARGT_V << GMAC_TSTARGT_S)
#define GMAC_TSTARGT_V  0x00000001U
#define GMAC_TSTARGT_S  1
/** GMAC_AUXTSTRIG : R/W; bitpos: [2]; default: 0;
 *  Auxiliary Timestamp Trigger Snapshot This bit is set high when the auxiliary
 *  snapshot is written to the FIFO This bit is valid only if the Enable IEEE 1588
 *  Auxiliary Snapshot feature is selected
 */
#define GMAC_AUXTSTRIG    (BIT(2))
#define GMAC_AUXTSTRIG_M  (GMAC_AUXTSTRIG_V << GMAC_AUXTSTRIG_S)
#define GMAC_AUXTSTRIG_V  0x00000001U
#define GMAC_AUXTSTRIG_S  2
/** GMAC_TSTRGTERR : R/W; bitpos: [3]; default: 0;
 *  Timestamp Target Time Error This bit is set when the target time, being programmed
 *  in Register 455 and Register 456, is already elapsed This bit is cleared when read
 *  by the application
 */
#define GMAC_TSTRGTERR    (BIT(3))
#define GMAC_TSTRGTERR_M  (GMAC_TSTRGTERR_V << GMAC_TSTRGTERR_S)
#define GMAC_TSTRGTERR_V  0x00000001U
#define GMAC_TSTRGTERR_S  3
/** GMAC_TSTARGT1 : R/W; bitpos: [4]; default: 0;
 *  Timestamp Target Time Reached for Target Time PPS1 When set, this bit indicates
 *  that the value of system time is greater than or equal to the value specified in
 *  Register 480 _PPS1 Target Time High Register_ and Register 481 _PPS1 Target Time
 *  Low Register_
 */
#define GMAC_TSTARGT1    (BIT(4))
#define GMAC_TSTARGT1_M  (GMAC_TSTARGT1_V << GMAC_TSTARGT1_S)
#define GMAC_TSTARGT1_V  0x00000001U
#define GMAC_TSTARGT1_S  4
/** GMAC_TSTRGTERR1 : R/W; bitpos: [5]; default: 0;
 *  Timestamp Target Time Error This bit is set when the target time, being programmed
 *  in Register 480 and Register 481, is already elapsed This bit is cleared when read
 *  by the application
 */
#define GMAC_TSTRGTERR1    (BIT(5))
#define GMAC_TSTRGTERR1_M  (GMAC_TSTRGTERR1_V << GMAC_TSTRGTERR1_S)
#define GMAC_TSTRGTERR1_V  0x00000001U
#define GMAC_TSTRGTERR1_S  5
/** GMAC_TSTARGT2 : R/W; bitpos: [6]; default: 0;
 *  Timestamp Target Time Reached for Target Time PPS2 When set, this bit indicates
 *  that the value of system time is greater than or equal to the value specified in
 *  Register 488 _PPS2 Target Time High Register_ and Register 489 _PPS2 Target Time
 *  Low Register_
 */
#define GMAC_TSTARGT2    (BIT(6))
#define GMAC_TSTARGT2_M  (GMAC_TSTARGT2_V << GMAC_TSTARGT2_S)
#define GMAC_TSTARGT2_V  0x00000001U
#define GMAC_TSTARGT2_S  6
/** GMAC_TSTRGTERR2 : R/W; bitpos: [7]; default: 0;
 *  Timestamp Target Time Error This bit is set when the target time, being programmed
 *  in Register 488 and Register 489, is already elapsed This bit is cleared when read
 *  by the application
 */
#define GMAC_TSTRGTERR2    (BIT(7))
#define GMAC_TSTRGTERR2_M  (GMAC_TSTRGTERR2_V << GMAC_TSTRGTERR2_S)
#define GMAC_TSTRGTERR2_V  0x00000001U
#define GMAC_TSTRGTERR2_S  7
/** GMAC_TSTARGT3 : R/W; bitpos: [8]; default: 0;
 *  Timestamp Target Time Reached for Target Time PPS3 When set, this bit indicates
 *  that the value of system time is greater than or equal to the value specified in
 *  Register 496 _PPS3 Target Time High Register_ and Register 497 _PPS3 Target Time
 *  Low Register_
 */
#define GMAC_TSTARGT3    (BIT(8))
#define GMAC_TSTARGT3_M  (GMAC_TSTARGT3_V << GMAC_TSTARGT3_S)
#define GMAC_TSTARGT3_V  0x00000001U
#define GMAC_TSTARGT3_S  8
/** GMAC_TSTRGTERR3 : R/W; bitpos: [9]; default: 0;
 *  Timestamp Target Time Error This bit is set when the target time, being programmed
 *  in Register 496 and Register 497, is already elapsed This bit is cleared when read
 *  by the application
 */
#define GMAC_TSTRGTERR3    (BIT(9))
#define GMAC_TSTRGTERR3_M  (GMAC_TSTRGTERR3_V << GMAC_TSTRGTERR3_S)
#define GMAC_TSTRGTERR3_V  0x00000001U
#define GMAC_TSTRGTERR3_S  9
/** GMAC_ATSSTN : R/W; bitpos: [19:16]; default: 0;
 *  Auxiliary Timestamp Snapshot Trigger Identifier These bits identify the Auxiliary
 *  trigger inputs for which the timestamp available in the Auxiliary Snapshot Register
 *  is applicable When more than one bit is set at the same time, it means that
 *  corresponding auxiliary triggers were sampled at the same clock These bits are
 *  applicable only if the number of Auxiliary snapshots is more than one One bit is
 *  assigned for each trigger as shown in the following list: Bit 16: Auxiliary trigger
 *  0 Bit 17: Auxiliary trigger 1 Bit 18: Auxiliary trigger 2 Bit 19: Auxiliary trigger
 *  3 The software can read this register to find the triggers that are set when the
 *  timestamp is taken
 */
#define GMAC_ATSSTN    0x0000000FU
#define GMAC_ATSSTN_M  (GMAC_ATSSTN_V << GMAC_ATSSTN_S)
#define GMAC_ATSSTN_V  0x0000000FU
#define GMAC_ATSSTN_S  16
/** GMAC_ATSSTM : RO; bitpos: [24]; default: 0;
 *  Auxiliary Timestamp Snapshot Trigger Missed
 */
#define GMAC_ATSSTM    (BIT(24))
#define GMAC_ATSSTM_M  (GMAC_ATSSTM_V << GMAC_ATSSTM_S)
#define GMAC_ATSSTM_V  0x00000001U
#define GMAC_ATSSTM_S  24
/** GMAC_ATSNS : RO; bitpos: [29:25]; default: 0;
 *  Number of Auxiliary Timestamp Snapshots This field indicates the number of
 *  Snapshots available in the FIFO A value equal to the selected depth of FIFO _4, 8,
 *  or 16_ indicates that the Auxiliary Snapshot FIFO is full These bits are cleared
 *  _to 00000_ when the Auxiliary snapshot FIFO clear bit is set This bit is valid only
 *  if the Add IEEE 1588 Auxiliary Snapshot option is selected during core configuration
 */
#define GMAC_ATSNS    0x0000001FU
#define GMAC_ATSNS_M  (GMAC_ATSNS_V << GMAC_ATSNS_S)
#define GMAC_ATSNS_V  0x0000001FU
#define GMAC_ATSNS_S  25

/** GMAC_REGISTER459_PPSCONTROLREGISTER_REG register
 *  This register is used to control the interval of the PPS signal output This
 *  register is available only when the advanced IEEE 1588 timestamp feature is selected
 */
#define GMAC_REGISTER459_PPSCONTROLREGISTER_REG (DR_REG_GMAC_BASE + 0x72c)
/** GMAC_PPSCTRL0 : R/W1S; bitpos: [3:0]; default: 0;
 *  PPSCTRL0: PPS0 Output Frequency Control This field controls the frequency of the
 *  PPS0 output _ptp_pps_o[0]_ signal The default value of PPSCTRL is 0000, and the PPS
 *  output is 1 pulse _of width clk_ptp_i_ every second For other values of PPSCTRL,
 *  the PPS output becomes a generated clock of following frequencies: 0001: The binary
 *  rollover is 2 Hz, and the digital rollover is 1 Hz 0010: The binary rollover is 4
 *  Hz, and the digital rollover is 2 Hz 0011: The binary rollover is 8 Hz, and the
 *  digital rollover is 4 Hz 0100: The binary rollover is 16 Hz, and the digital
 *  rollover is 8 Hz  1111: The binary rollover is 32768 KHz, and the digital rollover
 *  is 16384 KHz Note: In the binary rollover mode, the PPS output _ptp_pps_o_ has a
 *  duty cycle of 50 percent with these frequencies In the digital rollover mode, the
 *  PPS output frequency is an average number The actual clock is of different
 *  frequency that gets synchronized every second For example: When PPSCTRL = 0001, the
 *  PPS _1 Hz_ has a low period of 537 ms and a high period of 463 ms When PPSCTRL =
 *  0010, the PPS _2 Hz_ is a sequence of: 	One clock of 50 percent duty cycle and 537
 *  ms period 	Second clock of 463 ms period _268 ms low and 195 ms high_ When PPSCTRL
 *  = 0011, the PPS _4 Hz_ is a sequence of: 	Three clocks of 50 percent duty cycle and
 *  268 ms period 	Fourth clock of 195 ms period _134 ms low and 61 ms high_ This
 *  behavior is because of the nonlinear toggling of bits in the digital rollover mode
 *  in Register 451 _System Time  Nanoseconds Register_ / PPSCMD0: Flexible PPS0 Output
 *  _ptp_pps_o[0]_ Control Programming these bits with a nonzero value instructs the
 *  MAC to initiate an event When the command is transferred or synchronized to the PTP
 *  clock domain, these bits get cleared automatically The Software should ensure that
 *  these bits are programmed only when they are “allzero” The following list describes
 *  the values of PPSCMD0: 0000: No Command 0001: START Single Pulse This command
 *  generates single pulse rising at the start point defined in Target Time Registers
 *  _register 455 and 456_ and of a duration defined in the PPS0 Width Register 0010:
 *  START Pulse Train This command generates the train of pulses rising at the start
 *  point defined in the Target Time Registers and of a duration defined in the PPS0
 *  Width Register and repeated at interval defined in the PPS Interval Register By
 *  default, the PPS pulse train is freerunning unless stopped by 'STOP Pulse train at
 *  time' or 'STOP Pulse Train immediately' commands 0011: Cancel START This command
 *  cancels the START Single Pulse and START Pulse Train commands if the system time
 *  has not crossed the programmed start time 0100: STOP Pulse train at time This
 *  command stops the train of pulses initiated by the START Pulse Train command
 *  _PPSCMD = 0010_ after the time programmed in the Target Time registers elapses
 *  0101: STOP Pulse Train immediately This command immediately stops the train of
 *  pulses initiated by the START Pulse Train command _PPSCMD = 0010_ 0110: Cancel STOP
 *  Pulse train This command cancels the STOP pulse train at time command if the
 *  programmed stop time has not elapsed The PPS pulse train becomes freerunning on the
 *  successful execution of this command 01111111: Reserved
 */
#define GMAC_PPSCTRL0    0x0000000FU
#define GMAC_PPSCTRL0_M  (GMAC_PPSCTRL0_V << GMAC_PPSCTRL0_S)
#define GMAC_PPSCTRL0_V  0x0000000FU
#define GMAC_PPSCTRL0_S  0
/** GMAC_PPSEN0 : R/W; bitpos: [4]; default: 0;
 *  Flexible PPS Output Mode Enable When set low, Bits [3:0] function as PPSCTRL
 *  _backward compatible_ When set high, Bits[3:0] function as PPSCMD
 */
#define GMAC_PPSEN0    (BIT(4))
#define GMAC_PPSEN0_M  (GMAC_PPSEN0_V << GMAC_PPSEN0_S)
#define GMAC_PPSEN0_V  0x00000001U
#define GMAC_PPSEN0_S  4
/** GMAC_TRGTMODSEL0 : R/W; bitpos: [6:5]; default: 0;
 *  Target Time Register Mode for PPS0 Output This field indicates the Target Time
 *  registers _register 455 and 456_ mode for PPS0 output signal: 00: Indicates that
 *  the Target Time registers are programmed only for generating the interrupt event
 *  01: Reserved 10: Indicates that the Target Time registers are programmed for
 *  generating the interrupt event and starting or stopping the generation of the PPS0
 *  output signal 11: Indicates that the Target Time registers are programmed only for
 *  starting or stopping the generation of the PPS0 output signal No interrupt is
 *  asserted
 */
#define GMAC_TRGTMODSEL0    0x00000003U
#define GMAC_TRGTMODSEL0_M  (GMAC_TRGTMODSEL0_V << GMAC_TRGTMODSEL0_S)
#define GMAC_TRGTMODSEL0_V  0x00000003U
#define GMAC_TRGTMODSEL0_S  5
/** GMAC_PPSCMD1 : R/W1S; bitpos: [10:8]; default: 0;
 *  Flexible PPS1 Output Control This field controls the flexible PPS1 output
 *  _ptp_pps_o[1]_ signal This field is similar to PPSCMD0[2:0] in functionality
 */
#define GMAC_PPSCMD1    0x00000007U
#define GMAC_PPSCMD1_M  (GMAC_PPSCMD1_V << GMAC_PPSCMD1_S)
#define GMAC_PPSCMD1_V  0x00000007U
#define GMAC_PPSCMD1_S  8
/** GMAC_TRGTMODSEL1 : R/W; bitpos: [14:13]; default: 0;
 *  Target Time Register Mode for PPS1 Output This field indicates the Target Time
 *  registers _register 480 and 481_ mode for PPS1 output signal This field is similar
 *  to the TRGTMODSEL0 field
 */
#define GMAC_TRGTMODSEL1    0x00000003U
#define GMAC_TRGTMODSEL1_M  (GMAC_TRGTMODSEL1_V << GMAC_TRGTMODSEL1_S)
#define GMAC_TRGTMODSEL1_V  0x00000003U
#define GMAC_TRGTMODSEL1_S  13
/** GMAC_PPSCMD2 : R/W1S; bitpos: [18:16]; default: 0;
 *  Flexible PPS2 Output Control This field controls the flexible PPS2 output
 *  _ptp_pps_o[2]_ signal This field is similar to PPSCMD0[2:0] in functionality
 */
#define GMAC_PPSCMD2    0x00000007U
#define GMAC_PPSCMD2_M  (GMAC_PPSCMD2_V << GMAC_PPSCMD2_S)
#define GMAC_PPSCMD2_V  0x00000007U
#define GMAC_PPSCMD2_S  16
/** GMAC_TRGTMODSEL2 : R/W; bitpos: [22:21]; default: 0;
 *  Target Time Register Mode for PPS2 Output This field indicates the Target Time
 *  registers _register 488 and 489_ mode for PPS2 output signal This field is similar
 *  to the TRGTMODSEL0 field
 */
#define GMAC_TRGTMODSEL2    0x00000003U
#define GMAC_TRGTMODSEL2_M  (GMAC_TRGTMODSEL2_V << GMAC_TRGTMODSEL2_S)
#define GMAC_TRGTMODSEL2_V  0x00000003U
#define GMAC_TRGTMODSEL2_S  21
/** GMAC_PPSCMD3 : R/W1S; bitpos: [26:24]; default: 0;
 *  Flexible PPS3 Output Control This field controls the flexible PPS3 output
 *  _ptp_pps_o[3]_ signal This field is similar to PPSCMD0[2:0] in functionality
 */
#define GMAC_PPSCMD3    0x00000007U
#define GMAC_PPSCMD3_M  (GMAC_PPSCMD3_V << GMAC_PPSCMD3_S)
#define GMAC_PPSCMD3_V  0x00000007U
#define GMAC_PPSCMD3_S  24
/** GMAC_TRGTMODSEL3 : R/W; bitpos: [30:29]; default: 0;
 *  Target Time Register Mode for PPS3 Output This field indicates the Target Time
 *  registers _register 496 and 497_ mode for PPS3 output signal This field is similar
 *  to the TRGTMODSEL0 field
 */
#define GMAC_TRGTMODSEL3    0x00000003U
#define GMAC_TRGTMODSEL3_M  (GMAC_TRGTMODSEL3_V << GMAC_TRGTMODSEL3_S)
#define GMAC_TRGTMODSEL3_V  0x00000003U
#define GMAC_TRGTMODSEL3_S  29

/** GMAC_REGISTER460_AUXILIARYTIMESTAMPNANOSECONDSREGISTER_REG register
 *  Contains the lower 32 bits _nanoseconds field_ of the auxiliary timestamp register
 */
#define GMAC_REGISTER460_AUXILIARYTIMESTAMPNANOSECONDSREGISTER_REG (DR_REG_GMAC_BASE + 0x730)
/** GMAC_AUXTSLO : RO; bitpos: [30:0]; default: 0;
 *  Contains the lower 31 bits _nanoseconds field_ of the auxiliary timestamp
 */
#define GMAC_AUXTSLO    0x7FFFFFFFU
#define GMAC_AUXTSLO_M  (GMAC_AUXTSLO_V << GMAC_AUXTSLO_S)
#define GMAC_AUXTSLO_V  0x7FFFFFFFU
#define GMAC_AUXTSLO_S  0

