espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER461_AUXILIARYTIMESTAMPSECONDSREGISTER_REG register
 *  Contains the lower 32 bits of the Seconds field of the auxiliary timestamp register
 */
#define GMAC_REGISTER461_AUXILIARYTIMESTAMPSECONDSREGISTER_REG (DR_REG_GMAC_BASE + 0x734)
/** GMAC_AUXTSHI : RO; bitpos: [31:0]; default: 0;
 *  Contains the lower 32 bits of the Seconds field of the auxiliary timestamp
 */
#define GMAC_AUXTSHI    0xFFFFFFFFU
#define GMAC_AUXTSHI_M  (GMAC_AUXTSHI_V << GMAC_AUXTSHI_S)
#define GMAC_AUXTSHI_V  0xFFFFFFFFU
#define GMAC_AUXTSHI_S  0

/** GMAC_REGISTER462_AVMACCONTROLREGISTER_REG register
 *  Controls the AV traffic and queue management in the MAC Receiver This register is
 *  present only when you select the AV feature in coreConsultant
 */
#define GMAC_REGISTER462_AVMACCONTROLREGISTER_REG (DR_REG_GMAC_BASE + 0x738)
/** GMAC_AVT : R/W; bitpos: [15:0]; default: 0;
 *  AV EtherType Value This field contains the value that is compared with the
 *  EtherType field of the incoming _tagged or untagged_ Ethernet frame to detect an AV
 *  packet
 */
#define GMAC_AVT    0x0000FFFFU
#define GMAC_AVT_M  (GMAC_AVT_V << GMAC_AVT_S)
#define GMAC_AVT_V  0x0000FFFFU
#define GMAC_AVT_S  0
/** GMAC_AVP : R/W; bitpos: [18:16]; default: 0;
 *  AV Priority for Queuing The value programmed in these bits control the receive
 *  channel _0, 1, or 2_ to which an AV packet with a given priority must be queued If
 *  only Channel 1 receive path is enabled, the AV packets with priority value greater
 *  than or equal to the programmed value are queued on Channel 1 and all other packets
 *  are queued on Channel 0 If Channel 2 receive path is also enabled, the AV packets
 *  with priority value greater than or equal to the programmed value are queued on
 *  Channel 2 The AV packets with value less than the programmed value on Channel 1 and
 *  all other packets are queued on Channel 0 These bits are applicable only if at
 *  least one additional receive channel is selected in the AV mode
 */
#define GMAC_AVP    0x00000007U
#define GMAC_AVP_M  (GMAC_AVP_V << GMAC_AVP_S)
#define GMAC_AVP_V  0x00000007U
#define GMAC_AVP_S  16
/** GMAC_VQE : R/W; bitpos: [19]; default: 0;
 *  VLAN Tagged NonAV Packets Queueing Enable When this bit is set, the MAC also queues
 *  nonAV VLAN tagged packets into the available channels according to the value of the
 *  AVP bits This bit is reserved and readonly if Channel 1 and Channel 2 Receive paths
 *  are not selected during core configuration
 */
#define GMAC_VQE    (BIT(19))
#define GMAC_VQE_M  (GMAC_VQE_V << GMAC_VQE_S)
#define GMAC_VQE_V  0x00000001U
#define GMAC_VQE_S  19
/** GMAC_AVCD : R/W; bitpos: [20]; default: 0;
 *  AV Channel Disable When this bit is set, the MAC forwards all packets to the
 *  default Channel 0 and the values programmed in the AVP, AVCH, and PTPCH fields are
 *  ignored This bit is reserved and readonly if Channel 1 or Channel 2 receive paths
 *  are not selected during core configuration
 */
#define GMAC_AVCD    (BIT(20))
#define GMAC_AVCD_M  (GMAC_AVCD_V << GMAC_AVCD_S)
#define GMAC_AVCD_V  0x00000001U
#define GMAC_AVCD_S  20
/** GMAC_AVCH : R/W; bitpos: [22:21]; default: 0;
 *  Channel for Queuing the AV Control Packets This field specifies the channel on
 *  which the received untagged AV control packets are queued 00: Channel 0 01: Channel
 *  1 10: Channel 2 11: Reserved These bits are reserved if the receive paths of
 *  Channel 1 or Channel 2 are not enabled
 */
#define GMAC_AVCH    0x00000003U
#define GMAC_AVCH_M  (GMAC_AVCH_V << GMAC_AVCH_S)
#define GMAC_AVCH_V  0x00000003U
#define GMAC_AVCH_S  21
/** GMAC_PTPCH : R/W; bitpos: [25:24]; default: 0;
 *  Channel for Queuing the PTP Packets This field specifies the channel on which the
 *  untagged PTP packets, sent over the Ethernet payload and not over IPv4 or IPv6, are
 *  queued 00: Channel 0 01: Channel 1 10: Channel 2 11: Reserved These bits are
 *  reserved if the receive paths of Channel 1 or Channel 2 are not enabled
 */
#define GMAC_PTPCH    0x00000003U
#define GMAC_PTPCH_M  (GMAC_PTPCH_V << GMAC_PTPCH_S)
#define GMAC_PTPCH_V  0x00000003U
#define GMAC_PTPCH_S  24

/** GMAC_REGISTER472_PPS0INTERVALREGISTER_REG register
 *  Contains the number of units of subsecond increment value between the rising edges
 *  of PPS0 signal output This register is available only when the flexible PPS feature
 *  is selected
 */
#define GMAC_REGISTER472_PPS0INTERVALREGISTER_REG (DR_REG_GMAC_BASE + 0x760)
/** GMAC_PPSINT : R/W; bitpos: [31:0]; default: 0;
 *  PPS0 Output Signal Interval These bits store the interval between the rising edges
 *  of PPS0 signal output in terms of units of subsecond increment value You need to
 *  program one value less than the required interval For example, if the PTP reference
 *  clock is 50 MHz _period of 20ns_, and desired interval between rising edges of PPS0
 *  signal output is 100ns _that is, five units of subsecond increment value_, then you
 *  should program value 4 _5  1_ in this register
 */
#define GMAC_PPSINT    0xFFFFFFFFU
#define GMAC_PPSINT_M  (GMAC_PPSINT_V << GMAC_PPSINT_S)
#define GMAC_PPSINT_V  0xFFFFFFFFU
#define GMAC_PPSINT_S  0

/** GMAC_REGISTER473_PPS0WIDTHREGISTER_REG register
 *  Contains the number of units of subsecond increment value between the rising and
 *  corresponding falling edges of PPS0 signal output This register is available only
 *  when the flexible PPS feature is selected
 */
#define GMAC_REGISTER473_PPS0WIDTHREGISTER_REG (DR_REG_GMAC_BASE + 0x764)
/** GMAC_PPSWIDTH : R/W; bitpos: [31:0]; default: 0;
 *  PPS0 Output Signal Width These bits store the width between the rising edge and
 *  corresponding falling edge of the PPS0 signal output in terms of units of subsecond
 *  increment value You need to program one value less than the required interval For
 *  example, if PTP reference clock is 50 MHz _period of 20ns_, and desired width
 *  between the rising and corresponding falling edges of PPS0 signal output is 80ns
 *  _that is, four units of subsecond increment value_, then you should program value 3
 *  _4  1_ in this register Note: The value programmed in this register must be lesser
 *  than the value programmed in Register 472 _PPS0 Interval Register_
 */
#define GMAC_PPSWIDTH    0xFFFFFFFFU
#define GMAC_PPSWIDTH_M  (GMAC_PPSWIDTH_V << GMAC_PPSWIDTH_S)
#define GMAC_PPSWIDTH_V  0xFFFFFFFFU
#define GMAC_PPSWIDTH_S  0

