espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER2_RECEIVEPOLLDEMANDREGISTER_REG register
 *  Used by the host to instruct the DMA to poll the Receive Descriptor list
 */
#define GMAC_REGISTER2_RECEIVEPOLLDEMANDREGISTER_REG (DR_REG_GMAC_BASE + 0x1008)
/** GMAC_RPD : RO; bitpos: [31:0]; default: 0;
 *  Receive Poll Demand When these bits are written with any value, the DMA reads the
 *  current descriptor to which the Register 19 _Current Host Receive Descriptor
 *  Register_ is pointing If that descriptor is not available _owned by the Host_, the
 *  reception returns to the Suspended state and Bit 7 _RU_ of Register 5 _Status
 *  Register_ is asserted If the descriptor is available, the Rx DMA returns to the
 *  active state
 */
#define GMAC_RPD    0xFFFFFFFFU
#define GMAC_RPD_M  (GMAC_RPD_V << GMAC_RPD_S)
#define GMAC_RPD_V  0xFFFFFFFFU
#define GMAC_RPD_S  0

/** GMAC_REGISTER3_RECEIVEDESCRIPTORLISTADDRESSREGISTER_REG register
 *  Points the DMA to the start of the Receive Descriptor list
 */
#define GMAC_REGISTER3_RECEIVEDESCRIPTORLISTADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x100c)
/** GMAC_RDESLA : R/W; bitpos: [31:0]; default: 0;
 *  Start of Receive List This field contains the base address of the first descriptor
 *  in the Receive Descriptor list The LSB bits _1:0, 2:0, or 3:0_ for 32bit, 64bit, or
 *  128bit bus width are ignored and internally taken as allzero by the DMA Therefore,
 *  these LSB bits are readonly _RO_
 */
#define GMAC_RDESLA    0xFFFFFFFFU
#define GMAC_RDESLA_M  (GMAC_RDESLA_V << GMAC_RDESLA_S)
#define GMAC_RDESLA_V  0xFFFFFFFFU
#define GMAC_RDESLA_S  0

/** GMAC_REGISTER4_TRANSMITDESCRIPTORLISTADDRESSREGISTER_REG register
 *  Points the DMA to the start of the Transmit Descriptor list
 */
#define GMAC_REGISTER4_TRANSMITDESCRIPTORLISTADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x1010)
/** GMAC_TDESLA : R/W; bitpos: [31:0]; default: 0;
 *  Start of Transmit List This field contains the base address of the first descriptor
 *  in the Transmit Descriptor list The LSB bits _1:0, 2:0, 3:0_ for 32bit, 64bit, or
 *  128bit bus width are ignored and are internally taken as allzero by the DMA
 *  Therefore, these LSB bits are readonly _RO_
 */
#define GMAC_TDESLA    0xFFFFFFFFU
#define GMAC_TDESLA_M  (GMAC_TDESLA_V << GMAC_TDESLA_S)
#define GMAC_TDESLA_V  0xFFFFFFFFU
#define GMAC_TDESLA_S  0

/** GMAC_REGISTER5_STATUSREGISTER_REG register
 *  The Software driver _application_ reads this register during interrupt service
 *  routine or polling to determine the status of the DMA
 */
#define GMAC_REGISTER5_STATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x1014)
/** GMAC_TI : R/W; bitpos: [0]; default: 0;
 *  Transmit Interrupt This bit indicates that the frame transmission is complete When
 *  transmission is complete, Bit 31 _OWN_ of TDES0 is reset, and the specific frame
 *  status information is updated in the descriptor
 */
#define GMAC_TI    (BIT(0))
#define GMAC_TI_M  (GMAC_TI_V << GMAC_TI_S)
#define GMAC_TI_V  0x00000001U
#define GMAC_TI_S  0
/** GMAC_TPS : R/W; bitpos: [1]; default: 0;
 *  Transmit Process Stopped This bit is set when the transmission is stopped
 */
#define GMAC_TPS    (BIT(1))
#define GMAC_TPS_M  (GMAC_TPS_V << GMAC_TPS_S)
#define GMAC_TPS_V  0x00000001U
#define GMAC_TPS_S  1
/** GMAC_TU : R/W; bitpos: [2]; default: 0;
 *  Transmit Buffer Unavailable This bit indicates that the host owns the Next
 *  Descriptor in the Transmit List and the DMA cannot acquire it Transmission is
 *  suspended Bits[22:20] explain the Transmit Process state transitions To resume
 *  processing Transmit descriptors, the host should change the ownership of the
 *  descriptor by setting TDES0[31] and then issue a Transmit Poll Demand command
 */
#define GMAC_TU    (BIT(2))
#define GMAC_TU_M  (GMAC_TU_V << GMAC_TU_S)
#define GMAC_TU_V  0x00000001U
#define GMAC_TU_S  2
/** GMAC_TJT : R/W; bitpos: [3]; default: 0;
 *  Transmit Jabber Timeout This bit indicates that the Transmit Jabber Timer expired,
 *  which happens when the frame size exceeds 2,048 _10,240 bytes when the Jumbo frame
 *  is enabled_ When the Jabber Timeout occurs, the transmission process is aborted and
 *  placed in the Stopped state This causes the Transmit Jabber Timeout TDES0[14] flag
 *  to assert
 */
#define GMAC_TJT    (BIT(3))
#define GMAC_TJT_M  (GMAC_TJT_V << GMAC_TJT_S)
#define GMAC_TJT_V  0x00000001U
#define GMAC_TJT_S  3
/** GMAC_OVF : R/W; bitpos: [4]; default: 0;
 *  Receive Overflow This bit indicates that the Receive Buffer had an Overflow during
 *  frame reception If the partial frame is transferred to the application, the
 *  overflow status is set in RDES0[11]
 */
#define GMAC_OVF    (BIT(4))
#define GMAC_OVF_M  (GMAC_OVF_V << GMAC_OVF_S)
#define GMAC_OVF_V  0x00000001U
#define GMAC_OVF_S  4
/** GMAC_UNF : R/W; bitpos: [5]; default: 0;
 *  Transmit Underflow This bit indicates that the Transmit Buffer had an Underflow
 *  during frame transmission Transmission is suspended and an Underflow Error TDES0[1]
 *  is set
 */
#define GMAC_UNF    (BIT(5))
#define GMAC_UNF_M  (GMAC_UNF_V << GMAC_UNF_S)
#define GMAC_UNF_V  0x00000001U
#define GMAC_UNF_S  5
/** GMAC_RI : R/W; bitpos: [6]; default: 0;
 *  Receive Interrupt This bit indicates that the frame reception is complete When
 *  reception is complete, the Bit 31 of RDES1 _Disable Interrupt on Completion_ is
 *  reset in the last Descriptor, and the specific frame status information is updated
 *  in the descriptor The reception remains in the Running state
 */
#define GMAC_RI    (BIT(6))
#define GMAC_RI_M  (GMAC_RI_V << GMAC_RI_S)
#define GMAC_RI_V  0x00000001U
#define GMAC_RI_S  6
/** GMAC_RU : R/W; bitpos: [7]; default: 0;
 *  Receive Buffer Unavailable This bit indicates that the host owns the Next
 *  Descriptor in the Receive List and the DMA cannot acquire it The Receive Process is
 *  suspended To resume processing Receive descriptors, the host should change the
 *  ownership of the descriptor and issue a Receive Poll Demand command If no Receive
 *  Poll Demand is issued, the Receive Process resumes when the next recognized
 *  incoming frame is received This bit is set only when the previous Receive
 *  Descriptor is owned by the DMA
 */
#define GMAC_RU    (BIT(7))
#define GMAC_RU_M  (GMAC_RU_V << GMAC_RU_S)
#define GMAC_RU_V  0x00000001U
#define GMAC_RU_S  7
/** GMAC_RPS : R/W; bitpos: [8]; default: 0;
 *  Receive Process Stopped This bit is asserted when the Receive Process enters the
 *  Stopped state
 */
#define GMAC_RPS    (BIT(8))
#define GMAC_RPS_M  (GMAC_RPS_V << GMAC_RPS_S)
#define GMAC_RPS_V  0x00000001U
#define GMAC_RPS_S  8
/** GMAC_RWT : R/W; bitpos: [9]; default: 0;
 *  Receive Watchdog Timeout When set, this bit indicates that the Receive Watchdog
 *  Timer expired while receiving the current frame and the current frame is truncated
 *  after the watchdog timeout
 */
#define GMAC_RWT    (BIT(9))
#define GMAC_RWT_M  (GMAC_RWT_V << GMAC_RWT_S)
#define GMAC_RWT_V  0x00000001U
#define GMAC_RWT_S  9
/** GMAC_ETI : R/W; bitpos: [10]; default: 0;
 *  Early Transmit Interrupt This bit indicates that the frame to be transmitted is
 *  fully transferred to the MTL Transmit FIFO
 */
#define GMAC_ETI    (BIT(10))
#define GMAC_ETI_M  (GMAC_ETI_V << GMAC_ETI_S)
#define GMAC_ETI_V  0x00000001U
#define GMAC_ETI_S  10
/** GMAC_FBI : R/W; bitpos: [13]; default: 0;
 *  Fatal Bus Error Interrupt This bit indicates that a bus error occurred, as
 *  described in Bits [25:23] When this bit is set, the corresponding DMA engine
 *  disables all of its bus accesses 12:11		Reserved	00	RO
 */
#define GMAC_FBI    (BIT(13))
#define GMAC_FBI_M  (GMAC_FBI_V << GMAC_FBI_S)
#define GMAC_FBI_V  0x00000001U
#define GMAC_FBI_S  13
/** GMAC_ERI : R/W; bitpos: [14]; default: 0;
 *  Early Receive Interrupt This bit indicates that the DMA filled the first data
 *  buffer of the packet This bit is cleared when the software writes 1 to this bit or
 *  Bit 6 _RI_ of this register is set _whichever occurs earlier_
 */
#define GMAC_ERI    (BIT(14))
#define GMAC_ERI_M  (GMAC_ERI_V << GMAC_ERI_S)
#define GMAC_ERI_V  0x00000001U
#define GMAC_ERI_S  14
/** GMAC_AIS : R/W; bitpos: [15]; default: 0;
 *  Abnormal Interrupt Summary Abnormal Interrupt Summary bit value is the logical OR
 *  of the following when the corresponding interrupt bits are enabled in Register 7
 *  _Interrupt Enable Register_: Register 5[1]: Transmit Process Stopped Register 5[3]:
 *  Transmit Jabber Timeout Register 5[4]: Receive FIFO Overflow Register 5[5]:
 *  Transmit Underflow Register 5[7]: Receive Buffer Unavailable Register 5[8]: Receive
 *  Process Stopped Register 5[9]: Receive Watchdog Timeout Register 5[10]: Early
 *  Transmit Interrupt Register 5[13]: Fatal Bus Error Only unmasked bits affect the
 *  Abnormal Interrupt Summary bit This is a sticky bit and must be cleared _by writing
 *  1 to this bit_ each time a corresponding bit, which causes AIS to be set, is cleared
 */
#define GMAC_AIS    (BIT(15))
#define GMAC_AIS_M  (GMAC_AIS_V << GMAC_AIS_S)
#define GMAC_AIS_V  0x00000001U
#define GMAC_AIS_S  15
/** GMAC_NIS : R/W; bitpos: [16]; default: 0;
 *  Normal Interrupt Summary Normal Interrupt Summary bit value is the logical OR of
 *  the following bits when the corresponding interrupt bits are enabled in Register 7
 *  _Interrupt Enable Register_: Register 5[0]: Transmit Interrupt Register 5[2]:
 *  Transmit Buffer Unavailable Register 5[6]: Receive Interrupt Register 5[14]: Early
 *  Receive Interrupt Only unmasked bits _interrupts for which interrupt enable is set
 *  in Register 7_ affect the Normal Interrupt Summary bit This is a sticky bit and
 *  must be cleared _by writing 1 to this bit_ each time a corresponding bit, which
 *  causes NIS to be set, is cleared
 */
#define GMAC_NIS    (BIT(16))
#define GMAC_NIS_M  (GMAC_NIS_V << GMAC_NIS_S)
#define GMAC_NIS_V  0x00000001U
#define GMAC_NIS_S  16
/** GMAC_RS : RO; bitpos: [19:17]; default: 0;
 *  Receive Process State This field indicates the Receive DMA FSM state This field
 *  does not generate an interrupt 3’b000: Stopped: Reset or Stop Receive Command
 *  issued 3’b001: Running: Fetching Receive Transfer Descriptor 3’b010: Reserved for
 *  future use 3’b011: Running: Waiting for receive packet 3’b100: Suspended: Receive
 *  Descriptor Unavailable 3’b101: Running: Closing Receive Descriptor 3’b110:
 *  TIME_STAMP write state 3’b111: Running: Transferring the receive packet data from
 *  receive buffer to host memory
 */
#define GMAC_RS    0x00000007U
#define GMAC_RS_M  (GMAC_RS_V << GMAC_RS_S)
#define GMAC_RS_V  0x00000007U
#define GMAC_RS_S  17
/** GMAC_TS : RO; bitpos: [22:20]; default: 0;
 *  Transmit Process State This field indicates the Transmit DMA FSM state This field
 *  does not generate an interrupt 3’b000: Stopped: Reset or Stop Transmit Command
 *  issued 3’b001: Running: Fetching Transmit Transfer Descriptor 3’b010: Running:
 *  Waiting for status 3’b011: Running: Reading Data from host memory buffer and
 *  queuing it to transmit buffer _Tx FIFO_ 3’b100: TIME_STAMP write state 3’b101:
 *  Reserved for future use 3’b110: Suspended: Transmit Descriptor Unavailable or
 *  Transmit Buffer Underflow 3’b111: Running: Closing Transmit Descriptor
 */
#define GMAC_TS    0x00000007U
#define GMAC_TS_M  (GMAC_TS_V << GMAC_TS_S)
#define GMAC_TS_V  0x00000007U
#define GMAC_TS_S  20
/** GMAC_EB : RO; bitpos: [25:23]; default: 0;
 *  Error Bits This field indicates the type of error that caused a Bus Error, for
 *  example, error response on the AHB or AXI interface This field is valid only when
 *  Bit 13 _FBI_ is set This field does not generate an interrupt 0 0 0: Error during
 *  Rx DMA Write Data Transfer 0 1 1: Error during Tx DMA Read Data Transfer 1 0 0:
 *  Error during Rx DMA Descriptor Write Access 1 0 1: Error during Tx DMA Descriptor
 *  Write Access 1 1 0: Error during Rx DMA Descriptor Read Access 1 1 1: Error during
 *  Tx DMA Descriptor Read Access Note: 001 and 010 are reserved
 */
#define GMAC_EB    0x00000007U
#define GMAC_EB_M  (GMAC_EB_V << GMAC_EB_S)
#define GMAC_EB_V  0x00000007U
#define GMAC_EB_S  23
/** GMAC_GLI : RO; bitpos: [26]; default: 0;
 *  GMAC Line Interface Interrupt When set, this bit reflects any of the following
 *  interrupt events in the DWC_gmac interfaces _if present and enabled in your
 *  configuration_: PCS _TBI, RTBI, or SGMII_: Link change or autonegotiation complete
 *  event SMII or RGMII: Link change event General Purpose Input Status _GPIS_: Any LL
 *  or LH event on the gpi_i input ports To identify the exact cause of the interrupt,
 *  the software must first read Bit 11 and Bits[2:0] of Register 14 _Interrupt Status
 *  Register_ and then to clear the source of interrupt _which also clears the GLI
 *  interrupt_, read any of the following corresponding registers: PCS _TBI, RTBI, or
 *  SGMII_: Register 49 _AN Status Register_ SMII or RGMII: Register 54
 *  _SGMII/RGMII/SMII Control and Status Register_ General Purpose Input _GPI_:
 *  Register 56 _General Purpose IO Register_ The interrupt signal from the DWC_gmac
 *  subsystem _sbd_intr_o_ is high when this bit is high
 */
#define GMAC_GLI    (BIT(26))
#define GMAC_GLI_M  (GMAC_GLI_V << GMAC_GLI_S)
#define GMAC_GLI_V  0x00000001U
#define GMAC_GLI_S  26
/** GMAC_GMI : RO; bitpos: [27]; default: 0;
 *  GMAC MMC Interrupt This bit reflects an interrupt event in the MMC module of the
 *  DWC_gmac The software must read the corresponding registers in the DWC_gmac to get
 *  the exact cause of the interrupt and clear the source of interrupt to make this bit
 *  as 1’b0 The interrupt signal from the DWC_gmac subsystem _sbd_intr_o_ is high when
 *  this bit is high This bit is applicable only when the MAC Management Counters _MMC_
 *  are enabled Otherwise, this bit is reserved
 */
#define GMAC_GMI    (BIT(27))
#define GMAC_GMI_M  (GMAC_GMI_V << GMAC_GMI_S)
#define GMAC_GMI_V  0x00000001U
#define GMAC_GMI_S  27
/** GMAC_GPI : RO; bitpos: [28]; default: 0;
 *  GMAC PMT Interrupt This bit indicates an interrupt event in the PMT module of the
 *  DWC_gmac The software must read the PMT Control and Status Register in the MAC to
 *  get the exact cause of interrupt and clear its source to reset this bit to 1’b0 The
 *  interrupt signal from the DWC_gmac subsystem _sbd_intr_o_ is high when this bit is
 *  high This bit is applicable only when the Power Management feature is enabled
 *  Otherwise, this bit is reserved Note: The GPI and pmt_intr_o interrupts are
 *  generated in different clock domains
 */
#define GMAC_GPI    (BIT(28))
#define GMAC_GPI_M  (GMAC_GPI_V << GMAC_GPI_S)
#define GMAC_GPI_V  0x00000001U
#define GMAC_GPI_S  28
/** GMAC_TTI : RO; bitpos: [29]; default: 0;
 *  Timestamp Trigger Interrupt This bit indicates an interrupt event in the Timestamp
 *  Generator block of the DWC_gmac The software must read the corresponding registers
 *  in the DWC_gmac to get the exact cause of the interrupt and clear its source to
 *  reset this bit to 1'b0 When this bit is high, the interrupt signal from the
 *  DWC_gmac subsystem _sbd_intr_o_ is high This bit is applicable only when the IEEE
 *  1588 Timestamp feature is enabled Otherwise, this bit is reserved
 */
#define GMAC_TTI    (BIT(29))
#define GMAC_TTI_M  (GMAC_TTI_V << GMAC_TTI_S)
#define GMAC_TTI_V  0x00000001U
#define GMAC_TTI_S  29
/** GMAC_GLPII_GTMSI : RO; bitpos: [30]; default: 0;
 *  GLPII: GMAC LPI Interrupt This bit indicates an interrupt event in the LPI logic of
 *  the MAC To reset this bit to 1'b0, the software must read the corresponding
 *  registers in the DWC_gmac to get the exact cause of the interrupt and clear its
 *  source Note: GLPII status is given only in Channel 0 DMA register and is applicable
 *  only when the Energy Efficient Ethernet feature is enabled Otherwise, this bit is
 *  reserved When this bit is high, the interrupt signal from the MAC _sbd_intr_o_ is
 *  high
 */
#define GMAC_GLPII_GTMSI    (BIT(30))
#define GMAC_GLPII_GTMSI_M  (GMAC_GLPII_GTMSI_V << GMAC_GLPII_GTMSI_S)
#define GMAC_GLPII_GTMSI_V  0x00000001U
#define GMAC_GLPII_GTMSI_S  30

