espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER8_MISSEDFRAMEANDBUFFEROVERFLOWCOUNTERREGISTER_REG register
 *  Contains the counters for discarded frames because no host Receive Descriptor was
 *  available or because of Receive FIFO Overflow
 */
#define GMAC_REGISTER8_MISSEDFRAMEANDBUFFEROVERFLOWCOUNTERREGISTER_REG (DR_REG_GMAC_BASE + 0x1020)
/** GMAC_MISFRMCNT : R/W; bitpos: [15:0]; default: 0;
 *  Missed Frame Counter This field indicates the number of frames missed by the
 *  controller because of the Host Receive Buffer being unavailable This counter is
 *  incremented each time the DMA discards an incoming frame The counter is cleared
 *  when this register is read with mci_be_i[0] at 1’b1
 */
#define GMAC_MISFRMCNT    0x0000FFFFU
#define GMAC_MISFRMCNT_M  (GMAC_MISFRMCNT_V << GMAC_MISFRMCNT_S)
#define GMAC_MISFRMCNT_V  0x0000FFFFU
#define GMAC_MISFRMCNT_S  0
/** GMAC_MISCNTOVF : R/W; bitpos: [16]; default: 0;
 *  Overflow Bit for Missed Frame Counter This bit is set every time Missed Frame
 *  Counter _Bits[15:0]_ overflows, that is, the DMA discards an incoming frame because
 *  of the Host Receive Buffer being unavailable with the missed frame counter at
 *  maximum value In such a scenario, the Missed frame counter is reset to allzeros and
 *  this bit indicates that the rollover happened
 */
#define GMAC_MISCNTOVF    (BIT(16))
#define GMAC_MISCNTOVF_M  (GMAC_MISCNTOVF_V << GMAC_MISCNTOVF_S)
#define GMAC_MISCNTOVF_V  0x00000001U
#define GMAC_MISCNTOVF_S  16
/** GMAC_OVFFRMCNT : R/W; bitpos: [27:17]; default: 0;
 *  Overflow Frame Counter This field indicates the number of frames missed by the
 *  application This counter is incremented each time the MTL FIFO overflows The
 *  counter is cleared when this register is read with mci_be_i[2] at 1’b1
 */
#define GMAC_OVFFRMCNT    0x000007FFU
#define GMAC_OVFFRMCNT_M  (GMAC_OVFFRMCNT_V << GMAC_OVFFRMCNT_S)
#define GMAC_OVFFRMCNT_V  0x000007FFU
#define GMAC_OVFFRMCNT_S  17
/** GMAC_OVFCNTOVF : R/W; bitpos: [28]; default: 0;
 *  Overflow Bit for FIFO Overflow Counter This bit is set every time the Overflow
 *  Frame Counter _Bits[27:17]_ overflows, that is, the Rx FIFO overflows with the
 *  overflow frame counter at maximum value In such a scenario, the overflow frame
 *  counter is reset to allzeros and this bit indicates that the rollover happened
 */
#define GMAC_OVFCNTOVF    (BIT(28))
#define GMAC_OVFCNTOVF_M  (GMAC_OVFCNTOVF_V << GMAC_OVFCNTOVF_S)
#define GMAC_OVFCNTOVF_V  0x00000001U
#define GMAC_OVFCNTOVF_S  28

/** GMAC_REGISTER9_RECEIVEINTERRUPTWATCHDOGTIMERREGISTER_REG register
 *  Watchdog timeout for Receive Interrupt _RI_ from DMA
 */
#define GMAC_REGISTER9_RECEIVEINTERRUPTWATCHDOGTIMERREGISTER_REG (DR_REG_GMAC_BASE + 0x1024)
/** GMAC_RIWT : R/W; bitpos: [7:0]; default: 0;
 *  RI Watchdog Timer Count This bit indicates the number of system clock cycles
 *  multiplied by 256 for which the watchdog timer is set The watchdog timer gets
 *  triggered with the programmed value after the Rx DMA completes the transfer of a
 *  frame for which the RI status bit is not set because of the setting in the
 *  corresponding descriptor RDES1[31] When the watchdog timer runs out, the RI bit is
 *  set and the timer is stopped The watchdog timer is reset when the RI bit is set
 *  high because of automatic setting of RI as per RDES1[31] of any received frame
 */
#define GMAC_RIWT    0x000000FFU
#define GMAC_RIWT_M  (GMAC_RIWT_V << GMAC_RIWT_S)
#define GMAC_RIWT_V  0x000000FFU
#define GMAC_RIWT_S  0

/** GMAC_REGISTER10_AXIBUSMODEREGISTER_REG register
 *  Controls AXI master behavior _mainly controls burst splitting and number of
 *  outstanding requests_
 */
#define GMAC_REGISTER10_AXIBUSMODEREGISTER_REG (DR_REG_GMAC_BASE + 0x1028)
/** GMAC_UNDEF : RO; bitpos: [0]; default: 1;
 *  AXI Undefined Burst Length This bit is readonly bit and indicates the complement
 *  _invert_ value of Bit 16 _FB_ in Register 0 _Bus Mode Register_ When this bit is
 *  set to 1, the GMACAXI is allowed to perform any burst length equal to or below the
 *  maximum allowed burst length programmed in Bits[7:3] When this bit is set to 0, the
 *  GMACAXI is allowed to perform only fixed burst lengths as indicated by BLEN256,
 *  BLEN128, BLEN64, BLEN32, BLEN16, BLEN8, or BLEN4, or a burst length of 1 If UNDEF
 *  is set and none of the BLEN bits is set, then GMACAXI is allowed to perform a burst
 *  length of 16
 */
#define GMAC_UNDEF    (BIT(0))
#define GMAC_UNDEF_M  (GMAC_UNDEF_V << GMAC_UNDEF_S)
#define GMAC_UNDEF_V  0x00000001U
#define GMAC_UNDEF_S  0
/** GMAC_BLEN4 : R/W; bitpos: [1]; default: 0;
 *  AXI Burst Length 4 When this bit is set to 1, the GMACAXI is allowed to select a
 *  burst length of 4 on the AXI master interface Setting this bit has no effect when
 *  UNDEF is set to 1
 */
#define GMAC_BLEN4    (BIT(1))
#define GMAC_BLEN4_M  (GMAC_BLEN4_V << GMAC_BLEN4_S)
#define GMAC_BLEN4_V  0x00000001U
#define GMAC_BLEN4_S  1
/** GMAC_BLEN8 : R/W; bitpos: [2]; default: 0;
 *  AXI Burst Length 8 When this bit is set to 1, the GMACAXI is allowed to select a
 *  burst length of 8 on the AXI master interface Setting this bit has no effect when
 *  UNDEF is set to 1
 */
#define GMAC_BLEN8    (BIT(2))
#define GMAC_BLEN8_M  (GMAC_BLEN8_V << GMAC_BLEN8_S)
#define GMAC_BLEN8_V  0x00000001U
#define GMAC_BLEN8_S  2
/** GMAC_BLEN16 : R/W; bitpos: [3]; default: 0;
 *  AXI Burst Length 16 When this bit is set to 1 or UNDEF is set to 1, the GMACAXI is
 *  allowed to select a burst length of 16 on the AXI master interface
 */
#define GMAC_BLEN16    (BIT(3))
#define GMAC_BLEN16_M  (GMAC_BLEN16_V << GMAC_BLEN16_S)
#define GMAC_BLEN16_V  0x00000001U
#define GMAC_BLEN16_S  3
/** GMAC_BLEN32 : R/W; bitpos: [4]; default: 0;
 *  AXI Burst Length 32 When this bit is set to 1, the GMACAXI is allowed to select a
 *  burst length of 32 on the AXI master interface This bit is present only when the
 *  configuration parameter AXI_BL is set to 32 or more Otherwise, this bit is reserved
 *  and is readonly _RO_
 */
#define GMAC_BLEN32    (BIT(4))
#define GMAC_BLEN32_M  (GMAC_BLEN32_V << GMAC_BLEN32_S)
#define GMAC_BLEN32_V  0x00000001U
#define GMAC_BLEN32_S  4
/** GMAC_BLEN64 : R/W; bitpos: [5]; default: 0;
 *  AXI Burst Length 64 When this bit is set to 1, the GMACAXI is allowed to select a
 *  burst length of 64 on the AXI master interface This bit is present only when the
 *  configuration parameter AXI_BL is set to 64 or more Otherwise, this bit is reserved
 *  and is readonly _RO_
 */
#define GMAC_BLEN64    (BIT(5))
#define GMAC_BLEN64_M  (GMAC_BLEN64_V << GMAC_BLEN64_S)
#define GMAC_BLEN64_V  0x00000001U
#define GMAC_BLEN64_S  5
/** GMAC_BLEN128 : R/W; bitpos: [6]; default: 0;
 *  AXI Burst Length 128 When this bit is set to 1, the GMACAXI is allowed to select a
 *  burst length of 128 on the AXI master interface This bit is present only when the
 *  configuration parameter AXI_BL is set to 128 or more Otherwise, this bit is
 *  reserved and is readonly _RO_
 */
#define GMAC_BLEN128    (BIT(6))
#define GMAC_BLEN128_M  (GMAC_BLEN128_V << GMAC_BLEN128_S)
#define GMAC_BLEN128_V  0x00000001U
#define GMAC_BLEN128_S  6
/** GMAC_BLEN256 : R/W; bitpos: [7]; default: 0;
 *  AXI Burst Length 256 When this bit is set to 1, the GMACAXI is allowed to select a
 *  burst length of 256 on the AXI master interface This bit is present only when the
 *  configuration parameter AXI_BL is set to 256 Otherwise, this bit is reserved and is
 *  readonly _RO_
 */
#define GMAC_BLEN256    (BIT(7))
#define GMAC_BLEN256_M  (GMAC_BLEN256_V << GMAC_BLEN256_S)
#define GMAC_BLEN256_V  0x00000001U
#define GMAC_BLEN256_S  7
/** GMAC_AXI_AAL : RO; bitpos: [12]; default: 0;
 *  AddressAligned Beats This bit is readonly bit and reflects the Bit 25 _AAL_ of
 *  Register 0 _Bus Mode Register_ When this bit is set to 1, the GMACAXI performs
 *  addressaligned burst transfers on both read and write channels 11:8		Reserved	0H	RO
 */
#define GMAC_AXI_AAL    (BIT(12))
#define GMAC_AXI_AAL_M  (GMAC_AXI_AAL_V << GMAC_AXI_AAL_S)
#define GMAC_AXI_AAL_V  0x00000001U
#define GMAC_AXI_AAL_S  12
/** GMAC_ONEKBBE : R/W; bitpos: [13]; default: 0;
 *  1 KB Boundary Crossing Enable for the GMACAXI Master When set, the GMACAXI master
 *  performs burst transfers that do not cross 1 KB boundary When reset, the GMACAXI
 *  master performs burst transfers that do not cross 4 KB boundary
 */
#define GMAC_ONEKBBE    (BIT(13))
#define GMAC_ONEKBBE_M  (GMAC_ONEKBBE_V << GMAC_ONEKBBE_S)
#define GMAC_ONEKBBE_V  0x00000001U
#define GMAC_ONEKBBE_S  13
/** GMAC_RD_OSR_LMT : R/W; bitpos: [19:16]; default: 1;
 *  AXI Maximum Read Outstanding Request Limit This value limits the maximum
 *  outstanding request on the AXI read interface Maximum outstanding requests =
 *  RD_OSR_LMT+1 Note: Bit 18 is reserved if AXI_GM_MAX_RD_REQUESTS = 4 Bit 19 is
 *  reserved if AXI_GM_MAX_RD_REQUESTS != 16 15:14		Reserved	00	RO
 */
#define GMAC_RD_OSR_LMT    0x0000000FU
#define GMAC_RD_OSR_LMT_M  (GMAC_RD_OSR_LMT_V << GMAC_RD_OSR_LMT_S)
#define GMAC_RD_OSR_LMT_V  0x0000000FU
#define GMAC_RD_OSR_LMT_S  16
/** GMAC_WR_OSR_LMT : R/W; bitpos: [23:20]; default: 1;
 *  AXI Maximum Write Outstanding Request Limit This value limits the maximum
 *  outstanding request on the AXI write interface Maximum outstanding requests =
 *  WR_OSR_LMT+1 Note: Bit 22 is reserved if AXI_GM_MAX_WR_REQUESTS = 4 Bit 23 bit is
 *  reserved if AXI_GM_MAX_WR_REQUESTS != 16
 */
#define GMAC_WR_OSR_LMT    0x0000000FU
#define GMAC_WR_OSR_LMT_M  (GMAC_WR_OSR_LMT_V << GMAC_WR_OSR_LMT_S)
#define GMAC_WR_OSR_LMT_V  0x0000000FU
#define GMAC_WR_OSR_LMT_S  20
/** GMAC_LPI_XIT_FRM : R/W; bitpos: [30]; default: 0;
 *  Unlock on Magic Packet or Remote WakeUp Frame When set to 1, this bit enables the
 *  GMACAXI to come out of the LPI mode only when the magic packet or remote wakeup
 *  frame is received When set to 0, this bit enables the GMACAXI to come out of LPI
 *  mode when any frame is received 29:24		Reserved	00H	RO
 */
#define GMAC_LPI_XIT_FRM    (BIT(30))
#define GMAC_LPI_XIT_FRM_M  (GMAC_LPI_XIT_FRM_V << GMAC_LPI_XIT_FRM_S)
#define GMAC_LPI_XIT_FRM_V  0x00000001U
#define GMAC_LPI_XIT_FRM_S  30
/** GMAC_EN_LPI : R/W; bitpos: [31]; default: 0;
 *  Enable Low Power Interface _LPI_ When set to 1, this bit enables the LPI mode
 *  supported by the GMACAXI configuration and accepts the LPI request from the AXI
 *  System Clock controller When set to 0, this bit disables the LPI mode and always
 *  denies the LPI request from the AXI System Clock controller
 */
#define GMAC_EN_LPI    (BIT(31))
#define GMAC_EN_LPI_M  (GMAC_EN_LPI_V << GMAC_EN_LPI_S)
#define GMAC_EN_LPI_V  0x00000001U
#define GMAC_EN_LPI_S  31

/** GMAC_REGISTER11_AHBORAXISTATUSREGISTER_REG register
 *  Gives the idle status of the AHB master interface in the GMACAHB configuration
 *  Gives the idle status of the AXI master's read or write channel in the GMACAXI
 *  configuration
 */
#define GMAC_REGISTER11_AHBORAXISTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x102c)
/** GMAC_AXWHSTS : RO; bitpos: [0]; default: 0;
 *  AXI Master Write Channel or AHB Master Status When high, it indicates that AXI
 *  master's write channel is active and transferring data in the GMACAXI configuration
 *  In the GMACAHB configuration, it indicates that the AHB master interface FSMs are
 *  in the nonidle state
 */
#define GMAC_AXWHSTS    (BIT(0))
#define GMAC_AXWHSTS_M  (GMAC_AXWHSTS_V << GMAC_AXWHSTS_S)
#define GMAC_AXWHSTS_V  0x00000001U
#define GMAC_AXWHSTS_S  0
/** GMAC_AXIRDSTS : RO; bitpos: [1]; default: 0;
 *  AXI Master Read Channel Status When high, it indicates that AXI master's read
 *  channel is active and transferring data
 */
#define GMAC_AXIRDSTS    (BIT(1))
#define GMAC_AXIRDSTS_M  (GMAC_AXIRDSTS_V << GMAC_AXIRDSTS_S)
#define GMAC_AXIRDSTS_V  0x00000001U
#define GMAC_AXIRDSTS_S  1

