espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER18_CURRENTHOSTTRANSMITDESCRIPTORREGISTER_REG register
 *  Points to the start of current Transmit Descriptor read by the DMA
 */
#define GMAC_REGISTER18_CURRENTHOSTTRANSMITDESCRIPTORREGISTER_REG (DR_REG_GMAC_BASE + 0x1048)
/** GMAC_CURTDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Descriptor Address Pointer
 */
#define GMAC_CURTDESAPTR    0xFFFFFFFFU
#define GMAC_CURTDESAPTR_M  (GMAC_CURTDESAPTR_V << GMAC_CURTDESAPTR_S)
#define GMAC_CURTDESAPTR_V  0xFFFFFFFFU
#define GMAC_CURTDESAPTR_S  0

/** GMAC_REGISTER19_CURRENTHOSTRECEIVEDESCRIPTORREGISTER_REG register
 *  Points to the start of current Receive Descriptor read by the DMA
 */
#define GMAC_REGISTER19_CURRENTHOSTRECEIVEDESCRIPTORREGISTER_REG (DR_REG_GMAC_BASE + 0x104c)
/** GMAC_CURRDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Descriptor Address Pointer
 */
#define GMAC_CURRDESAPTR    0xFFFFFFFFU
#define GMAC_CURRDESAPTR_M  (GMAC_CURRDESAPTR_V << GMAC_CURRDESAPTR_S)
#define GMAC_CURRDESAPTR_V  0xFFFFFFFFU
#define GMAC_CURRDESAPTR_S  0

/** GMAC_REGISTER20_CURRENTHOSTTRANSMITBUFFERADDRESSREGISTER_REG register
 *  Points to the current Transmit Buffer address read by the DMA
 */
#define GMAC_REGISTER20_CURRENTHOSTTRANSMITBUFFERADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x1050)
/** GMAC_CURTBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Buffer Address Pointer
 */
#define GMAC_CURTBUFAPTR    0xFFFFFFFFU
#define GMAC_CURTBUFAPTR_M  (GMAC_CURTBUFAPTR_V << GMAC_CURTBUFAPTR_S)
#define GMAC_CURTBUFAPTR_V  0xFFFFFFFFU
#define GMAC_CURTBUFAPTR_S  0

/** GMAC_REGISTER21_CURRENTHOSTRECEIVEBUFFERADDRESSREGISTER_REG register
 *  Points to the current Receive Buffer address read by the DMA
 */
#define GMAC_REGISTER21_CURRENTHOSTRECEIVEBUFFERADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x1054)
/** GMAC_CURRBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Buffer Address Pointer
 */
#define GMAC_CURRBUFAPTR    0xFFFFFFFFU
#define GMAC_CURRBUFAPTR_M  (GMAC_CURRBUFAPTR_V << GMAC_CURRBUFAPTR_S)
#define GMAC_CURRBUFAPTR_V  0xFFFFFFFFU
#define GMAC_CURRBUFAPTR_S  0

/** GMAC_REGISTER22_HWFEATUREREGISTER_REG register
 *  Indicates the presence of the optional features of the core
 */
#define GMAC_REGISTER22_HWFEATUREREGISTER_REG (DR_REG_GMAC_BASE + 0x1058)
/** GMAC_MIISEL : RO; bitpos: [0]; default: 0;
 *  10 or 100 Mbps support
 */
#define GMAC_MIISEL    (BIT(0))
#define GMAC_MIISEL_M  (GMAC_MIISEL_V << GMAC_MIISEL_S)
#define GMAC_MIISEL_V  0x00000001U
#define GMAC_MIISEL_S  0
/** GMAC_GMIISEL : RO; bitpos: [1]; default: 0;
 *  1000 Mbps support
 */
#define GMAC_GMIISEL    (BIT(1))
#define GMAC_GMIISEL_M  (GMAC_GMIISEL_V << GMAC_GMIISEL_S)
#define GMAC_GMIISEL_V  0x00000001U
#define GMAC_GMIISEL_S  1
/** GMAC_HDSEL : RO; bitpos: [2]; default: 0;
 *  Halfduplex support
 */
#define GMAC_HDSEL    (BIT(2))
#define GMAC_HDSEL_M  (GMAC_HDSEL_V << GMAC_HDSEL_S)
#define GMAC_HDSEL_V  0x00000001U
#define GMAC_HDSEL_S  2
/** GMAC_EXTHASHEN : RO; bitpos: [3]; default: 0;
 *  Expanded DA Hash filter
 */
#define GMAC_EXTHASHEN    (BIT(3))
#define GMAC_EXTHASHEN_M  (GMAC_EXTHASHEN_V << GMAC_EXTHASHEN_S)
#define GMAC_EXTHASHEN_V  0x00000001U
#define GMAC_EXTHASHEN_S  3
/** GMAC_HASHSEL : RO; bitpos: [4]; default: 0;
 *  HASH filter
 */
#define GMAC_HASHSEL    (BIT(4))
#define GMAC_HASHSEL_M  (GMAC_HASHSEL_V << GMAC_HASHSEL_S)
#define GMAC_HASHSEL_V  0x00000001U
#define GMAC_HASHSEL_S  4
/** GMAC_ADDMACADRSEL : RO; bitpos: [5]; default: 0;
 *  Multiple MAC Address registers
 */
#define GMAC_ADDMACADRSEL    (BIT(5))
#define GMAC_ADDMACADRSEL_M  (GMAC_ADDMACADRSEL_V << GMAC_ADDMACADRSEL_S)
#define GMAC_ADDMACADRSEL_V  0x00000001U
#define GMAC_ADDMACADRSEL_S  5
/** GMAC_PCSSEL : RO; bitpos: [6]; default: 0;
 *  PCS registers _TBI, SGMII, or RTBI PHY interface_
 */
#define GMAC_PCSSEL    (BIT(6))
#define GMAC_PCSSEL_M  (GMAC_PCSSEL_V << GMAC_PCSSEL_S)
#define GMAC_PCSSEL_V  0x00000001U
#define GMAC_PCSSEL_S  6
/** GMAC_L3L4FLTREN : RO; bitpos: [7]; default: 0;
 *  Layer 3 and Layer 4 feature
 */
#define GMAC_L3L4FLTREN    (BIT(7))
#define GMAC_L3L4FLTREN_M  (GMAC_L3L4FLTREN_V << GMAC_L3L4FLTREN_S)
#define GMAC_L3L4FLTREN_V  0x00000001U
#define GMAC_L3L4FLTREN_S  7
/** GMAC_SMASEL : RO; bitpos: [8]; default: 0;
 *  SMA _MDIO_ Interface
 */
#define GMAC_SMASEL    (BIT(8))
#define GMAC_SMASEL_M  (GMAC_SMASEL_V << GMAC_SMASEL_S)
#define GMAC_SMASEL_V  0x00000001U
#define GMAC_SMASEL_S  8
/** GMAC_RWKSEL : RO; bitpos: [9]; default: 0;
 *  PMT remote wakeup frame
 */
#define GMAC_RWKSEL    (BIT(9))
#define GMAC_RWKSEL_M  (GMAC_RWKSEL_V << GMAC_RWKSEL_S)
#define GMAC_RWKSEL_V  0x00000001U
#define GMAC_RWKSEL_S  9
/** GMAC_MGKSEL : RO; bitpos: [10]; default: 0;
 *  PMT magic packet
 */
#define GMAC_MGKSEL    (BIT(10))
#define GMAC_MGKSEL_M  (GMAC_MGKSEL_V << GMAC_MGKSEL_S)
#define GMAC_MGKSEL_V  0x00000001U
#define GMAC_MGKSEL_S  10
/** GMAC_MMCSEL : RO; bitpos: [11]; default: 0;
 *  RMON module
 */
#define GMAC_MMCSEL    (BIT(11))
#define GMAC_MMCSEL_M  (GMAC_MMCSEL_V << GMAC_MMCSEL_S)
#define GMAC_MMCSEL_V  0x00000001U
#define GMAC_MMCSEL_S  11
/** GMAC_TSVER1SEL : RO; bitpos: [12]; default: 0;
 *  Only IEEE 15882002 timestamp
 */
#define GMAC_TSVER1SEL    (BIT(12))
#define GMAC_TSVER1SEL_M  (GMAC_TSVER1SEL_V << GMAC_TSVER1SEL_S)
#define GMAC_TSVER1SEL_V  0x00000001U
#define GMAC_TSVER1SEL_S  12
/** GMAC_TSVER2SEL : RO; bitpos: [13]; default: 0;
 *  IEEE 15882008 Advanced timestamp
 */
#define GMAC_TSVER2SEL    (BIT(13))
#define GMAC_TSVER2SEL_M  (GMAC_TSVER2SEL_V << GMAC_TSVER2SEL_S)
#define GMAC_TSVER2SEL_V  0x00000001U
#define GMAC_TSVER2SEL_S  13
/** GMAC_EEESEL : RO; bitpos: [14]; default: 0;
 *  Energy Efficient Ethernet
 */
#define GMAC_EEESEL    (BIT(14))
#define GMAC_EEESEL_M  (GMAC_EEESEL_V << GMAC_EEESEL_S)
#define GMAC_EEESEL_V  0x00000001U
#define GMAC_EEESEL_S  14
/** GMAC_AVSEL : RO; bitpos: [15]; default: 0;
 *  AV feature
 */
#define GMAC_AVSEL    (BIT(15))
#define GMAC_AVSEL_M  (GMAC_AVSEL_V << GMAC_AVSEL_S)
#define GMAC_AVSEL_V  0x00000001U
#define GMAC_AVSEL_S  15
/** GMAC_TXCOESEL : RO; bitpos: [16]; default: 0;
 *  Checksum Offload in Tx
 */
#define GMAC_TXCOESEL    (BIT(16))
#define GMAC_TXCOESEL_M  (GMAC_TXCOESEL_V << GMAC_TXCOESEL_S)
#define GMAC_TXCOESEL_V  0x00000001U
#define GMAC_TXCOESEL_S  16
/** GMAC_RXTYP1COE : RO; bitpos: [17]; default: 0;
 *  IP Checksum Offload _Type 1_ in Rx Note: If IPCHKSUM_EN = Enabled and
 *  IPC_FULL_OFFLOAD = Enabled, then RXTYP1COE = 0 and RXTYP2COE = 1
 */
#define GMAC_RXTYP1COE    (BIT(17))
#define GMAC_RXTYP1COE_M  (GMAC_RXTYP1COE_V << GMAC_RXTYP1COE_S)
#define GMAC_RXTYP1COE_V  0x00000001U
#define GMAC_RXTYP1COE_S  17
/** GMAC_RXTYP2COE : RO; bitpos: [18]; default: 0;
 *  IP Checksum Offload _Type 2_ in Rx
 */
#define GMAC_RXTYP2COE    (BIT(18))
#define GMAC_RXTYP2COE_M  (GMAC_RXTYP2COE_V << GMAC_RXTYP2COE_S)
#define GMAC_RXTYP2COE_V  0x00000001U
#define GMAC_RXTYP2COE_S  18
/** GMAC_RXFIFOSIZE : RO; bitpos: [19]; default: 0;
 *  Rx FIFO > 2,048 Bytes
 */
#define GMAC_RXFIFOSIZE    (BIT(19))
#define GMAC_RXFIFOSIZE_M  (GMAC_RXFIFOSIZE_V << GMAC_RXFIFOSIZE_S)
#define GMAC_RXFIFOSIZE_V  0x00000001U
#define GMAC_RXFIFOSIZE_S  19
/** GMAC_RXCHCNT : RO; bitpos: [21:20]; default: 0;
 *  Number of additional Rx Channels
 */
#define GMAC_RXCHCNT    0x00000003U
#define GMAC_RXCHCNT_M  (GMAC_RXCHCNT_V << GMAC_RXCHCNT_S)
#define GMAC_RXCHCNT_V  0x00000003U
#define GMAC_RXCHCNT_S  20
/** GMAC_TXCHCNT : RO; bitpos: [23:22]; default: 0;
 *  Number of additional Tx Channels
 */
#define GMAC_TXCHCNT    0x00000003U
#define GMAC_TXCHCNT_M  (GMAC_TXCHCNT_V << GMAC_TXCHCNT_S)
#define GMAC_TXCHCNT_V  0x00000003U
#define GMAC_TXCHCNT_S  22
/** GMAC_ENHDESSEL : RO; bitpos: [24]; default: 0;
 *  Alternate _Enhanced Descriptor_
 */
#define GMAC_ENHDESSEL    (BIT(24))
#define GMAC_ENHDESSEL_M  (GMAC_ENHDESSEL_V << GMAC_ENHDESSEL_S)
#define GMAC_ENHDESSEL_V  0x00000001U
#define GMAC_ENHDESSEL_S  24
/** GMAC_INTTSEN : RO; bitpos: [25]; default: 0;
 *  Timestamping with Internal System Time
 */
#define GMAC_INTTSEN    (BIT(25))
#define GMAC_INTTSEN_M  (GMAC_INTTSEN_V << GMAC_INTTSEN_S)
#define GMAC_INTTSEN_V  0x00000001U
#define GMAC_INTTSEN_S  25
/** GMAC_FLEXIPPSEN : RO; bitpos: [26]; default: 0;
 *  Flexible PulsePerSecond Output
 */
#define GMAC_FLEXIPPSEN    (BIT(26))
#define GMAC_FLEXIPPSEN_M  (GMAC_FLEXIPPSEN_V << GMAC_FLEXIPPSEN_S)
#define GMAC_FLEXIPPSEN_V  0x00000001U
#define GMAC_FLEXIPPSEN_S  26
/** GMAC_SAVLANINS : RO; bitpos: [27]; default: 0;
 *  Source Address or VLAN Insertion
 */
#define GMAC_SAVLANINS    (BIT(27))
#define GMAC_SAVLANINS_M  (GMAC_SAVLANINS_V << GMAC_SAVLANINS_S)
#define GMAC_SAVLANINS_V  0x00000001U
#define GMAC_SAVLANINS_S  27
/** GMAC_ACTPHYIF : RO; bitpos: [30:28]; default: 0;
 *  Active or selected PHY interface When you have multiple PHY interfaces in your
 *  configuration, this field indicates the sampled value of phy_intf_sel_i during
 *  reset deassertion 000: GMII or MII 001: RGMII 010: SGMII 011: TBI 100: RMII 101:
 *  RTBI 110: SMII 111: RevMII All Others: Reserved
 */
#define GMAC_ACTPHYIF    0x00000007U
#define GMAC_ACTPHYIF_M  (GMAC_ACTPHYIF_V << GMAC_ACTPHYIF_S)
#define GMAC_ACTPHYIF_V  0x00000007U
#define GMAC_ACTPHYIF_S  28

/** GMAC_REGISTER64_CHANNEL1BUSMODEREGISTER_REG register
 *  Controls the Host Interface mode for Channel 1
 */
#define GMAC_REGISTER64_CHANNEL1BUSMODEREGISTER_REG (DR_REG_GMAC_BASE + 0x1100)
/** GMAC_CH1_SWR : R/W1S; bitpos: [0]; default: 1;
 *  Software Reset When this bit is set, the MAC DMA Controller resets the logic and
 *  all internal registers of the MAC It is cleared automatically after the reset
 *  operation is complete in all of the DWC_gmac clock domains Before reprogramming any
 *  register of the DWC_gmac, you should read a zero _0_ value in this bit Note: The
 *  Software reset function is driven only by this bit Bit 0 of Register 64 _Channel 1
 *  Bus Mode Register_ or Register 128 _Channel 2 Bus Mode Register_ has no impact on
 *  the Software reset function The reset operation is completed only when all resets
 *  in all active clock domains are deasserted Therefore, it is essential that all PHY
 *  inputs clocks _applicable for the selected PHY interface_ are present for the
 *  software reset completion The time to complete the software reset operation depends
 *  on the frequency of the slowest active clock
 */
#define GMAC_CH1_SWR    (BIT(0))
#define GMAC_CH1_SWR_M  (GMAC_CH1_SWR_V << GMAC_CH1_SWR_S)
#define GMAC_CH1_SWR_V  0x00000001U
#define GMAC_CH1_SWR_S  0
/** GMAC_CH1_DA : R/W; bitpos: [1]; default: 0;
 *  DMA Arbitration Scheme This bit specifies the arbitration scheme between the
 *  transmit and receive paths of Channel 1 0: Weighted roundrobin with Rx:Tx or Tx:Rx
 *  The priority between the paths is according to the priority specified in Bits
 *  [15:14] _PR_ and priority weights specified in Bit 27 _TXPR_ 1: Fixed priority The
 *  transmit path has priority over receive path when Bit 27 _TXPR_ is set Otherwise,
 *  receive path has priority over the transmit path In the GMACAXI configuration,
 *  these bits are reserved and are readonly _RO_ For more information about the
 *  priority scheme between the transmit and receive paths, see Table 412 in “DMA
 *  Arbiter Functions” on page 167
 */
#define GMAC_CH1_DA    (BIT(1))
#define GMAC_CH1_DA_M  (GMAC_CH1_DA_V << GMAC_CH1_DA_S)
#define GMAC_CH1_DA_V  0x00000001U
#define GMAC_CH1_DA_S  1
/** GMAC_CH1_DSL : R/W; bitpos: [6:2]; default: 0;
 *  Descriptor Skip Length This bit specifies the number of Word, Dword, or Lword
 *  _depending on the 32bit, 64bit, or 128bit bus_ to skip between two unchained
 *  descriptors The address skipping starts from the end of current descriptor to the
 *  start of next descriptor When the DSL value is equal to zero, the descriptor table
 *  is taken as contiguous by the DMA in Ring mode
 */
#define GMAC_CH1_DSL    0x0000001FU
#define GMAC_CH1_DSL_M  (GMAC_CH1_DSL_V << GMAC_CH1_DSL_S)
#define GMAC_CH1_DSL_V  0x0000001FU
#define GMAC_CH1_DSL_S  2
/** GMAC_CH1_ATDS : R/W; bitpos: [7]; default: 0;
 *  Alternate Descriptor Size When set, the size of the alternate descriptor _described
 *  in “Alternate or Enhanced Descriptors” on page 545_ increases to 32 bytes _8
 *  DWORDS_ This is required when the Advanced Timestamp feature or the IPC Full
 *  Checksum Offload Engine _Type 2_ is enabled in the receiver The enhanced descriptor
 *  is not required if the Advanced Timestamp and IPC Full Checksum Offload Engine
 *  _Type 2_ features are not enabled In such case, you can use the 16 bytes descriptor
 *  to save 4 bytes of memory This bit is present only when you select the Alternate
 *  Descriptor feature and any one of the following features during core configuration:
 *  Advanced Timestamp feature IPC Full Checksum Offload Engine _Type 2_ feature
 *  Otherwise, this bit is reserved and is readonly When reset, the descriptor size
 *  reverts back to 4 DWORDs _16 bytes_ This bit preserves the backward compatibility
 *  for the descriptor size In versions prior to 350a, the descriptor size is 16 bytes
 *  for both normal and enhanced descriptors In version 350a, descriptor size is
 *  increased to 32 bytes because of the Advanced Timestamp and IPC Full Checksum
 *  Offload Engine _Type 2_ features
 */
#define GMAC_CH1_ATDS    (BIT(7))
#define GMAC_CH1_ATDS_M  (GMAC_CH1_ATDS_V << GMAC_CH1_ATDS_S)
#define GMAC_CH1_ATDS_V  0x00000001U
#define GMAC_CH1_ATDS_S  7
/** GMAC_CH1_PBL : R/W; bitpos: [13:8]; default: 1;
 *  Programmable Burst Length These bits indicate the maximum number of beats to be
 *  transferred in one DMA transaction This is the maximum value that is used in a
 *  single block Read or Write The DMA always attempts to burst as specified in PBL
 *  each time it starts a Burst transfer on the host bus PBL can be programmed with
 *  permissible values of 1, 2, 4, 8, 16, and 32 Any other value results in undefined
 *  behavior When USP is set high, this PBL value is applicable only for Tx DMA
 *  transactions If the number of beats to be transferred is more than 32, then perform
 *  the following steps: 1 Set the PBLx8 mode 2 Set the PBL For example, if the maximum
 *  number of beats to be transferred is 64, then first set PBLx8 to 1 and then set PBL
 *  to 8 The PBL values have the following limitation: The maximum number of possible
 *  beats _PBL_ is limited by the size of the Tx FIFO and Rx FIFO in the MTL layer and
 *  the data bus width on the DMA The FIFO has a constraint that the maximum beat
 *  supported is half the depth of the FIFO, except when specified For different data
 *  bus widths and FIFO sizes, the valid PBL range _including x8 mode_ is provided in
 *  Table 66 on page 382
 */
#define GMAC_CH1_PBL    0x0000003FU
#define GMAC_CH1_PBL_M  (GMAC_CH1_PBL_V << GMAC_CH1_PBL_S)
#define GMAC_CH1_PBL_V  0x0000003FU
#define GMAC_CH1_PBL_S  8
/** GMAC_CH1_PR : R/W; bitpos: [15:14]; default: 0;
 *  Priority Ratio These bits control the priority ratio in the weighted roundrobin
 *  arbitration between the Rx DMA and Tx DMA These bits are valid only when Bit 1 _DA_
 *  is reset The priority ratio is Rx:Tx or Tx:Rx depending on whether Bit 27 _TXPR_ is
 *  reset or set 00: The Priority Ratio is 1:1 01: The Priority Ratio is 2:1 10: The
 *  Priority Ratio is 3:1 11: The Priority Ratio is 4:1 In the GMACAXI configuration,
 *  these bits are reserved and readonly _RO_ For more information about the priority
 *  scheme between the transmit and receive paths, see Table 412 in “DMA Arbiter
 *  Functions” on page 167
 */
#define GMAC_CH1_PR    0x00000003U
#define GMAC_CH1_PR_M  (GMAC_CH1_PR_V << GMAC_CH1_PR_S)
#define GMAC_CH1_PR_V  0x00000003U
#define GMAC_CH1_PR_S  14
/** GMAC_CH1_FB : R/W; bitpos: [16]; default: 0;
 *  Fixed Burst This bit controls whether the AHB or AXI master interface performs
 *  fixed burst transfers or not When set, the AHB interface uses only SINGLE, INCR4,
 *  INCR8, or INCR16 during start of the normal burst transfers When reset, the AHB or
 *  AXI interface uses SINGLE and INCR burst transfer operations For more information,
 *  see Bit 0 _UNDEF_ of the AXI Bus Mode register in the GMACAXI configuration
 */
#define GMAC_CH1_FB    (BIT(16))
#define GMAC_CH1_FB_M  (GMAC_CH1_FB_V << GMAC_CH1_FB_S)
#define GMAC_CH1_FB_V  0x00000001U
#define GMAC_CH1_FB_S  16
/** GMAC_CH1_RPBL : R/W; bitpos: [22:17]; default: 1;
 *  Rx DMA PBL This field indicates the maximum number of beats to be transferred in
 *  one Rx DMA transaction This is the maximum value that is used in a single block
 *  Read or Write The Rx DMA always attempts to burst as specified in the RPBL bit each
 *  time it starts a Burst transfer on the host bus You can program RPBL with values of
 *  1, 2, 4, 8, 16, and 32 Any other value results in undefined behavior This field is
 *  valid and applicable only when USP is set high
 */
#define GMAC_CH1_RPBL    0x0000003FU
#define GMAC_CH1_RPBL_M  (GMAC_CH1_RPBL_V << GMAC_CH1_RPBL_S)
#define GMAC_CH1_RPBL_V  0x0000003FU
#define GMAC_CH1_RPBL_S  17
/** GMAC_CH1_USP : R/W; bitpos: [23]; default: 0;
 *  Use Separate PBL When set high, this bit configures the Rx DMA to use the value
 *  configured in Bits [22:17] as PBL The PBL value in Bits [13:8] is applicable only
 *  to the Tx DMA operations When reset to low, the PBL value in Bits [13:8] is
 *  applicable for both DMA engines
 */
#define GMAC_CH1_USP    (BIT(23))
#define GMAC_CH1_USP_M  (GMAC_CH1_USP_V << GMAC_CH1_USP_S)
#define GMAC_CH1_USP_V  0x00000001U
#define GMAC_CH1_USP_S  23
/** GMAC_CH1_PBLX8 : R/W; bitpos: [24]; default: 0;
 *  PBLx8 Mode When set high, this bit multiplies the programmed PBL value _Bits
 *  [22:17] and Bits[13:8]_ eight times Therefore, the DMA transfers the data in 8, 16,
 *  32, 64, 128, and 256 beats depending on the PBL value Note: This bit function is
 *  not backward compatible Before release 350a, this bit was 4xPBL
 */
#define GMAC_CH1_PBLX8    (BIT(24))
#define GMAC_CH1_PBLX8_M  (GMAC_CH1_PBLX8_V << GMAC_CH1_PBLX8_S)
#define GMAC_CH1_PBLX8_V  0x00000001U
#define GMAC_CH1_PBLX8_S  24
/** GMAC_CH1_AAL : R/W; bitpos: [25]; default: 0;
 *  AddressAligned Beats When this bit is set high and the FB bit is equal to 1, the
 *  AHB or AXI interface generates all bursts aligned to the start address LS bits If
 *  the FB bit is equal to 0, the first burst _accessing the start address of data
 *  buffer_ is not aligned, but subsequent bursts are aligned to the address This bit
 *  is valid only in the GMACAHB and GMACAXI configurations and is reserved _RO with
 *  default value 0_ in all other configurations
 */
#define GMAC_CH1_AAL    (BIT(25))
#define GMAC_CH1_AAL_M  (GMAC_CH1_AAL_V << GMAC_CH1_AAL_S)
#define GMAC_CH1_AAL_V  0x00000001U
#define GMAC_CH1_AAL_S  25
/** GMAC_CH1_MB : R/W; bitpos: [26]; default: 0;
 *  Mixed Burst When this bit is set high and the FB bit is low, the AHB master
 *  interface starts all bursts of length more than 16 with INCR _undefined burst_,
 *  whereas it reverts to fixed burst transfers _INCRx and SINGLE_ for burst length of
 *  16 and less This bit is valid only in the GMACAHB configuration and reserved in all
 *  other configuration
 */
#define GMAC_CH1_MB    (BIT(26))
#define GMAC_CH1_MB_M  (GMAC_CH1_MB_V << GMAC_CH1_MB_S)
#define GMAC_CH1_MB_V  0x00000001U
#define GMAC_CH1_MB_S  26
/** GMAC_CH1_TXPR : R/W; bitpos: [27]; default: 0;
 *  Transmit Priority When set, this bit indicates that the transmit DMA has higher
 *  priority than the receive DMA during arbitration for the systemside bus In the
 *  GMACAXI configuration, this bit is reserved and readonly _RO_ For more information
 *  about the priority scheme between the transmit and receive paths, see Table 412 in
 *  “DMA Arbiter Functions” on page 167
 */
#define GMAC_CH1_TXPR    (BIT(27))
#define GMAC_CH1_TXPR_M  (GMAC_CH1_TXPR_V << GMAC_CH1_TXPR_S)
#define GMAC_CH1_TXPR_V  0x00000001U
#define GMAC_CH1_TXPR_S  27
/** GMAC_CH1_PRWG : R/W; bitpos: [29:28]; default: 0;
 *  Channel Priority Weights This field sets the priority weights for Channel 1 during
 *  the roundrobin arbitration between the DMA channels for the system bus 00: The
 *  priority weight is 1 01: The priority weight is 2 10: The priority weight is 3 11:
 *  The priority weight is 4 This field is present in all DWC_gmac configurations
 *  except GMACAXI when you select the AV feature Otherwise, this field is reserved and
 *  readonly _RO_ For more information about the priority weights of DMA channels, see
 *  “DMA Arbiter Functions” on page 167
 */
#define GMAC_CH1_PRWG    0x00000003U
#define GMAC_CH1_PRWG_M  (GMAC_CH1_PRWG_V << GMAC_CH1_PRWG_S)
#define GMAC_CH1_PRWG_V  0x00000003U
#define GMAC_CH1_PRWG_S  28
/** GMAC_CH1_RIB : R/W; bitpos: [31]; default: 0;
 *  Rebuild INCRx Burst When this bit is set high and the AHB master gets an EBT
 *  _Retry, Split, or Losing bus grant_, the AHB master interface rebuilds the pending
 *  beats of any burst transfer initiated with INCRx The AHB master interface rebuilds
 *  the beats with a combination of specified bursts with INCRx and SINGLE By default,
 *  the AHB master interface rebuilds pending beats of an EBT with an unspecified
 *  _INCR_ burst This bit is valid only in the GMACAHB configuration It is reserved in
 *  all other configuration
 */
#define GMAC_CH1_RIB    (BIT(31))
#define GMAC_CH1_RIB_M  (GMAC_CH1_RIB_V << GMAC_CH1_RIB_S)
#define GMAC_CH1_RIB_V  0x00000001U
#define GMAC_CH1_RIB_S  31

