espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER72_CHANNEL1MISSEDFRAMEANDBUFFEROVERFLOWCOUNTERREGISTER_REG register
 *  Contains the counters for discarded frames because no host Receive Descriptor was
 *  available, and discarded frames because of Receive FIFO Overflow
 */
#define GMAC_REGISTER72_CHANNEL1MISSEDFRAMEANDBUFFEROVERFLOWCOUNTERREGISTER_REG (DR_REG_GMAC_BASE + 0x1120)
/** GMAC_CH1_MISFRMCNT : R/W; bitpos: [15:0]; default: 0;
 *  Missed Frame Counter This field indicates the number of frames missed by the
 *  controller because of the Host Receive Buffer being unavailable This counter is
 *  incremented each time the DMA discards an incoming frame The counter is cleared
 *  when this register is read with mci_be_i[0] at 1’b1
 */
#define GMAC_CH1_MISFRMCNT    0x0000FFFFU
#define GMAC_CH1_MISFRMCNT_M  (GMAC_CH1_MISFRMCNT_V << GMAC_CH1_MISFRMCNT_S)
#define GMAC_CH1_MISFRMCNT_V  0x0000FFFFU
#define GMAC_CH1_MISFRMCNT_S  0
/** GMAC_CH1_MISCNTOVF : R/W; bitpos: [16]; default: 0;
 *  Overflow Bit for Missed Frame Counter This bit is set every time Missed Frame
 *  Counter _Bits[15:0]_ overflows, that is, the DMA discards an incoming frame because
 *  of the Host Receive Buffer being unavailable with the missed frame counter at
 *  maximum value In such a scenario, the Missed frame counter is reset to allzeros and
 *  this bit indicates that the rollover happened
 */
#define GMAC_CH1_MISCNTOVF    (BIT(16))
#define GMAC_CH1_MISCNTOVF_M  (GMAC_CH1_MISCNTOVF_V << GMAC_CH1_MISCNTOVF_S)
#define GMAC_CH1_MISCNTOVF_V  0x00000001U
#define GMAC_CH1_MISCNTOVF_S  16
/** GMAC_CH1_OVFFRMCNT : R/W; bitpos: [27:17]; default: 0;
 *  Overflow Frame Counter This field indicates the number of frames missed by the
 *  application This counter is incremented each time the MTL FIFO overflows The
 *  counter is cleared when this register is read with mci_be_i[2] at 1’b1
 */
#define GMAC_CH1_OVFFRMCNT    0x000007FFU
#define GMAC_CH1_OVFFRMCNT_M  (GMAC_CH1_OVFFRMCNT_V << GMAC_CH1_OVFFRMCNT_S)
#define GMAC_CH1_OVFFRMCNT_V  0x000007FFU
#define GMAC_CH1_OVFFRMCNT_S  17
/** GMAC_CH1_OVFCNTOVF : R/W; bitpos: [28]; default: 0;
 *  Overflow Bit for FIFO Overflow Counter This bit is set every time the Overflow
 *  Frame Counter _Bits[27:17]_ overflows, that is, the Rx FIFO overflows with the
 *  overflow frame counter at maximum value In such a scenario, the overflow frame
 *  counter is reset to allzeros and this bit indicates that the rollover happened
 */
#define GMAC_CH1_OVFCNTOVF    (BIT(28))
#define GMAC_CH1_OVFCNTOVF_M  (GMAC_CH1_OVFCNTOVF_V << GMAC_CH1_OVFCNTOVF_S)
#define GMAC_CH1_OVFCNTOVF_V  0x00000001U
#define GMAC_CH1_OVFCNTOVF_S  28

/** GMAC_REGISTER73_CHANNEL1RECEIVEINTERRUPTWATCHDOGTIMERREGISTER_REG register
 *  Watchdog timeout for Receive Interrupt _RI_ from DMA
 */
#define GMAC_REGISTER73_CHANNEL1RECEIVEINTERRUPTWATCHDOGTIMERREGISTER_REG (DR_REG_GMAC_BASE + 0x1124)
/** GMAC_CH1_RIWT : R/W; bitpos: [7:0]; default: 0;
 *  RI Watchdog Timer Count This bit indicates the number of system clock cycles
 *  multiplied by 256 for which the watchdog timer is set The watchdog timer gets
 *  triggered with the programmed value after the Rx DMA completes the transfer of a
 *  frame for which the RI status bit is not set because of the setting in the
 *  corresponding descriptor RDES1[31] When the watchdog timer runs out, the RI bit is
 *  set and the timer is stopped The watchdog timer is reset when the RI bit is set
 *  high because of automatic setting of RI as per RDES1[31] of any received frame
 */
#define GMAC_CH1_RIWT    0x000000FFU
#define GMAC_CH1_RIWT_M  (GMAC_CH1_RIWT_V << GMAC_CH1_RIWT_S)
#define GMAC_CH1_RIWT_V  0x000000FFU
#define GMAC_CH1_RIWT_S  0

/** GMAC_REGISTER76_CHANNEL1SLOTFUNCTIONCONTROLANDSTATUSREGISTER_REG register
 *  Contains the control bits for slot function and its status for Channel 1 transmit
 *  path
 */
#define GMAC_REGISTER76_CHANNEL1SLOTFUNCTIONCONTROLANDSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x1130)
/** GMAC_ESC : R/W; bitpos: [0]; default: 0;
 *  Enable Slot Comparison When set, this bit enables the checking of the slot numbers,
 *  programmed in the transmit descriptor, with the current reference given in Bits
 *  [19:16] The DMA fetches the data from the corresponding buffer only when the slot
 *  number is equal to the reference slot number or is ahead of the reference slot
 *  number by one slot When reset, this bit disables the checking of the slot numbers
 *  The DMA fetches the data immediately after the descriptor is processed
 */
#define GMAC_ESC    (BIT(0))
#define GMAC_ESC_M  (GMAC_ESC_V << GMAC_ESC_S)
#define GMAC_ESC_V  0x00000001U
#define GMAC_ESC_S  0
/** GMAC_ASC : R/W; bitpos: [1]; default: 0;
 *  Advance Slot Check When set, this bit enables the DMA to fetch the data from the
 *  buffer when the slot number _SLOTNUM_ programmed in the transmit descriptor is:
 *  equal to the reference slot number given in Bits [19:16] or ahead of the reference
 *  slot number by up to two slots This bit is applicable only when Bit 0 _ESC_ is set
 */
#define GMAC_ASC    (BIT(1))
#define GMAC_ASC_M  (GMAC_ASC_V << GMAC_ASC_S)
#define GMAC_ASC_V  0x00000001U
#define GMAC_ASC_S  1
/** GMAC_RSN : RO; bitpos: [19:16]; default: 0;
 *  Reference Slot Number This field gives the current value of the reference slot
 *  number in DMA used for comparison checking
 */
#define GMAC_RSN    0x0000000FU
#define GMAC_RSN_M  (GMAC_RSN_V << GMAC_RSN_S)
#define GMAC_RSN_V  0x0000000FU
#define GMAC_RSN_S  16

/** GMAC_REGISTER82_CHANNEL1CURRENTHOSTTRANSMITDESCRIPTORREGISTER_REG register
 *  Points to the start of current Transmit Descriptor read by the DMA
 */
#define GMAC_REGISTER82_CHANNEL1CURRENTHOSTTRANSMITDESCRIPTORREGISTER_REG (DR_REG_GMAC_BASE + 0x1148)
/** GMAC_CH1_CURTDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Descriptor Address Pointer
 */
#define GMAC_CH1_CURTDESAPTR    0xFFFFFFFFU
#define GMAC_CH1_CURTDESAPTR_M  (GMAC_CH1_CURTDESAPTR_V << GMAC_CH1_CURTDESAPTR_S)
#define GMAC_CH1_CURTDESAPTR_V  0xFFFFFFFFU
#define GMAC_CH1_CURTDESAPTR_S  0

