espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER83_CHANNEL1CURRENTHOSTRECEIVEDESCRIPTORREGISTER_REG register
 *  Points to the start of current Receive Descriptor read by the DMA
 */
#define GMAC_REGISTER83_CHANNEL1CURRENTHOSTRECEIVEDESCRIPTORREGISTER_REG (DR_REG_GMAC_BASE + 0x114c)
/** GMAC_CH1_CURRDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Descriptor Address Pointer
 */
#define GMAC_CH1_CURRDESAPTR    0xFFFFFFFFU
#define GMAC_CH1_CURRDESAPTR_M  (GMAC_CH1_CURRDESAPTR_V << GMAC_CH1_CURRDESAPTR_S)
#define GMAC_CH1_CURRDESAPTR_V  0xFFFFFFFFU
#define GMAC_CH1_CURRDESAPTR_S  0

/** GMAC_REGISTER84_CHANNEL1CURRENTHOSTTRANSMITBUFFERADDRESSREGISTER_REG register
 *  Points to the current Transmit Buffer address read by the DMA
 */
#define GMAC_REGISTER84_CHANNEL1CURRENTHOSTTRANSMITBUFFERADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x1150)
/** GMAC_CH1_CURTBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Buffer Address Pointer
 */
#define GMAC_CH1_CURTBUFAPTR    0xFFFFFFFFU
#define GMAC_CH1_CURTBUFAPTR_M  (GMAC_CH1_CURTBUFAPTR_V << GMAC_CH1_CURTBUFAPTR_S)
#define GMAC_CH1_CURTBUFAPTR_V  0xFFFFFFFFU
#define GMAC_CH1_CURTBUFAPTR_S  0

/** GMAC_REGISTER85_CHANNEL1CURRENTHOSTRECEIVEBUFFERADDRESSREGISTER_REG register
 *  Points to the current Receive Buffer address read by the DMA
 */
#define GMAC_REGISTER85_CHANNEL1CURRENTHOSTRECEIVEBUFFERADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x1154)
/** GMAC_CH1_CURRBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Buffer Address Pointer
 */
#define GMAC_CH1_CURRBUFAPTR    0xFFFFFFFFU
#define GMAC_CH1_CURRBUFAPTR_M  (GMAC_CH1_CURRBUFAPTR_V << GMAC_CH1_CURRBUFAPTR_S)
#define GMAC_CH1_CURRBUFAPTR_V  0xFFFFFFFFU
#define GMAC_CH1_CURRBUFAPTR_S  0

/** GMAC_REGISTER88_CHANNEL1CBSCONTROLREGISTER_REG register
 *  Controls the Channel 1 credit shaping operation on the transmit path
 */
#define GMAC_REGISTER88_CHANNEL1CBSCONTROLREGISTER_REG (DR_REG_GMAC_BASE + 0x1160)
/** GMAC_CH1_CBSD : R/W; bitpos: [0]; default: 0;
 *  CreditBased Shaper Disable When set, the MAC disables the creditbased shaper
 *  algorithm for Channel 1 traffic and makes the traffic management algorithm to
 *  strict priority for Channel 1 over Channel 0 When reset, the creditbased shaper
 *  algorithm schedules the traffic in Channel 1 for transmission
 */
#define GMAC_CH1_CBSD    (BIT(0))
#define GMAC_CH1_CBSD_M  (GMAC_CH1_CBSD_V << GMAC_CH1_CBSD_S)
#define GMAC_CH1_CBSD_V  0x00000001U
#define GMAC_CH1_CBSD_S  0
/** GMAC_CH1_CC : R/W; bitpos: [1]; default: 0;
 *  Credit Control When reset, the accumulated credit parameter in the creditbased
 *  shaper algorithm logic is set to zero when there is positive credit and no frame to
 *  transmit in Channel 1 When there is no frame waiting in Channel 1 and other channel
 *  is transmitting, no credit is accumulated When set, the accumulated credit
 *  parameter in the creditbased shaper algorithm logic is not reset to zero when there
 *  is positive credit and no frame to transmit in Channel 1 The credit accumulates
 *  even when there is no frame waiting in Channel 1 and another channel is transmitting
 */
#define GMAC_CH1_CC    (BIT(1))
#define GMAC_CH1_CC_M  (GMAC_CH1_CC_V << GMAC_CH1_CC_S)
#define GMAC_CH1_CC_V  0x00000001U
#define GMAC_CH1_CC_S  1
/** GMAC_CH1_SLC : R/W; bitpos: [6:4]; default: 0;
 *  Slot Count The software can program the number of slots _of duration 125 microsec_
 *  over which the average transmitted bits per slot _provided in the CBS Status
 *  register_ need to be computed for Channel 1 when the creditbased shaper algorithm
 *  is enabled The encoding is as follows: 3'b000: 1 Slot 3'b001: 2 Slots 3'b010: 4
 *  Slots 3'b011: 8 Slots 3'b100: 16 Slots 3'b1013'b111: Reserved
 */
#define GMAC_CH1_SLC    0x00000007U
#define GMAC_CH1_SLC_M  (GMAC_CH1_SLC_V << GMAC_CH1_SLC_S)
#define GMAC_CH1_SLC_V  0x00000007U
#define GMAC_CH1_SLC_S  4
/** GMAC_CH1_ABPSSIE : R/W; bitpos: [17]; default: 0;
 *  Average Bits Per Slot Interrupt Enable When this bit is set, the MAC asserts an
 *  interrupt _sbd_intr_o or mci_intr_o_ when the average bits per slot status is
 *  updated _Bit 17 _ABSU_ in Register 89_ for Channel 1 When this bit is cleared,
 *  interrupt is not asserted for such an event
 */
#define GMAC_CH1_ABPSSIE    (BIT(17))
#define GMAC_CH1_ABPSSIE_M  (GMAC_CH1_ABPSSIE_V << GMAC_CH1_ABPSSIE_S)
#define GMAC_CH1_ABPSSIE_V  0x00000001U
#define GMAC_CH1_ABPSSIE_S  17

/** GMAC_REGISTER89_CHANNEL1CBSSTATUSREGISTER_REG register
 *  Provides the average traffic transmitted in Channel 1
 */
#define GMAC_REGISTER89_CHANNEL1CBSSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x1164)
/** GMAC_CH1_ABS : RO; bitpos: [16:0]; default: 0;
 *  Average Bits per Slot This field contains the average transmitted bits per slot
 *  This field is computed over programmed number of slots _SLC bits in the CBS Control
 *  Register_ for Channel 1 traffic The maximum value is 0x30D4 for 100 Mbps and
 *  0x1E848 for 1000 Mbps
 */
#define GMAC_CH1_ABS    0x0001FFFFU
#define GMAC_CH1_ABS_M  (GMAC_CH1_ABS_V << GMAC_CH1_ABS_S)
#define GMAC_CH1_ABS_V  0x0001FFFFU
#define GMAC_CH1_ABS_S  0
/** GMAC_CH1_ABSU : RO; bitpos: [17]; default: 0;
 *  ABS Updated When set, this bit indicates that the MAC has updated the ABS value
 *  This bit is cleared when the application reads the ABS value
 */
#define GMAC_CH1_ABSU    (BIT(17))
#define GMAC_CH1_ABSU_M  (GMAC_CH1_ABSU_V << GMAC_CH1_ABSU_S)
#define GMAC_CH1_ABSU_V  0x00000001U
#define GMAC_CH1_ABSU_S  17

/** GMAC_REGISTER90_CHANNEL1IDLESLOPECREDITREGISTER_REG register
 *  Contains the idleSlope credit value required for the creditbased shaper algorithm
 *  for Channel 1
 */
#define GMAC_REGISTER90_CHANNEL1IDLESLOPECREDITREGISTER_REG (DR_REG_GMAC_BASE + 0x1168)
/** GMAC_CH1_ISC : R/W; bitpos: [13:0]; default: 0;
 *  idleSlopeCredit This field contains the idleSlopeCredit value required for the
 *  creditbased shaper algorithm for Channel 1 This is the rate of change of credit in
 *  bits per cycle _40ns and 8ns for 100 Mbps and 1000 Mbps respectively_ when the
 *  credit is increasing The software should program this field with computed credit in
 *  bits per cycle scaled by 1024 The maximum value is portTransmitRate, that is,
 *  0x2000 in 1000 Mbps mode and 0x1000 in 100 Mbps mode
 */
#define GMAC_CH1_ISC    0x00003FFFU
#define GMAC_CH1_ISC_M  (GMAC_CH1_ISC_V << GMAC_CH1_ISC_S)
#define GMAC_CH1_ISC_V  0x00003FFFU
#define GMAC_CH1_ISC_S  0

/** GMAC_REGISTER91_CHANNEL1SENDSLOPECREDITREGISTER_REG register
 *  Contains the sendSlope credit value required for the creditbased shaper algorithm
 *  for Channel 1
 */
#define GMAC_REGISTER91_CHANNEL1SENDSLOPECREDITREGISTER_REG (DR_REG_GMAC_BASE + 0x116c)
/** GMAC_CH1_SSC : R/W; bitpos: [13:0]; default: 0;
 *  sendSlopeCredit This field contains the sendSlopeCredit value required for
 *  creditbased shaper algorithm for Channel 1 This is the rate of change of credit in
 *  bits per cycle _40ns and 8ns for 100 Mbps and 1000 Mbps respectively_ when the
 *  credit is decreasing The software should program this field with computed credit in
 *  bits per cycle scaled by 1024 The maximum value is portTransmitRate, that is,
 *  0x2000 in 1000 Mbps mode and 0x1000 in 100 Mbps mode This field should be
 *  programmed with absolute sendSlopeCredit value The creditbased shaper logic
 *  subtracts it from the accumulated credit when Channel 1 is selected for transmission
 */
#define GMAC_CH1_SSC    0x00003FFFU
#define GMAC_CH1_SSC_M  (GMAC_CH1_SSC_V << GMAC_CH1_SSC_S)
#define GMAC_CH1_SSC_V  0x00003FFFU
#define GMAC_CH1_SSC_S  0

/** GMAC_REGISTER92_CHANNEL1HICREDITREGISTER_REG register
 *  Contains the hiCredit value required for the creditbased shaper algorithm for
 *  Channel 1
 */
#define GMAC_REGISTER92_CHANNEL1HICREDITREGISTER_REG (DR_REG_GMAC_BASE + 0x1170)
/** GMAC_CH1_HC : R/W; bitpos: [28:0]; default: 0;
 *  hiCredit This field contains the hiCredit value required for the creditbased shaper
 *  algorithm for Channel 1 This is the maximum value that can be accumulated in the
 *  credit parameter This is specified in bits scaled by 1,024 The maximum value is
 *  maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes
 *  or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or
 *  0x0800_0000
 */
#define GMAC_CH1_HC    0x1FFFFFFFU
#define GMAC_CH1_HC_M  (GMAC_CH1_HC_V << GMAC_CH1_HC_S)
#define GMAC_CH1_HC_V  0x1FFFFFFFU
#define GMAC_CH1_HC_S  0

