espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER136_CHANNEL2MISSEDFRAMEANDBUFFEROVERFLOWCOUNTERREGISTER_REG register
 *  Contains the counters for discarded frames because no host Receive Descriptor was
 *  available or because of Receive FIFO Overflow
 */
#define GMAC_REGISTER136_CHANNEL2MISSEDFRAMEANDBUFFEROVERFLOWCOUNTERREGISTER_REG (DR_REG_GMAC_BASE + 0x1220)
/** GMAC_CH2_MISFRMCNT : R/W; bitpos: [15:0]; default: 0;
 *  Missed Frame Counter This field indicates the number of frames missed by the
 *  controller because of the Host Receive Buffer being unavailable This counter is
 *  incremented each time the DMA discards an incoming frame The counter is cleared
 *  when this register is read with mci_be_i[0] at 1’b1
 */
#define GMAC_CH2_MISFRMCNT    0x0000FFFFU
#define GMAC_CH2_MISFRMCNT_M  (GMAC_CH2_MISFRMCNT_V << GMAC_CH2_MISFRMCNT_S)
#define GMAC_CH2_MISFRMCNT_V  0x0000FFFFU
#define GMAC_CH2_MISFRMCNT_S  0
/** GMAC_CH2_MISCNTOVF : R/W; bitpos: [16]; default: 0;
 *  Overflow Bit for Missed Frame Counter This bit is set every time Missed Frame
 *  Counter _Bits[15:0]_ overflows, that is, the DMA discards an incoming frame because
 *  of the Host Receive Buffer being unavailable with the missed frame counter at
 *  maximum value In such a scenario, the Missed frame counter is reset to allzeros and
 *  this bit indicates that the rollover happened
 */
#define GMAC_CH2_MISCNTOVF    (BIT(16))
#define GMAC_CH2_MISCNTOVF_M  (GMAC_CH2_MISCNTOVF_V << GMAC_CH2_MISCNTOVF_S)
#define GMAC_CH2_MISCNTOVF_V  0x00000001U
#define GMAC_CH2_MISCNTOVF_S  16
/** GMAC_CH2_OVFFRMCNT : R/W; bitpos: [27:17]; default: 0;
 *  Overflow Frame Counter This field indicates the number of frames missed by the
 *  application This counter is incremented each time the MTL FIFO overflows The
 *  counter is cleared when this register is read with mci_be_i[2] at 1’b1
 */
#define GMAC_CH2_OVFFRMCNT    0x000007FFU
#define GMAC_CH2_OVFFRMCNT_M  (GMAC_CH2_OVFFRMCNT_V << GMAC_CH2_OVFFRMCNT_S)
#define GMAC_CH2_OVFFRMCNT_V  0x000007FFU
#define GMAC_CH2_OVFFRMCNT_S  17
/** GMAC_CH2_OVFCNTOVF : R/W; bitpos: [28]; default: 0;
 *  Overflow Bit for FIFO Overflow Counter This bit is set every time the Overflow
 *  Frame Counter _Bits[27:17]_ overflows, that is, the Rx FIFO overflows with the
 *  overflow frame counter at maximum value In such a scenario, the overflow frame
 *  counter is reset to allzeros and this bit indicates that the rollover happened
 */
#define GMAC_CH2_OVFCNTOVF    (BIT(28))
#define GMAC_CH2_OVFCNTOVF_M  (GMAC_CH2_OVFCNTOVF_V << GMAC_CH2_OVFCNTOVF_S)
#define GMAC_CH2_OVFCNTOVF_V  0x00000001U
#define GMAC_CH2_OVFCNTOVF_S  28

/** GMAC_REGISTER137_CHANNEL2RECEIVEINTERRUPTWATCHDOGTIMERREGISTER_REG register
 *  Watchdog timeout for Receive Interrupt _RI_ from DMA
 */
#define GMAC_REGISTER137_CHANNEL2RECEIVEINTERRUPTWATCHDOGTIMERREGISTER_REG (DR_REG_GMAC_BASE + 0x1224)
/** GMAC_CH2_RIWT : R/W; bitpos: [7:0]; default: 0;
 *  RI Watchdog Timer Count This bit indicates the number of system clock cycles
 *  multiplied by 256 for which the watchdog timer is set The watchdog timer gets
 *  triggered with the programmed value after the Rx DMA completes the transfer of a
 *  frame for which the RI status bit is not set because of the setting in the
 *  corresponding descriptor RDES1[31] When the watchdog timer runs out, the RI bit is
 *  set and the timer is stopped The watchdog timer is reset when the RI bit is set
 *  high because of automatic setting of RI as per RDES1[31] of any received frame
 */
#define GMAC_CH2_RIWT    0x000000FFU
#define GMAC_CH2_RIWT_M  (GMAC_CH2_RIWT_V << GMAC_CH2_RIWT_S)
#define GMAC_CH2_RIWT_V  0x000000FFU
#define GMAC_CH2_RIWT_S  0

/** GMAC_REGISTER146_CHANNEL2CURRENTHOSTTRANSMITDESCRIPTORREGISTER_REG register
 *  Points to the start of current Transmit Descriptor read by the DMA
 */
#define GMAC_REGISTER146_CHANNEL2CURRENTHOSTTRANSMITDESCRIPTORREGISTER_REG (DR_REG_GMAC_BASE + 0x1248)
/** GMAC_CH2_CURTDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Descriptor Address Pointer
 */
#define GMAC_CH2_CURTDESAPTR    0xFFFFFFFFU
#define GMAC_CH2_CURTDESAPTR_M  (GMAC_CH2_CURTDESAPTR_V << GMAC_CH2_CURTDESAPTR_S)
#define GMAC_CH2_CURTDESAPTR_V  0xFFFFFFFFU
#define GMAC_CH2_CURTDESAPTR_S  0

/** GMAC_REGISTER147_CHANNEL2CURRENTHOSTRECEIVEDESCRIPTORREGISTER_REG register
 *  Points to the start of current Receive Descriptor read by the DMA
 */
#define GMAC_REGISTER147_CHANNEL2CURRENTHOSTRECEIVEDESCRIPTORREGISTER_REG (DR_REG_GMAC_BASE + 0x124c)
/** GMAC_CH2_CURRDESAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Descriptor Address Pointer
 */
#define GMAC_CH2_CURRDESAPTR    0xFFFFFFFFU
#define GMAC_CH2_CURRDESAPTR_M  (GMAC_CH2_CURRDESAPTR_V << GMAC_CH2_CURRDESAPTR_S)
#define GMAC_CH2_CURRDESAPTR_V  0xFFFFFFFFU
#define GMAC_CH2_CURRDESAPTR_S  0

/** GMAC_REGISTER148_CHANNEL2CURRENTHOSTTRANSMITBUFFERADDRESSREGISTER_REG register
 *  Points to the current Transmit Buffer address read by the DMA
 */
#define GMAC_REGISTER148_CHANNEL2CURRENTHOSTTRANSMITBUFFERADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x1250)
/** GMAC_CH2_CURTBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Transmit Buffer Address Pointer
 */
#define GMAC_CH2_CURTBUFAPTR    0xFFFFFFFFU
#define GMAC_CH2_CURTBUFAPTR_M  (GMAC_CH2_CURTBUFAPTR_V << GMAC_CH2_CURTBUFAPTR_S)
#define GMAC_CH2_CURTBUFAPTR_V  0xFFFFFFFFU
#define GMAC_CH2_CURTBUFAPTR_S  0

/** GMAC_REGISTER149_CHANNEL2CURRENTHOSTRECEIVEBUFFERADDRESSREGISTER_REG register
 *  Points to the current Receive Buffer address read by the DMA
 */
#define GMAC_REGISTER149_CHANNEL2CURRENTHOSTRECEIVEBUFFERADDRESSREGISTER_REG (DR_REG_GMAC_BASE + 0x1254)
/** GMAC_CH2_CURRBUFAPTR : RO; bitpos: [31:0]; default: 0;
 *  Host Receive Buffer Address Pointer
 */
#define GMAC_CH2_CURRBUFAPTR    0xFFFFFFFFU
#define GMAC_CH2_CURRBUFAPTR_M  (GMAC_CH2_CURRBUFAPTR_V << GMAC_CH2_CURRBUFAPTR_S)
#define GMAC_CH2_CURRBUFAPTR_V  0xFFFFFFFFU
#define GMAC_CH2_CURRBUFAPTR_S  0

/** GMAC_REGISTER152_CHANNEL2CBSCONTROLREGISTER_REG register
 *  Controls the Channel 2 credit shaping operation on the transmit path
 */
#define GMAC_REGISTER152_CHANNEL2CBSCONTROLREGISTER_REG (DR_REG_GMAC_BASE + 0x1260)
/** GMAC_CH2_CBSD : R/W; bitpos: [0]; default: 0;
 *  CreditBased Shaper Disable When set, the MAC disables the creditbased shaper
 *  algorithm for Channel 2 traffic and makes the traffic management algorithm to
 *  strict priority for Channel 2 over Channel 0 When reset, the creditbased shaper
 *  algorithm schedules the traffic in Channel 2 for transmission
 */
#define GMAC_CH2_CBSD    (BIT(0))
#define GMAC_CH2_CBSD_M  (GMAC_CH2_CBSD_V << GMAC_CH2_CBSD_S)
#define GMAC_CH2_CBSD_V  0x00000001U
#define GMAC_CH2_CBSD_S  0
/** GMAC_CH2_CC : R/W; bitpos: [1]; default: 0;
 *  Credit Control When reset, the accumulated credit parameter in the creditbased
 *  shaper algorithm logic is set to zero when there is positive credit and no frame to
 *  transmit in Channel 2 When there is no frame waiting in Channel 2 and other channel
 *  is transmitting, no credit is accumulated When set, the accumulated credit
 *  parameter in the creditbased shaper algorithm logic is not reset to zero when there
 *  is positive credit and no frame to transmit in Channel 2 The credit accumulates
 *  even when there is no frame waiting in Channel 2 and another channel is transmitting
 */
#define GMAC_CH2_CC    (BIT(1))
#define GMAC_CH2_CC_M  (GMAC_CH2_CC_V << GMAC_CH2_CC_S)
#define GMAC_CH2_CC_V  0x00000001U
#define GMAC_CH2_CC_S  1
/** GMAC_CH2_SLC : R/W; bitpos: [6:4]; default: 0;
 *  Slot Count The software can program the number of slots _of duration 125 microsec_
 *  over which the average transmitted bits per slot _provided in the CBS Status
 *  register_ need to be computed for Channel 2 when the creditbased shaper algorithm
 *  is enabled The encoding is as follows: 3'b000: 1 Slot 3'b001: 2 Slots 3'b010: 4
 *  Slots 3'b011: 8 Slots 3'b100: 16 Slots 3'b1013'b111: Reserved
 */
#define GMAC_CH2_SLC    0x00000007U
#define GMAC_CH2_SLC_M  (GMAC_CH2_SLC_V << GMAC_CH2_SLC_S)
#define GMAC_CH2_SLC_V  0x00000007U
#define GMAC_CH2_SLC_S  4
/** GMAC_CH2_ABPSSIE : R/W; bitpos: [17]; default: 0;
 *  Average Bits Per Slot Interrupt Enable When this bit is set, the MAC asserts an
 *  interrupt _sbd_intr_o or mci_intr_o_ when the average bits per slot status is
 *  updated _Bit 17 _ABSU_ in Register 153_ for Channel 2 When this bit is cleared,
 *  interrupt is not asserted for such an event
 */
#define GMAC_CH2_ABPSSIE    (BIT(17))
#define GMAC_CH2_ABPSSIE_M  (GMAC_CH2_ABPSSIE_V << GMAC_CH2_ABPSSIE_S)
#define GMAC_CH2_ABPSSIE_V  0x00000001U
#define GMAC_CH2_ABPSSIE_S  17

/** GMAC_REGISTER153_CHANNEL2CBSSTATUSREGISTER_REG register
 *  Provides the average traffic transmitted in Channel 2
 */
#define GMAC_REGISTER153_CHANNEL2CBSSTATUSREGISTER_REG (DR_REG_GMAC_BASE + 0x1264)
/** GMAC_CH2_ABS : RO; bitpos: [16:0]; default: 0;
 *  Average Bits per Slot This field contains the average transmitted bits per slot
 *  This field is computed over programmed number of slots _SLC bits in the CBS Control
 *  Register_ for Channel 2 traffic The maximum value is 0x30D4 for 100 Mbps and
 *  0x1E848 for 1000 Mbps
 */
#define GMAC_CH2_ABS    0x0001FFFFU
#define GMAC_CH2_ABS_M  (GMAC_CH2_ABS_V << GMAC_CH2_ABS_S)
#define GMAC_CH2_ABS_V  0x0001FFFFU
#define GMAC_CH2_ABS_S  0
/** GMAC_CH2_ABSU : RO; bitpos: [17]; default: 0;
 *  ABS Updated When set, this bit indicates that the MAC has updated the ABS value
 *  This bit is cleared when the application reads the ABS value
 */
#define GMAC_CH2_ABSU    (BIT(17))
#define GMAC_CH2_ABSU_M  (GMAC_CH2_ABSU_V << GMAC_CH2_ABSU_S)
#define GMAC_CH2_ABSU_V  0x00000001U
#define GMAC_CH2_ABSU_S  17

/** GMAC_REGISTER154_CHANNEL2IDLESLOPECREDITREGISTER_REG register
 *  Contains the idleSlope credit value required for the creditbased shaper algorithm
 *  for Channel 2
 */
#define GMAC_REGISTER154_CHANNEL2IDLESLOPECREDITREGISTER_REG (DR_REG_GMAC_BASE + 0x1268)
/** GMAC_CH2_ISC : R/W; bitpos: [13:0]; default: 0;
 *  idleSlopeCredit This field contains the idleSlopeCredit value required for the
 *  creditbased shaper algorithm for Channel 2 This is the rate of change of credit in
 *  bits per cycle _40ns and 8ns for 100 Mbps and 1000 Mbps respectively_ when the
 *  credit is increasing The software should program this field with computed credit in
 *  bits per cycle scaled by 1024 The maximum value is portTransmitRate, that is,
 *  0x2000 in 1000 Mbps mode and 0x1000 in 100 Mbps mode
 */
#define GMAC_CH2_ISC    0x00003FFFU
#define GMAC_CH2_ISC_M  (GMAC_CH2_ISC_V << GMAC_CH2_ISC_S)
#define GMAC_CH2_ISC_V  0x00003FFFU
#define GMAC_CH2_ISC_S  0

