espressif/esp-idf/components/soc/esp32s31/register/soc/gmac_reg.h
/** GMAC_REGISTER155_CHANNEL2SENDSLOPECREDITREGISTER_REG register
 *  Contains the sendSlope credit value required for the creditbased shaper algorithm
 *  for Channel 2
 */
#define GMAC_REGISTER155_CHANNEL2SENDSLOPECREDITREGISTER_REG (DR_REG_GMAC_BASE + 0x126c)
/** GMAC_CH2_SSC : R/W; bitpos: [13:0]; default: 0;
 *  sendSlopeCredit This field contains the sendSlopeCredit value required for
 *  creditbased shaper algorithm for Channel 2 This is the rate of change of credit in
 *  bits per cycle _40ns and 8ns for 100 Mbps and 1000 Mbps respectively_ when the
 *  credit is decreasing The software should program this field with computed credit in
 *  bits per cycle scaled by 1024 The maximum value is portTransmitRate, that is,
 *  0x2000 in 1000 Mbps mode and 0x1000 in 100 Mbps mode This field should be
 *  programmed with absolute sendSlopeCredit value The creditbased shaper logic
 *  subtracts it from the accumulated credit when Channel 2 is selected for transmission
 */
#define GMAC_CH2_SSC    0x00003FFFU
#define GMAC_CH2_SSC_M  (GMAC_CH2_SSC_V << GMAC_CH2_SSC_S)
#define GMAC_CH2_SSC_V  0x00003FFFU
#define GMAC_CH2_SSC_S  0

/** GMAC_REGISTER156_CHANNEL2HICREDITREGISTER_REG register
 *  Contains the hiCredit value required for the creditbased shaper algorithm for
 *  Channel 2
 */
#define GMAC_REGISTER156_CHANNEL2HICREDITREGISTER_REG (DR_REG_GMAC_BASE + 0x1270)
/** GMAC_CH2_HC : R/W; bitpos: [28:0]; default: 0;
 *  hiCredit This field contains the hiCredit value required for the creditbased shaper
 *  algorithm for Channel 2 This is the maximum value that can be accumulated in the
 *  credit parameter This is specified in bits scaled by 1,024 The maximum value is
 *  maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes
 *  or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or
 *  0x0800_0000
 */
#define GMAC_CH2_HC    0x1FFFFFFFU
#define GMAC_CH2_HC_M  (GMAC_CH2_HC_V << GMAC_CH2_HC_S)
#define GMAC_CH2_HC_V  0x1FFFFFFFU
#define GMAC_CH2_HC_S  0

/** GMAC_REGISTER157_CHANNEL2LOCREDITREGISTER_REG register
 *  Contains the loCredit value required for the creditbased shaper algorithm for
 *  Channel 2
 */
#define GMAC_REGISTER157_CHANNEL2LOCREDITREGISTER_REG (DR_REG_GMAC_BASE + 0x1274)
/** GMAC_CH2_LC : R/W; bitpos: [28:0]; default: 536870911;
 *  loCredit This field contains the loCredit value required for the creditbased shaper
 *  algorithm for Channel 2 This is the minimum value that can be accumulated in the
 *  credit parameter This is specified in bits scaled by 1,024 The maximum value is
 *  maxInterferenceSize, that is, besteffort maximum frame size which is 16,384 bytes
 *  or 131,072 bits The value to be specified is 131,072 * 1,024 = 134,217,728 or
 *  0x0800_0000 The programmed value is 2's complement _negative number_, that is,
 *  0xF800_0000
 */
#define GMAC_CH2_LC    0x1FFFFFFFU
#define GMAC_CH2_LC_M  (GMAC_CH2_LC_V << GMAC_CH2_LC_S)
#define GMAC_CH2_LC_V  0x1FFFFFFFU
#define GMAC_CH2_LC_S  0

#ifdef __cplusplus
}
#endif
